STM8-SPL-license/discussion/Header/STM8TL5x.h
  // include intrinsic functions
  #include <intrinsics.h>

  // macros to unify ISR declaration and implementation
  #define ISR_HANDLER(func,irq)  __interrupt void func(void)          ///< handler for interrupt service routine
  //#define ISR_HANDLER_TRAP(func) void func(void) trap                 ///< handler for trap service routine

  // common assembler instructions
  #define NOP()                  __no_operation()                     ///< perform a nop() operation (=minimum delay)
  #define DISABLE_INTERRUPTS()   __disable_interrupt()                ///< disable interrupt handling
  #define ENABLE_INTERRUPTS()    __enable_interrupt()                 ///< enable interrupt handling
  #define TRIGGER_TRAP           __trap()                             ///< trigger a trap (=soft interrupt) e.g. for EMC robustness (see AN1015)
  #define WAIT_FOR_INTERRUPT()   __wait_for_interrupt()               ///< stop code execution and wait for interrupt
  #define ENTER_HALT()           __halt()                             ///< put controller to HALT mode
  #define SW_RESET()             (_WWDG_CR=0xBF)                      ///< reset controller via WWGD module

  // data type in bit fields
  #define _BITS                  unsigned char                        ///< data type in bit structs (deviating from C90 standard)

// SDCC compiler
#elif defined(_SDCC_)

  // macros to unify ISR declaration and implementation
  #define ISR_HANDLER(func,irq)   void func(void) __interrupt(irq)    ///< handler for interrupt service routine
  #if SDCC_VERSION >= 30403  // traps require >=v3.4.3
    #define ISR_HANDLER_TRAP(func)  void func() __trap                ///< handler for trap service routine
  #else
    #error traps require SDCC >=3.4.3. Please update!
  #endif

  // common assembler instructions
  #define NOP()                  __asm__("nop")                       ///< perform a nop() operation (=minimum delay)
  #define DISABLE_INTERRUPTS()   __asm__("sim")                       ///< disable interrupt handling
  #define ENABLE_INTERRUPTS()    __asm__("rim")                       ///< enable interrupt handling
  #define TRIGGER_TRAP           __asm__("trap")                      ///< trigger a trap (=soft interrupt) e.g. for EMC robustness (see AN1015)
  #define WAIT_FOR_INTERRUPT()   __asm__("wfi")                       ///< stop code execution and wait for interrupt
  #define ENTER_HALT()           __asm__("halt")                      ///< put controller to HALT mode
  #define SW_RESET()             (_WWDG_CR=0xBF)                      ///< reset controller via WWGD module

  // data type in bit fields
  #define _BITS                  unsigned int                         ///< data type in bit structs (follow C90 standard)

#endif


/*-----------------------------------------------------------------------------
    DEFINITION OF GLOBAL MACROS/#DEFINES
-----------------------------------------------------------------------------*/

// general macros
#define _SFR(type, addr)       (*((volatile type*) (addr)))           ///< peripheral register


/*-----------------------------------------------------------------------------
    STANDARD DATA TYPES
-----------------------------------------------------------------------------*/
#if defined(_COSMIC_) || defined(_RAISONANCE_) || defined(_IAR_)

  // skip if already defined
  #ifndef INT8_MAX

    // compiler specific --> If possible, use <stdint.h> from compiler
    typedef signed long     int32_t;
    typedef signed short    int16_t;
    typedef signed char     int8_t;

    typedef unsigned long   uint32_t;
    typedef unsigned short  uint16_t;
    typedef unsigned char   uint8_t;


    // define min/max values
    #define   INT8_MAX      0x7f
    #define   INT8_MIN      (-INT8_MAX - 1)

    #define   UINT8_MAX     0xFF
    #define   UINT8_MIN     0

    #define   INT16_MAX     0x7fff
    #define   INT16_MIN     (-INT16_MAX - 1)

    #define   UINT16_MAX    0xFFFF
    #define   UINT16_MIN    0

    #define   INT32_MAX     0x7fffffffL
    #define   INT32_MIN     (-INT32_MAX - 1L)

    #define   UINT32_MAX    0xFFFFFFFF
    #define   UINT32_MIN    0

  #endif // INT8_MAX

#elif defined(_SDCC_)

  // use compiler header
  #include <stdint.h>

#endif


/*-----------------------------------------------------------------------------
    ISR Vector Table (SDCC, Raisonance, IAR)
    Note: IAR has an IRQ offset of +2 compared to STM8 datasheet (see below)
-----------------------------------------------------------------------------*/

// reserved                       0
#define __FLASH_VECTOR__          1       ///< irq1 - flash interrupt
#define __PXS_VECTOR__            2       ///< irq2 - proximity sense interrupt
// reserved                       3
#define __AWU_VECTOR__            4       ///< irq4 - Auto Wake Up from Halt interrupt (AWU)
// reserved                       5
#define __PORTB_VECTOR__          6       ///< irq6 - External interrupt port B
#define __PORTD_VECTOR__          7       ///< irq7 - External interrupt port D
#define __EXTI0_VECTOR__          8       ///< irq8 - External interrupt 0
#define __EXTI1_VECTOR__          9       ///< irq9 - External interrupt 1
#define __EXTI2_VECTOR__          10      ///< irq10 - External interrupt 2
#define __EXTI3_VECTOR__          11      ///< irq11 - External interrupt 3
#define __EXTI4_VECTOR__          12      ///< irq12 - External interrupt 4
#define __EXTI5_VECTOR__          13      ///< irq13 - External interrupt 5
#define __EXTI6_VECTOR__          14      ///< irq14 - External interrupt 6
#define __EXTI7_VECTOR__          15      ///< irq15 - External interrupt 7
// reserved                       16
// reserved                       17
// reserved                       18
#define __TIM2_UPD_OVF_VECTOR__   19      ///< irq19 - TIM2 Update/overflow/trigger/break interrupt
#define __TIM2_CAPCOM_VECTOR__    20      ///< irq20 - TIM2 Capture/Compare interrupt
#define __TIM3_UPD_OVF_VECTOR__   21      ///< irq21 - TIM3 Update/overflow/break interrupt
#define __TIM3_CAPCOM_VECTOR__    22      ///< irq22 - TIM3 Capture/Compare interrupt
// reserved                       23
// reserved                       24
#define __TIM4_UPD_VECTOR__       25      ///< irq25 - TIM4 Update/trigger interrupt
#define __SPI_VECTOR__            26      ///< irq26 - SPI End of transfer interrupt
#define __USART_TXE_VECTOR__      27      ///< irq27 - USART send (TX empty) interrupt
#define __USART_RXF_VECTOR__      28      ///< irq28 - USART receive (RX full) interrupt
#define __I2C_VECTOR__            29      ///< irq29 - I2C interrupt



/*-----------------------------------------------------------------------------
    DEFINITION OF STM8 PERIPHERAL REGISTERS
-----------------------------------------------------------------------------*/

//------------------------
// General purpose input/output pins (PORT)
//------------------------
#if defined(PORTA_AddressBase) || defined(PORTB_AddressBase) || defined(PORTD_AddressBase)

  /** @brief structure for controlling pins in PORT mode (PORTx, x=A..I) */
  typedef struct {

