STM8-SPL-license/discussion/Header/STM8TL5x.h
    /** @brief Port x output data register (Px_ODR) */
    struct {
      _BITS   PIN0    : 1;    ///< pin 0 output control
      _BITS   PIN1    : 1;    ///< pin 1 output control
      _BITS   PIN2    : 1;    ///< pin 2 output control
      _BITS   PIN3    : 1;    ///< pin 3 output control
      _BITS   PIN4    : 1;    ///< pin 4 output control
      _BITS   PIN5    : 1;    ///< pin 5 output control
      _BITS   PIN6    : 1;    ///< pin 6 output control
      _BITS   PIN7    : 1;    ///< pin 7 output control
    } ODR;

    /** @brief Port x input data register (Px_IDR) */
    struct {
      _BITS   PIN0    : 1;    ///< pin 0 input control
      _BITS   PIN1    : 1;    ///< pin 1 input control
      _BITS   PIN2    : 1;    ///< pin 2 input control
      _BITS   PIN3    : 1;    ///< pin 3 input control
      _BITS   PIN4    : 1;    ///< pin 4 input control
      _BITS   PIN5    : 1;    ///< pin 5 input control
      _BITS   PIN6    : 1;    ///< pin 6 input control
      _BITS   PIN7    : 1;    ///< pin 7 input control
    } IDR;

    /** @brief Port x data direction data register (Px_DDR) */
    struct {
      _BITS   PIN0    : 1;    ///< pin 0 direction control
      _BITS   PIN1    : 1;    ///< pin 1 direction control
      _BITS   PIN2    : 1;    ///< pin 2 direction control
      _BITS   PIN3    : 1;    ///< pin 3 direction control
      _BITS   PIN4    : 1;    ///< pin 4 direction control
      _BITS   PIN5    : 1;    ///< pin 5 direction control
      _BITS   PIN6    : 1;    ///< pin 6 direction control
      _BITS   PIN7    : 1;    ///< pin 7 direction control
    } DDR;

    /** @brief Port x control register 1 (Px_CR1) */
    struct {
      _BITS   PIN0    : 1;    ///< pin 0 control register 1
      _BITS   PIN1    : 1;    ///< pin 1 control register 1
      _BITS   PIN2    : 1;    ///< pin 2 control register 1
      _BITS   PIN3    : 1;    ///< pin 3 control register 1
      _BITS   PIN4    : 1;    ///< pin 4 control register 1
      _BITS   PIN5    : 1;    ///< pin 5 control register 1
      _BITS   PIN6    : 1;    ///< pin 6 control register 1
      _BITS   PIN7    : 1;    ///< pin 7 control register 1
    } CR1;

    /** @brief Port x control register 1 (Px_CR2) */
    struct {
      _BITS   PIN0    : 1;    ///< pin 0 control register 2
      _BITS   PIN1    : 1;    ///< pin 1 control register 2
      _BITS   PIN2    : 1;    ///< pin 2 control register 2
      _BITS   PIN3    : 1;    ///< pin 3 control register 2
      _BITS   PIN4    : 1;    ///< pin 4 control register 2
      _BITS   PIN5    : 1;    ///< pin 5 control register 2
      _BITS   PIN6    : 1;    ///< pin 6 control register 2
      _BITS   PIN7    : 1;    ///< pin 7 control register 2
    } CR2;

  } PORT_t;

  /* Pointer to port A registers */
  #if defined(PORTA_AddressBase)
    #define _GPIOA      _SFR(PORT_t,  PORTA_AddressBase)       ///< port A struct/bit access
    #define _GPIOA_ODR  _SFR(uint8_t, PORTA_AddressBase+0x00)  ///< port A output register
    #define _GPIOA_IDR  _SFR(uint8_t, PORTA_AddressBase+0x01)  ///< port A input register
    #define _GPIOA_DDR  _SFR(uint8_t, PORTA_AddressBase+0x02)  ///< port A direction register
    #define _GPIOA_CR1  _SFR(uint8_t, PORTA_AddressBase+0x03)  ///< port A control register 1
    #define _GPIOA_CR2  _SFR(uint8_t, PORTA_AddressBase+0x04)  ///< port A control register 2
  #endif

  /* Pointer to port B registers */
  #if defined(PORTB_AddressBase)
    #define _GPIOB      _SFR(PORT_t,  PORTB_AddressBase)       ///< port B struct/bit access
    #define _GPIOB_ODR  _SFR(uint8_t, PORTB_AddressBase+0x00)  ///< port B output register
    #define _GPIOB_IDR  _SFR(uint8_t, PORTB_AddressBase+0x01)  ///< port B input register
    #define _GPIOB_DDR  _SFR(uint8_t, PORTB_AddressBase+0x02)  ///< port B direction register
    #define _GPIOB_CR1  _SFR(uint8_t, PORTB_AddressBase+0x03)  ///< port B control register 1
    #define _GPIOB_CR2  _SFR(uint8_t, PORTB_AddressBase+0x04)  ///< port B control register 2
  #endif

  /* Pointer to port D registers */
  #if defined(PORTD_AddressBase)
    #define _GPIOD      _SFR(PORT_t,  PORTD_AddressBase)       ///< port D struct/bit access
    #define _GPIOD_ODR  _SFR(uint8_t, PORTD_AddressBase+0x00)  ///< port D output register
    #define _GPIOD_IDR  _SFR(uint8_t, PORTD_AddressBase+0x01)  ///< port D input register
    #define _GPIOD_DDR  _SFR(uint8_t, PORTD_AddressBase+0x02)  ///< port D direction register
    #define _GPIOD_CR1  _SFR(uint8_t, PORTD_AddressBase+0x03)  ///< port D control register 1
    #define _GPIOD_CR2  _SFR(uint8_t, PORTD_AddressBase+0x04)  ///< port D control register 2
  #endif

  /* PORT Module Reset Values (all ports) */
  #define _GPIO_ODR_RESET_VALUE     ((uint8_t) 0x00)           ///< port output register reset value
  #define _GPIO_DDR_RESET_VALUE     ((uint8_t) 0x00)           ///< port direction register reset value
  #define _GPIO_CR1_RESET_VALUE     ((uint8_t) 0x00)           ///< port control register 1 reset value
  #define _GPIO_CR2_RESET_VALUE     ((uint8_t) 0x00)           ///< port control register 2 reset value

  /* macro for accessing pin registers (all ports) */
  #define _GPIO_PIN0   ((uint8_t) (0x01 << 0))                 ///< port bit mask for pin 0 (in _GPIOI_ODR, _GPIOI_IDR, _GPIOI_DDR, _GPIOI_CR1, _GPIOI_CR2)
  #define _GPIO_PIN1   ((uint8_t) (0x01 << 1))                 ///< port bit mask for pin 1 (in _GPIOI_ODR, _GPIOI_IDR, _GPIOI_DDR, _GPIOI_CR1, _GPIOI_CR2)
  #define _GPIO_PIN2   ((uint8_t) (0x01 << 2))                 ///< port bit mask for pin 2 (in _GPIOI_ODR, _GPIOI_IDR, _GPIOI_DDR, _GPIOI_CR1, _GPIOI_CR2)
  #define _GPIO_PIN3   ((uint8_t) (0x01 << 3))                 ///< port bit mask for pin 3 (in _GPIOI_ODR, _GPIOI_IDR, _GPIOI_DDR, _GPIOI_CR1, _GPIOI_CR2)
  #define _GPIO_PIN4   ((uint8_t) (0x01 << 4))                 ///< port bit mask for pin 4 (in _GPIOI_ODR, _GPIOI_IDR, _GPIOI_DDR, _GPIOI_CR1, _GPIOI_CR2)
  #define _GPIO_PIN5   ((uint8_t) (0x01 << 5))                 ///< port bit mask for pin 5 (in _GPIOI_ODR, _GPIOI_IDR, _GPIOI_DDR, _GPIOI_CR1, _GPIOI_CR2)
  #define _GPIO_PIN6   ((uint8_t) (0x01 << 6))                 ///< port bit mask for pin 6 (in _GPIOI_ODR, _GPIOI_IDR, _GPIOI_DDR, _GPIOI_CR1, _GPIOI_CR2)
  #define _GPIO_PIN7   ((uint8_t) (0x01 << 7))                 ///< port bit mask for pin 7 (in _GPIOI_ODR, _GPIOI_IDR, _GPIOI_DDR, _GPIOI_CR1, _GPIOI_CR2)

#endif // PORTx_AddressBase



//------------------------
// Non-volative memory (FLASH)
//------------------------
#if defined(FLASH_AddressBase)

  /** @brief struct to control write/erase of flash memory (FLASH) */
  typedef struct {

    /** @brief Flash control register 1 (FLASH_CR1) */
    struct {
      _BITS   FIX   : 1;    ///< Fixed Byte programming time
      _BITS   IE    : 1;    ///< Flash Interrupt enable
      _BITS         : 6;    //   Reserved
    } CR1;


    /** @brief Flash control register 2 (FLASH_CR2) */
    struct {
      _BITS   PRG   : 1;    ///< Standard block programming
      _BITS         : 3;    //   Reserved
      _BITS   FPRG  : 1;    ///< Fast block programming
      _BITS   ERASE : 1;    ///< Block erasingprox
      _BITS   WPRG  : 1;    ///< Word programming
      _BITS   OPT   : 1;    ///< Write option bytes
    } CR2;


    /** @brief Flash program memory unprotecting key register (FLASH_PUKR) */
    struct {
      _BITS   PUK    : 8;   ///< Program memory write unlock key
    } PUKR;


    /** @brief Data EEPROM unprotection key register (FLASH_DUKR) */
    struct {
      _BITS   DUK    : 8;   ///< Data EEPROM write unlock key
    } DUKR;


    /** @brief Flash status register (FLASH_IAPSR) */
    struct {
      _BITS   WR_PG_DIS : 1;  ///< Write attempted to protected page flag
      _BITS   PUL       : 1;  ///< Flash Program memory unlocked flag
      _BITS   EOP       : 1;  ///< End of programming (write or erase operation) flag
      _BITS   DUL       : 1;  ///< Data EEPROM area unlocked flag
      _BITS             : 4;  //   Reserved, forced by hardware to 0
    } IAPSR;

  } FLASH_t;

  /* Pointer to flash registers */
  #define _FLASH        _SFR(FLASH_t,  FLASH_AddressBase)        ///< Flash struct/bit access
  #define _FLASH_CR1    _SFR(uint8_t,  FLASH_AddressBase+0x00)   ///< Flash control register 1 (FLASH_CR1)
  #define _FLASH_CR2    _SFR(uint8_t,  FLASH_AddressBase+0x01)   ///< Flash control register 2 (FLASH_CR2)
  #define _FLASH_PUKR   _SFR(uint8_t,  FLASH_AddressBase+0x02)   ///< Flash program memory unprotecting key register (FLASH_PUKR)
  #define _FLASH_DUKR   _SFR(uint8_t,  FLASH_AddressBase+0x03)   ///< Data EEPROM unprotection key register (FLASH_DUKR)
  #define _FLASH_IAPSR  _SFR(uint8_t,  FLASH_AddressBase+0x04)   ///< Flash status register (FLASH_IAPSR)

  /* FLASH Module Reset Values */
  #define _FLASH_CR1_RESET_VALUE       ((uint8_t) 0x00)          ///< Flash control register 1 reset value
  #define _FLASH_CR2_RESET_VALUE       ((uint8_t) 0x00)          ///< Flash control register 2 reset value
  #define _FLASH_PUKR_RESET_VALUE      ((uint8_t) 0x00)          ///< Flash program memory unprotecting key reset value
  #define _FLASH_DUKR_RESET_VALUE      ((uint8_t) 0x00)          ///< Data EEPROM unprotection key reset value
  #define _FLASH_IAPSR_RESET_VALUE     ((uint8_t) 0x40)          ///< Flash status register reset value

  /* Flash control register 1 (_FLASH_CR1) */
  #define _FLASH_FIX              ((uint8_t) (0x01 << 0))        ///< Fixed Byte programming time [0] (in _FLASH_CR1)
  #define _FLASH_IE               ((uint8_t) (0x01 << 1))        ///< Flash Interrupt enable [0] (in _FLASH_CR1)
  // reserved [7:2]

  /* Flash control register 2 and complement (FLASH_CR2 and FLASH_NCR2) */
  #define _FLASH_PRG              ((uint8_t) (0x01 << 0))        ///< Standard block programming [0] (in _FLASH_CR2 and _FLASH_NCR2)
  // reserved [3:1]
  #define _FLASH_FPRG             ((uint8_t) (0x01 << 4))        ///< Fast block programming [0] (in _FLASH_CR2 and _FLASH_NCR2)
  #define _FLASH_ERASE            ((uint8_t) (0x01 << 5))        ///< Block erasing [0] (in _FLASH_CR2 and _FLASH_NCR2)
  #define _FLASH_WPRG             ((uint8_t) (0x01 << 6))        ///< Word programming [0] (in _FLASH_CR2 and _FLASH_NCR2)
  #define _FLASH_OPT              ((uint8_t) (0x01 << 7))        ///< Write option bytes [0] (in _FLASH_CR2 and _FLASH_NCR2)

  /* Flash status register (FLASH_IAPSR) */
  #define _FLASH_WR_PG_DIS        ((uint8_t) (0x01 << 0))        ///< Write attempted to protected page flag [0] (in _FLASH_IAPSR)
  #define _FLASH_PUL              ((uint8_t) (0x01 << 1))        ///< Flash Program memory unlocked flag [0] (in _FLASH_IAPSR)
  #define _FLASH_EOP              ((uint8_t) (0x01 << 2))        ///< End of programming (write or erase operation) flag [0] (in _FLASH_IAPSR)
  #define _FLASH_DUL              ((uint8_t) (0x01 << 3))        ///< Data EEPROM area unlocked flag [0] (in _FLASH_IAPSR)
  // reserved [7:4]

