STM8-SPL-license/discussion/Header/STM8TL5x.h
#endif // FLASH_AddressBase



//------------------------
// System configuration controller (SYSCFG)
//------------------------
#if defined(SYSCFG_AddressBase)

  /** @brief struct for System configuration control (SYSCFG) */
  typedef struct {

    /** @brief SYSCFG remap control register (SYSCFG_RMPCR) */
    struct {
      _BITS            : 2;    //   Reserved
      _BITS   TIM3_CH1 : 1;    ///< Timer3 channel 1 mapping
      _BITS   TIM3_CH2 : 1;    ///< Timer3 channel 2 mapping
      _BITS            : 4;    //   Reserved
    } RMPCR;

  } SYSCFG_t;

  /* Pointer to SYSCFG registers */
  #define _SYSCFG       _SFR(RMPCR_t,  RMPCR_AddressBase)        ///< System configuration controller struct/bit access
  #define _SYSCFG_RMPCR _SFR(uint8_t,  RMPCR_AddressBase+0x00)   ///< System configuration control register (SYSCFG_RMPCR)

  /* SYSCFG Module Reset Values */
  #define _SYSCFG_RMPCR_RESET_VALUE    ((uint8_t) 0x1F)          ///< System configuration control register reset value

  /* SYSCFG remap control register (SYSCFG_RMPCR) */
  // reserved [1:0]
  #define _SYSCFG_TIM3_CH1        ((uint8_t) (0x01 << 2))        ///< Timer3 channel 1 mapping [0] (in _SYSCFG_RMPCR)
  #define _SYSCFG_TIM3_CH2        ((uint8_t) (0x01 << 3))        ///< Timer3 channel 2 mapping [0] (in _SYSCFG_RMPCR)
  // reserved [7:4]

#endif // SYSCFG_AddressBase



//------------------------
// External interrupt control (EXTI)
//------------------------
#if defined(EXTI_AddressBase)

  /** @brief struct for configuring external port interrupts (EXTI) */
  typedef struct {

    /** @brief External interrupt control register 1 (EXTI_CR1) */
    struct {
      _BITS   P0IS    : 2;    ///< Portx bit 0 external interrupt sensitivity bits
      _BITS   P1IS    : 2;    ///< Portx bit 1 external interrupt sensitivity bits
      _BITS   P2IS    : 2;    ///< Portx bit 2 external interrupt sensitivity bits
      _BITS   P3IS    : 2;    ///< Portx bit 3 external interrupt sensitivity bits
    } CR1;


    /** @brief External interrupt control register 2 (EXTI_CR2) */
    struct {
      _BITS   P4IS    : 2;    ///< Portx bit 4 external interrupt sensitivity bits
      _BITS   P5IS    : 2;    ///< Portx bit 5 external interrupt sensitivity bits
      _BITS   P6IS    : 2;    ///< Portx bit 6 external interrupt sensitivity bits
      _BITS   P7IS    : 2;    ///< Portx bit 7 external interrupt sensitivity bits
    } CR2;


    /** @brief External interrupt control register 3 (EXTI_CR3) */
    struct {
      _BITS   PBIS    : 2;    ///< Port B external interrupt sensitivity bits
      _BITS   PDIS    : 2;    ///< Port D external interrupt sensitivity bits
      _BITS           : 4;    //   Reserved
    } CR3;


    /** @brief External interrupt status register 1 (EXTI_SR1) */
    struct {
      _BITS   P0F     : 1;    ///< Portx bit 0 external interrupt flag
      _BITS   P1F     : 1;    ///< Portx bit 1 external interrupt flag
      _BITS   P2F     : 1;    ///< Portx bit 2 external interrupt flag
      _BITS   P3F     : 1;    ///< Portx bit 3 external interrupt flag
      _BITS   P4F     : 1;    ///< Portx bit 4 external interrupt flag
      _BITS   P5F     : 1;    ///< Portx bit 5 external interrupt flag
      _BITS   P6F     : 1;    ///< Portx bit 6 external interrupt flag
      _BITS   P7F     : 1;    ///< Portx bit 7 external interrupt flag
    } SR1;


    /** @brief External interrupt status register 2 (EXTI_SR2) */
    struct {
      _BITS   PBF     : 1;    ///< Port B external interrupt flag
      _BITS   PDF     : 1;    ///< Port D external interrupt flag
      _BITS           : 6;    //   Reserved
    } SR2;


    /** @brief External interrupt port selector (EXTI_CONF) */
    struct {
      _BITS   PBLIS   : 1;    ///< Port B, pins 0..3 external interrupt select
      _BITS   PBHIS   : 1;    ///< Port B, pins 4..7 external interrupt select
      _BITS   PDLIS   : 1;    ///< Port D, pins 0..3 external interrupt select
      _BITS   PDHIS   : 1;    ///< Port D, pins 4..7 external interrupt select
      _BITS           : 4;    //   Reserved
    } CONF;

  } EXTI_t;

  /* Pointer to EXTI registers */
  #define _EXTI         _SFR(EXTI_t,   EXTI_AddressBase)         ///< External interrupt struct/bit access
  #define _EXTI_CR1     _SFR(uint8_t,  EXTI_AddressBase+0x00)    ///< External interrupt control register 1 (EXTI_CR1)
  #define _EXTI_CR2     _SFR(uint8_t,  EXTI_AddressBase+0x01)    ///< External interrupt control register 2 (EXTI_CR2)
  #define _EXTI_CR3     _SFR(uint8_t,  EXTI_AddressBase+0x02)    ///< External interrupt control register 3 (EXTI_CR2)
  #define _EXTI_SR1     _SFR(uint8_t,  EXTI_AddressBase+0x03)    ///< External interrupt status register 1 (EXTI_SR1)
  #define _EXTI_SR2     _SFR(uint8_t,  EXTI_AddressBase+0x04)    ///< External interrupt status register 2 (EXTI_SR2)
  #define _EXTI_CONF    _SFR(uint8_t,  EXTI_AddressBase+0x05)    ///< External interrupt port selector (EXTI_CONF)

  /* EXTI Module Reset Values */
  #define _EXTI_CR1_RESET_VALUE        ((uint8_t) 0x00)          ///< External interrupt control register 1 reset value
  #define _EXTI_CR2_RESET_VALUE        ((uint8_t) 0x00)          ///< External interrupt control register 2 reset value
  #define _EXTI_CR3_RESET_VALUE        ((uint8_t) 0x00)          ///< External interrupt control register 3 reset value
  #define _EXTI_SR1_RESET_VALUE        ((uint8_t) 0x00)          ///< External interrupt status register 1 reset value
  #define _EXTI_SR2_RESET_VALUE        ((uint8_t) 0x00)          ///< External interrupt status register 2 reset value
  #define _EXTI_CONF_RESET_VALUE       ((uint8_t) 0x00)          ///< External interrupt port selector reset value

  /* External interrupt control register 1 (EXTI_CR1) */
  #define _EXTI_P0IS              ((uint8_t) (0x03 << 0))        ///< External interrupt sensitivity for Portx bit 0 [1:0] (in _EXTI_CR1)
  #define _EXTI_P0IS0             ((uint8_t) (0x01 << 0))        ///< External interrupt sensitivity for Portx bit 0 [0] (in _EXTI_CR1)
  #define _EXTI_P0IS1             ((uint8_t) (0x01 << 1))        ///< External interrupt sensitivity for Portx bit 0 [1] (in _EXTI_CR1)
  #define _EXTI_P1IS              ((uint8_t) (0x03 << 0))        ///< External interrupt sensitivity for Portx bit 1 [1:0] (in _EXTI_CR1)
  #define _EXTI_P1IS0             ((uint8_t) (0x01 << 0))        ///< External interrupt sensitivity for Portx bit 1 [0] (in _EXTI_CR1)
  #define _EXTI_P1IS1             ((uint8_t) (0x01 << 1))        ///< External interrupt sensitivity for Portx bit 1 [1] (in _EXTI_CR1)
  #define _EXTI_P2IS              ((uint8_t) (0x03 << 0))        ///< External interrupt sensitivity for Portx bit 2 [1:0] (in _EXTI_CR1)
  #define _EXTI_P2IS0             ((uint8_t) (0x01 << 0))        ///< External interrupt sensitivity for Portx bit 2 [0] (in _EXTI_CR1)
  #define _EXTI_P2IS1             ((uint8_t) (0x01 << 1))        ///< External interrupt sensitivity for Portx bit 2 [1] (in _EXTI_CR1)
  #define _EXTI_P3IS              ((uint8_t) (0x03 << 0))        ///< External interrupt sensitivity for Portx bit 3 [1:0] (in _EXTI_CR1)
  #define _EXTI_P3IS0             ((uint8_t) (0x01 << 0))        ///< External interrupt sensitivity for Portx bit 3 [0] (in _EXTI_CR1)
  #define _EXTI_P3IS1             ((uint8_t) (0x01 << 1))        ///< External interrupt sensitivity for Portx bit 3 [1] (in _EXTI_CR1)

  /* External interrupt control register 2 (EXTI_CR2) */
  #define _EXTI_P4IS              ((uint8_t) (0x03 << 0))        ///< External interrupt sensitivity for Portx bit 4 [1:0] (in _EXTI_CR2)
  #define _EXTI_P4IS0             ((uint8_t) (0x01 << 0))        ///< External interrupt sensitivity for Portx bit 4 [0] (in _EXTI_CR2)
  #define _EXTI_P4IS1             ((uint8_t) (0x01 << 1))        ///< External interrupt sensitivity for Portx bit 4 [1] (in _EXTI_CR2)
  #define _EXTI_P5IS              ((uint8_t) (0x03 << 0))        ///< External interrupt sensitivity for Portx bit 5 [1:0] (in _EXTI_CR2)
  #define _EXTI_P5IS0             ((uint8_t) (0x01 << 0))        ///< External interrupt sensitivity for Portx bit 5 [0] (in _EXTI_CR2)
  #define _EXTI_P5IS1             ((uint8_t) (0x01 << 1))        ///< External interrupt sensitivity for Portx bit 5 [1] (in _EXTI_CR2)
  #define _EXTI_P6IS              ((uint8_t) (0x03 << 0))        ///< External interrupt sensitivity for Portx bit 6 [1:0] (in _EXTI_CR2)
  #define _EXTI_P6IS0             ((uint8_t) (0x01 << 0))        ///< External interrupt sensitivity for Portx bit 6 [0] (in _EXTI_CR2)
  #define _EXTI_P6IS1             ((uint8_t) (0x01 << 1))        ///< External interrupt sensitivity for Portx bit 6 [1] (in _EXTI_CR2)
  #define _EXTI_P7IS              ((uint8_t) (0x03 << 0))        ///< External interrupt sensitivity for Portx bit 7 [1:0] (in _EXTI_CR2)
  #define _EXTI_P7IS0             ((uint8_t) (0x01 << 0))        ///< External interrupt sensitivity for Portx bit 7 [0] (in _EXTI_CR2)
  #define _EXTI_P7IS1             ((uint8_t) (0x01 << 1))        ///< External interrupt sensitivity for Portx bit 7 [1] (in _EXTI_CR2)

  /* External interrupt control register 3 (EXTI_CR3) */
  #define _EXTI_PBIS              ((uint8_t) (0x03 << 0))        ///< Port B external interrupt sensitivity bits [1:0] (in _EXTI_CR3)
  #define _EXTI_PBIS0             ((uint8_t) (0x01 << 0))        ///< Port B external interrupt sensitivity bits [0] (in _EXTI_CR3)
  #define _EXTI_PBIS1             ((uint8_t) (0x01 << 1))        ///< Port B external interrupt sensitivity bits [1] (in _EXTI_CR3)
  #define _EXTI_PDIS              ((uint8_t) (0x03 << 0))        ///< Port D external interrupt sensitivity bits [1:0] (in _EXTI_CR3)
  #define _EXTI_PDIS0             ((uint8_t) (0x01 << 0))        ///< Port D external interrupt sensitivity bits [0] (in _EXTI_CR3)
  #define _EXTI_PDIS1             ((uint8_t) (0x01 << 1))        ///< Port D external interrupt sensitivity bits [1] (in _EXTI_CR3)
  // reserved [7:4]

  /* External interrupt status register 1 (EXTI_SR1) */
  #define _EXTI_P0F               ((uint8_t) (0x01 << 0))        ///< Portx bit 0 external interrupt flag (in _EXTI_SR1)
  #define _EXTI_P1F               ((uint8_t) (0x02 << 0))        ///< Portx bit 1 external interrupt flag (in _EXTI_SR1)
  #define _EXTI_P2F               ((uint8_t) (0x04 << 0))        ///< Portx bit 2 external interrupt flag (in _EXTI_SR1)
  #define _EXTI_P3F               ((uint8_t) (0x08 << 0))        ///< Portx bit 3 external interrupt flag (in _EXTI_SR1)
  #define _EXTI_P4F               ((uint8_t) (0x10 << 0))        ///< Portx bit 4 external interrupt flag (in _EXTI_SR1)
  #define _EXTI_P5F               ((uint8_t) (0x20 << 0))        ///< Portx bit 5 external interrupt flag (in _EXTI_SR1)
  #define _EXTI_P6F               ((uint8_t) (0x40 << 0))        ///< Portx bit 6 external interrupt flag (in _EXTI_SR1)
  #define _EXTI_P7F               ((uint8_t) (0x80 << 0))        ///< Portx bit 7 external interrupt flag (in _EXTI_SR1)

  /* External interrupt status register 2 (EXTI_SR2) */
  #define _EXTI_PBF               ((uint8_t) (0x01 << 0))        ///< Port B external interrupt flag (in _EXTI_SR2)
  #define _EXTI_PDF               ((uint8_t) (0x02 << 0))        ///< Port D external interrupt flag (in _EXTI_SR2)
  // reserved [7:2]

  /* External interrupt port selector (EXTI_CONF) */
  #define _EXTI_PBLIS             ((uint8_t) (0x01 << 0))        ///< Port B, pins 0..3 external interrupt select (in _EXTI_CONF)
  #define _EXTI_PBHIS             ((uint8_t) (0x02 << 0))        ///< Port B, pins 4..7 external interrupt select (in _EXTI_CONF)
  #define _EXTI_PDLIS             ((uint8_t) (0x01 << 0))        ///< Port D, pins 0..3 external interrupt select (in _EXTI_CONF)
  #define _EXTI_PDHIS             ((uint8_t) (0x02 << 0))        ///< Port D, pins 4..7 external interrupt select (in _EXTI_CONF)
  // reserved [7:4]

#endif // EXTI_AddressBase



//------------------------
// Reset status (RST)
//------------------------
#if defined(RST_AddressBase)

  /** @brief struct for determining reset source (RST) */
  typedef struct {

    /** @brief Reset pin configuration register (RST_CR) */
    struct {
      _BITS   PIN_KEY : 8;    ///< Reset pin configuration key
    } CR;

