STM8-SPL-license/discussion/Header/STM8TL5x.h
    /** @brief Reset status register (RST_SR) */
    struct {
      _BITS   PORF    : 1;    ///< Power-on reset (POR) flag
      _BITS   IWDGF   : 1;    ///< Independent Watchdog reset flag
      _BITS   ILLOPF  : 1;    ///< Illegal opcode reset flag
      _BITS   SWIMF   : 1;    ///< SWIM reset flag
      _BITS   WWDGF   : 1;    ///< Window Watchdog reset flag
      _BITS           : 3;    //   Reserved
    } SR;

  } RST_t;

  /* Pointer to reset status register */
  #define _RST     _SFR(RST_t,         RST_AddressBase)          ///< Reset module struct/bit access
  #define _RST_CR  _SFR(uint8_t,       RST_AddressBase+0x00)     ///< Reset pin configuration register (RST_CR)
  #define _RST_SR  _SFR(uint8_t,       RST_AddressBase+0x01)     ///< Reset module status register (RST_SR)

  /*  Reset pin configuration register (RST_CR) */
  #define _RST_PIN_KEY            ((uint8_t) 0xD0)               ///< Configure PA1 as GPIO, else NRST (in _RST_CR)

  /*  Reset module status register (RST_SR) */
  #define _RST_PORF               ((uint8_t) (0x01 << 0))        ///< Power-on reset (POR) flag [0] (in _RST_SR)
  #define _RST_IWDGF              ((uint8_t) (0x01 << 1))        ///< Independent Watchdog reset flag [0] (in _RST_SR)
  #define _RST_ILLOPF             ((uint8_t) (0x01 << 2))        ///< Illegal opcode reset flag [0] (in _RST_SR)
  #define _RST_SWIMF              ((uint8_t) (0x01 << 3))        ///< SWIM reset flag [0] (in _RST_SR)
  #define _RST_WWDGF              ((uint8_t) (0x01 << 4))        ///< Window Watchdog reset flag [0] (in _RST_SR)
  // reserved [7:5]

#endif // RST_AddressBase



//------------------------
// Clock control (CLK)
//------------------------
#if defined(CLK_AddressBase)

  /** @brief struct for configuring/monitoring clock module (CLK) */
  typedef struct {

    /** @brief Internal clock register (CLK_ICKR) */
    struct {
      _BITS   HSIDIV  : 2;    ///< High speed internal clock prescaler
      _BITS           : 6;    //   Reserved
    } CKDIVR;

    /** @brief Reserved register (2B) */
    uint8_t res     [2];

    /** @brief Peripheral clock gating register 1 (CLK_PCKENR1) */
    struct {
      _BITS   PCKEN_TIM2      : 1;    ///< clock enable TIM2
      _BITS   PCKEN_TIM3      : 1;    ///< clock enable TIM3
      _BITS   PCKEN_TIM4      : 1;    ///< clock enable TIM4
      _BITS   PCKEN_I2C       : 1;    ///< clock enable I2C
      _BITS   PCKEN_SPI       : 1;    ///< clock enable SPI
      _BITS   PCKEN_USART     : 1;    ///< clock enable USART
      _BITS   PCKEN_AWU       : 1;    ///< clock enable AWU
      _BITS   PCKEN_PXS       : 1;    ///< clock enable PXS
    } PCKENR1;

    /** @brief Peripheral clock gating register 2 (CLK_PCKENR2) */
    struct {
      _BITS   PCKEN_WWDG      : 1;    ///< clock enable WWDG
      _BITS                   : 7;    //   Reserved
    } PCKENR2;

    /** @brief Configurable clock output register (CLK_CCOR) */
    struct {
      _BITS   CCOEN   : 1;    ///< Configurable clock output enable
      _BITS   CCOSEL  : 3;    ///< Configurable clock output selection
      _BITS   CCOSLP  : 2;    ///< Configurable clock output buffer slope
      _BITS           : 2;    //   Reserved
    } CCOR;

  } CLK_t;

  /* Pointer to CLK registers */
  #define _CLK          _SFR(CLK_t,    CLK_AddressBase)          ///< Clock module struct/bit access
  #define _CLK_CKDIVR   _SFR(uint8_t,  CLK_AddressBase+0x00)     ///< Clock Divider Register
  // reserved (2B)
  #define _CLK_PCKENR1  _SFR(uint8_t,  CLK_AddressBase+0x03)     ///< Peripheral clock gating register 1
  #define _CLK_PCKENR2  _SFR(uint8_t,  CLK_AddressBase+0x04)     ///< Peripheral clock gating register 2
  #define _CLK_CCOR     _SFR(uint8_t,  CLK_AddressBase+0x05)     ///< Configurable clock output register

  /* CLK Module Reset Values */
  #define _CLK_CKDIVR_RESET_VALUE      ((uint8_t) 0x03)          ///< Clock divider register reset value
  #define _CLK_PCKENR1_RESET_VALUE     ((uint8_t) 0x00)          ///< Peripheral clock gating register 1 reset value
  #define _CLK_PCKENR2_RESET_VALUE     ((uint8_t) 0x01)          ///< Peripheral clock gating register 2 reset value
  #define _CLK_CCOR_RESET_VALUE        ((uint8_t) 0x10)          ///< Configurable clock output register reset value

  /* Clock divider register (CLK_CKDIVR) */
  #define _CLK_HSIDIV             ((uint8_t) (0x03 << 0))        ///< High speed internal clock prescaler [1:0] (in _CLK_CKDIVR)
  #define _CLK_HSIDIV0            ((uint8_t) (0x01 << 0))        ///< High speed internal clock prescaler [0] (in _CLK_CKDIVR)
  #define _CLK_HSIDIV1            ((uint8_t) (0x01 << 1))        ///< High speed internal clock prescaler [1] (in _CLK_CKDIVR)

  /* pre-defined constants for _CLK_CKDIVR */
  #define _CLK_HSIDIV_DIV1        ((uint8_t) (0x00 << 0))        ///< set HSI prescaler to 1 (in _CLK_CKDIVR)
  #define _CLK_HSIDIV_DIV2        ((uint8_t) (0x01 << 0))        ///< set HSI prescaler to 1/2 (in _CLK_CKDIVR)
  #define _CLK_HSIDIV_DIV4        ((uint8_t) (0x02 << 0))        ///< set HSI prescaler to 1/4 (in _CLK_CKDIVR)
  #define _CLK_HSIDIV_DIV8        ((uint8_t) (0x03 << 0))        ///< set HSI prescaler to 1/8 (in _CLK_CKDIVR)

  /* Peripheral clock gating register 1 (CLK_PCKENR1) */
  #define _CLK_TIM2               ((uint8_t) (0x01 << 0))        ///< clock enable TIM2 [0] (in _CLK_PCKENR1)
  #define _CLK_TIM3               ((uint8_t) (0x01 << 1))        ///< clock enable TIM3 [0] (in _CLK_PCKENR1)
  #define _CLK_TIM4               ((uint8_t) (0x01 << 2))        ///< clock enable TIM4 [0] (in _CLK_PCKENR1)
  #define _CLK_I2C                ((uint8_t) (0x01 << 3))        ///< clock enable I2C [0] (in _CLK_PCKENR1)
  #define _CLK_SPI                ((uint8_t) (0x01 << 4))        ///< clock enable SPI [0] (in _CLK_PCKENR1)
  #define _CLK_USART              ((uint8_t) (0x01 << 5))        ///< clock enable USART [0] (in _CLK_PCKENR1)
  #define _CLK_AWU                ((uint8_t) (0x01 << 6))        ///< clock enable AWU [0] (in _CLK_PCKENR1)
  #define _CLK_PXS                ((uint8_t) (0x01 << 7))        ///< clock enable PXS [0] (in _CLK_PCKENR1)

