STM8-SPL-license/discussion/Header/STM8TL5x.h
  /* Peripheral clock gating register 2 (CLK_PCKENR2) */
  #define _CLK_WWDG               ((uint8_t) (0x01 << 0))        ///< clock enable WWDG [0] (in _CLK_PCKENR2)
  // reserved [7:1]

  /* Configurable clock output register (CLK_CCOR) */
  #define _CLK_CCOEN              ((uint8_t) (0x01 << 0))        ///< Configurable clock output enable [0] (in _CLK_CCOR)
  #define _CLK_CCOSEL             ((uint8_t) (0x07 << 1))        ///< Configurable clock output selection [2:0] (in _CLK_CCOR)
  #define _CLK_CCOSEL0            ((uint8_t) (0x01 << 1))        ///< Configurable clock output selection [0] (in _CLK_CCOR)
  #define _CLK_CCOSEL1            ((uint8_t) (0x01 << 2))        ///< Configurable clock output selection [1] (in _CLK_CCOR)
  #define _CLK_CCOSEL2            ((uint8_t) (0x01 << 3))        ///< Configurable clock output selection [2] (in _CLK_CCOR)
  #define _CLK_CCOSLP             ((uint8_t) (0x03 << 4))        ///< Configurable clock output buffer slope [1:0] (in _CLK_CCOR)
  #define _CLK_CCOSLP0            ((uint8_t) (0x01 << 4))        ///< Configurable clock output buffer slope  [0] (in _CLK_CCOR)
  #define _CLK_CCOSLP1            ((uint8_t) (0x01 << 5))        ///< Configurable clock output buffer slope  [1] (in _CLK_CCOR)
  // reserved [7:6]

#endif // CLK_AddressBase



//------------------------
// Window Watchdog (WWDG)
//------------------------
#if defined(WWDG_AddressBase)

  /** @brief struct for access to Window Watchdog registers (WWDG) */
  typedef struct {

    /** @brief WWDG Control register (WWDG_CR) */
    struct {
      _BITS   T       : 7;    ///< 7-bit WWDG counter
      _BITS   WDGA    : 1;    ///< WWDG activation bit (n/a if WWDG enabled by option byte)
    } CR;


    /** @brief WWDR Window register (WWDG_WR) */
    struct {
      _BITS   W       : 7;    ///< 7-bit window value
      _BITS           : 1;    //   Reserved
    } WR;

  } WWDG_t;

  /* Pointer to Window Watchdog registers */
  #define _WWDG         _SFR(WWDG_t,   WWDG_AddressBase)         ///< Window Watchdog struct/bit access
  #define _WWDG_CR      _SFR(uint8_t,  WWDG_AddressBase+0x00)    ///< Window Watchdog Control register (WWDG_CR)
  #define _WWDG_WR      _SFR(uint8_t,  WWDG_AddressBase+0x01)    ///< Window Watchdog Window register (WWDG_WR)

  /* WWDG Module Reset Values */
  #define _WWDG_CR_RESET_VALUE         ((uint8_t) 0x7F)          ///< Window Watchdog Control register reset value
  #define _WWDG_WR_RESET_VALUE         ((uint8_t) 0x7F)          ///< Window Watchdog Window register reset value

  /* WWDG Control register (WWDG_CR) */
  #define _WWDG_T                 ((uint8_t) (0x7F << 0))        ///< Window Watchdog 7-bit counter [6:0] (in _WWDG_CR)
  #define _WWDG_T0                ((uint8_t) (0x01 << 0))        ///< Window Watchdog 7-bit counter [0] (in _WWDG_CR)
  #define _WWDG_T1                ((uint8_t) (0x01 << 1))        ///< Window Watchdog 7-bit counter [1] (in _WWDG_CR)
  #define _WWDG_T2                ((uint8_t) (0x01 << 2))        ///< Window Watchdog 7-bit counter [2] (in _WWDG_CR)
  #define _WWDG_T3                ((uint8_t) (0x01 << 3))        ///< Window Watchdog 7-bit counter [3] (in _WWDG_CR)
  #define _WWDG_T4                ((uint8_t) (0x01 << 4))        ///< Window Watchdog 7-bit counter [4] (in _WWDG_CR)
  #define _WWDG_T5                ((uint8_t) (0x01 << 5))        ///< Window Watchdog 7-bit counter [5] (in _WWDG_CR)
  #define _WWDG_T6                ((uint8_t) (0x01 << 6))        ///< Window Watchdog 7-bit counter [6] (in _WWDG_CR)
  #define _WWDG_WDGA              ((uint8_t) (0x01 << 7))        ///< Window Watchdog activation bit (n/a if WWDG enabled by option byte) [0] (in _WWDG_CR)

  /* WWDR Window register (WWDG_WR) */
  #define _WWDG_W                 ((uint8_t) (0x7F << 0))        ///< Window Watchdog 7-bit window value [6:0] (in _WWDG_WR)
  #define _WWDG_W0                ((uint8_t) (0x01 << 0))        ///< Window Watchdog 7-bit window value [0] (in _WWDG_WR)
  #define _WWDG_W1                ((uint8_t) (0x01 << 1))        ///< Window Watchdog 7-bit window value [1] (in _WWDG_WR)
  #define _WWDG_W2                ((uint8_t) (0x01 << 2))        ///< Window Watchdog 7-bit window value [2] (in _WWDG_WR)
  #define _WWDG_W3                ((uint8_t) (0x01 << 3))        ///< Window Watchdog 7-bit window value [3] (in _WWDG_WR)
  #define _WWDG_W4                ((uint8_t) (0x01 << 4))        ///< Window Watchdog 7-bit window value [4] (in _WWDG_WR)
  #define _WWDG_W5                ((uint8_t) (0x01 << 5))        ///< Window Watchdog 7-bit window value [5] (in _WWDG_WR)
  #define _WWDG_W6                ((uint8_t) (0x01 << 6))        ///< Window Watchdog 7-bit window value [6] (in _WWDG_WR)
  // reserved [7]

#endif // WWDG_AddressBase



//------------------------
// Independent Timeout Watchdog (IWDG)
//------------------------
#if defined(IWDG_AddressBase)

  /** @brief struct for access to Independent Timeout Watchdog registers (IWDG) */
  typedef struct {

    /** @brief IWDG Key register (IWDG_KR) */
    struct {
      _BITS KEY       : 8;  ///< IWDG Key
    } KR;


    /** @brief IWDG Prescaler register (IWDG_PR) */
    struct {
      _BITS   PRE     : 3;  ///< Prescaler divider
      _BITS           : 5;  //   Reserved
    } PR;


    /** @brief IWDG Reload register (IWDG_RLR) */
    struct {
      _BITS RL        : 8;  ///< IWDG Reload value
    } RLR;

  } IWDG_t;

  /* Pointer to Independent Timeout Watchdog registers */
  #define _IWDG         _SFR(IWDG_t,   IWDG_AddressBase)         ///< Independent Timeout Watchdog struct/bit access
  #define _IWDG_KR      _SFR(uint8_t,  IWDG_AddressBase+0x00)    ///< Independent Timeout Watchdog Key register (IWDG_KR)
  #define _IWDG_PR      _SFR(uint8_t,  IWDG_AddressBase+0x01)    ///< Independent Timeout Watchdog Prescaler register (IWDG_PR)
  #define _IWDG_RLR     _SFR(uint8_t,  IWDG_AddressBase+0x02)    ///< Independent Timeout Watchdog Reload register (IWDG_RLR)

  /* IWDG Module Reset Values */
  #define _IWDG_PR_RESET_VALUE         ((uint8_t) 0x00)          ///< Independent Timeout Watchdog Prescaler register reset value
  #define _IWDG_RLR_RESET_VALUE        ((uint8_t) 0xFF)          ///< Independent Timeout Watchdog Reload register reset value

  /* pre-defined Key constants for _IWDG_KR keys */
  #define _IWDG_KEY_ENABLE        ((uint8_t) 0xCC)               ///< Independent Timeout Watchdog enable (in _IWDG_KR)
  #define _IWDG_KEY_REFRESH       ((uint8_t) 0xAA)               ///< Independent Timeout Watchdog refresh (in _IWDG_KR)
  #define _IWDG_KEY_ACCESS        ((uint8_t) 0x55)               ///< Independent Timeout Watchdog unlock write to IWDG_PR and IWDG_RLR (in _IWDG_KR)

  /* IWDG Prescaler register (IWDG_PR) bits */
  #define _IWDG_PRE               ((uint8_t) (0x07 << 0))        ///< Independent Timeout Watchdog Prescaler divider [2:0] (in _IWDG_PR)
  #define _IWDG_PRE0              ((uint8_t) (0x01 << 0))        ///< Independent Timeout Watchdog Prescaler divider [0] (in _IWDG_PR)
  #define _IWDG_PRE1              ((uint8_t) (0x01 << 1))        ///< Independent Timeout Watchdog Prescaler divider [1] (in _IWDG_PR)
  #define _IWDG_PRE2              ((uint8_t) (0x01 << 2))        ///< Independent Timeout Watchdog Prescaler divider [2] (in _IWDG_PR)
  // reserved [7:3]

