STM8-SPL-license/discussion/Header/STM8TL5x.h
#endif // IWDG_AddressBase



//------------------------
// Auto Wake-Up Module (AWU)
//------------------------
#if defined(AWU_AddressBase)

  /** @brief struct for cofiguring the Auto Wake-Up Module (AWU) */
  typedef struct {

    /** @brief AWU Control/status register (AWU_CSR) */
    struct {
      _BITS   MSR     : 1;    ///< LSI measurement enable
      _BITS           : 3;    //   Reserved
      _BITS   AWUEN   : 1;    ///< Auto-wakeup enable
      _BITS   AWUF    : 1;    ///< Auto-wakeup flag
      _BITS           : 2;    //   Reserved
    } CSR;


    /** @brief AWU Asynchronous prescaler register (AWU_APR) */
    struct {
      _BITS   APRE    : 6;    ///< Asynchronous prescaler divider
      _BITS           : 2;    //   Reserved
    } APR;


    /** @brief AWU Timebase selection register (AWU_TBR) */
    struct {
      _BITS   AWUTB   : 4;    ///< Auto-wakeup timebase selection
      _BITS           : 4;    //   Reserved
    } TBR;

  } AWU_t;

  /* Pointer to AWU registers */
  #define _AWU          _SFR(AWU_t,    AWU_AddressBase)          ///< Auto Wake-Up struct/bit access
  #define _AWU_CSR      _SFR(uint8_t,  AWU_AddressBase+0x00)     ///< Auto Wake-Up Control/status register (AWU_CSR)
  #define _AWU_APR      _SFR(uint8_t,  AWU_AddressBase+0x01)     ///< Auto Wake-Up Asynchronous prescaler register (AWU_APR)
  #define _AWU_TBR      _SFR(uint8_t,  AWU_AddressBase+0x02)     ///< Auto Wake-Up Timebase selection register (AWU_TBR)

  /* AWU Module Reset Values */
  #define _AWU_CSR_RESET_VALUE         ((uint8_t) 0x00)          ///< Auto Wake-Up Control/status register reset value
  #define _AWU_APR_RESET_VALUE         ((uint8_t) 0x3F)          ///< Auto Wake-Up Asynchronous prescaler register reset value
  #define _AWU_TBR_RESET_VALUE         ((uint8_t) 0x00)          ///< Auto Wake-Up Timebase selection register reset value

  /* AWU Control/status register (AWU_CSR) */
  #define _AWU_MSR                ((uint8_t) (0x01 << 0))        ///< Auto Wake-Up LSI measurement enable [0] (in _AWU_CSR)
  // reserved [3:1]
  #define _AWU_AWUEN              ((uint8_t) (0x01 << 4))        ///< Auto-wakeup enable [0] (in _AWU_CSR)
  #define _AWU_AWUF               ((uint8_t) (0x01 << 5))        ///< Auto-wakeup status flag [0] (in _AWU_CSR)
  // reserved [7:6]

  /* AWU Asynchronous prescaler register (AWU_APR) */
  #define _AWU_APRE               ((uint8_t) (0x3F << 0))        ///< Auto-wakeup asynchronous prescaler divider [5:0] (in _AWU_APR)
  #define _AWU_APRE0              ((uint8_t) (0x01 << 0))        ///< Auto-wakeup asynchronous prescaler divider [0] (in _AWU_APR)
  #define _AWU_APRE1              ((uint8_t) (0x01 << 1))        ///< Auto-wakeup asynchronous prescaler divider [1] (in _AWU_APR)
  #define _AWU_APRE2              ((uint8_t) (0x01 << 2))        ///< Auto-wakeup asynchronous prescaler divider [2] (in _AWU_APR)
  #define _AWU_APRE3              ((uint8_t) (0x01 << 3))        ///< Auto-wakeup asynchronous prescaler divider [3] (in _AWU_APR)
  #define _AWU_APRE4              ((uint8_t) (0x01 << 4))        ///< Auto-wakeup asynchronous prescaler divider [4] (in _AWU_APR)
  #define _AWU_APRE5              ((uint8_t) (0x01 << 5))        ///< Auto-wakeup asynchronous prescaler divider [5] (in _AWU_APR)
  // reserved [7:6]

  /* AWU Asynchronous prescaler register (AWU_APR) */
  #define _AWU_AWUTB              ((uint8_t) (0x0F << 0))        ///< Auto-wakeup timebase selection [3:0] (in _AWU_APR)
  #define _AWU_AWUTB0             ((uint8_t) (0x01 << 0))        ///< Auto-wakeup timebase selection [0] (in _AWU_APR)
  #define _AWU_AWUTB1             ((uint8_t) (0x01 << 1))        ///< Auto-wakeup timebase selection [1] (in _AWU_APR)
  #define _AWU_AWUTB2             ((uint8_t) (0x01 << 2))        ///< Auto-wakeup timebase selection [2] (in _AWU_APR)
  #define _AWU_AWUTB3             ((uint8_t) (0x01 << 3))        ///< Auto-wakeup timebase selection [3] (in _AWU_APR)
  // reserved [7:4]

#endif // AWU_AddressBase



//------------------------
// Beeper module BEEP (all devices, may require option byte change)
//------------------------
#if defined(BEEP_AddressBase)

  /** @brief struct for beeper control (BEEP) */
  typedef struct {

    /** @brief Beeper control/status register (BEEP_CSR) */
    struct {
      _BITS   BEEPDIV : 5;    ///< Beep clock prescaler divider
      _BITS   BEEPEN  : 1;    ///< Beep enable
      _BITS   BEEPSEL : 2;    ///< Beeper frequency selection
    } CSR;

  } BEEP_t;

  /* Pointer to BEEP registers */
  #define _BEEP         _SFR(BEEP_t,   BEEP_AddressBase)         ///< Beeper struct/bit access
  #define _BEEP_CSR     _SFR(uint8_t,  BEEP_AddressBase+0x00)    ///< Beeper control/status register (BEEP_CSR)

  /* BEEP Module Reset Values */
  #define _BEEP_CSR_RESET_VALUE        ((uint8_t) 0x1F)          ///< Beeper control/status register reset value

  /* Beeper control/status register (BEEP_CSR) */
  #define _BEEP_BEEPDIV           ((uint8_t) (0x1F << 0))        ///< Beeper clock prescaler divider [4:0] (in _BEEP_CSR)
  #define _BEEP_BEEPDIV0          ((uint8_t) (0x01 << 0))        ///< Beeper clock prescaler divider [0] (in _BEEP_CSR)
  #define _BEEP_BEEPDIV1          ((uint8_t) (0x01 << 1))        ///< Beeper clock prescaler divider [1] (in _BEEP_CSR)
  #define _BEEP_BEEPDIV2          ((uint8_t) (0x01 << 2))        ///< Beeper clock prescaler divider [2] (in _BEEP_CSR)
  #define _BEEP_BEEPDIV3          ((uint8_t) (0x01 << 3))        ///< Beeper clock prescaler divider [3] (in _BEEP_CSR)
  #define _BEEP_BEEPDIV4          ((uint8_t) (0x01 << 4))        ///< Beeper clock prescaler divider [4] (in _BEEP_CSR)
  #define _BEEP_BEEPEN            ((uint8_t) (0x01 << 5))        ///< Beeper enable [0] (in _BEEP_CSR)
  #define _BEEP_BEEPSEL           ((uint8_t) (0x03 << 6))        ///< Beeper frequency selection [1:0] (in _BEEP_CSR)
  #define _BEEP_BEEPSEL0          ((uint8_t) (0x01 << 6))        ///< Beeper frequency selection [0] (in _BEEP_CSR)
  #define _BEEP_BEEPSEL1          ((uint8_t) (0x01 << 7))        ///< Beeper frequency selection [1] (in _BEEP_CSR)

#endif // BEEP_AddressBase



//------------------------
// Serial Peripheral Interface SPI
//------------------------
#if defined(SPI_AddressBase)

  /** @brief struct for controlling SPI module (SPI) */
  typedef struct {

    /** @brief SPI control register 1 (SPI_CR1) */
    struct {
      _BITS   CPHA     : 1;    ///< Clock phase
      _BITS   CPOL     : 1;    ///< Clock polarity
      _BITS   MSTR     : 1;    ///< Master/slave selection
      _BITS   BR       : 3;    ///< Baudrate control
      _BITS   SPE      : 1;    ///< SPI enable
      _BITS   LSBFIRST : 1;    ///< Frame format
    } CR1;


    /** @brief SPI control register 2 (SPI_CR2) */
    struct {
      _BITS   SSI     : 1;    ///< Internal slave select
      _BITS   SSM     : 1;    ///< Software slave management
      _BITS   RXONLY  : 1;    ///< Receive only
      _BITS           : 3;    //   Reserved
      _BITS   BDOE    : 1;    ///< Input/Output enable in bidirectional mode
      _BITS   BDM     : 1;    ///< Bidirectional data mode enable
    } CR2;


    /** @brief SPI interrupt control register (SPI_ICR) */
    struct {
      _BITS           : 4;    //   Reserved
      _BITS   WKIE    : 1;    ///< Wakeup interrupt enable
      _BITS   ERRIE   : 1;    ///< Error interrupt enable
      _BITS   RXIE    : 1;    ///< Rx buffer not empty interrupt enable
      _BITS   TXIE    : 1;    ///< Tx buffer empty interrupt enable
    } ICR;


