STM8-SPL-license/discussion/Header/STM8TL5x.h
    /** @brief SPI status register (SPI_SR) */
    struct {
      _BITS   RXNE    : 1;    ///< Receive buffer not empty
      _BITS   TXE     : 1;    ///< Transmit buffer empty
      _BITS           : 1;    //   Reserved
      _BITS   WKUP    : 1;    ///< Wakeup flag
      _BITS           : 1;    //   Reserved
      _BITS   MODF    : 1;    ///< Mode fault
      _BITS   OVR     : 1;    ///< Overrun flag
      _BITS   BSY     : 1;    ///< Busy flag
    } SR;


    /** @brief SPI data register (SPI_DR) */
    struct {
      _BITS   DATA    : 8;    ///< SPI data
    } DR;

  } SPI_t;

  /// register for SPI control
  #define _SPI        _SFR(SPI_t,      SPI_AddressBase)          ///< SPI struct/bit access
  #define _SPI_CR1    _SFR(uint8_t,    SPI_AddressBase+0x00)     ///< SPI control register 1
  #define _SPI_CR2    _SFR(uint8_t,    SPI_AddressBase+0x01)     ///< SPI control register 2
  #define _SPI_ICR    _SFR(uint8_t,    SPI_AddressBase+0x02)     ///< SPI interrupt control register
  #define _SPI_SR     _SFR(uint8_t,    SPI_AddressBase+0x03)     ///< SPI status register
  #define _SPI_DR     _SFR(uint8_t,    SPI_AddressBase+0x04)     ///< SPI data register

  /* SPI Module Reset Values */
  #define _SPI_CR1_RESET_VALUE         ((uint8_t) 0x00)          ///< SPI Control Register 1 reset value
  #define _SPI_CR2_RESET_VALUE         ((uint8_t) 0x00)          ///< SPI Control Register 2 reset value
  #define _SPI_ICR_RESET_VALUE         ((uint8_t) 0x00)          ///< SPI Interrupt Control Register reset value
  #define _SPI_SR_RESET_VALUE          ((uint8_t) 0x02)          ///< SPI Status Register reset value
  #define _SPI_DR_RESET_VALUE          ((uint8_t) 0x00)          ///< SPI Data Register reset value

  /* SPI control register 1 (SPI_CR1) */
  #define _SPI_CPHA             ((uint8_t) (0x01 << 0))          ///< SPI Clock phase [0] (in _SPI_CR1)
  #define _SPI_CPOL             ((uint8_t) (0x01 << 1))          ///< SPI Clock polarity [0] (in _SPI_CR1)
  #define _SPI_MSTR             ((uint8_t) (0x01 << 2))          ///< SPI Master/slave selection [0] (in _SPI_CR1)
  #define _SPI_BR               ((uint8_t) (0x07 << 3))          ///< SPI Baudrate control [2:0] (in _SPI_CR1)
  #define _SPI_BR0              ((uint8_t) (0x01 << 3))          ///< SPI Baudrate control [0] (in _SPI_CR1)
  #define _SPI_BR1              ((uint8_t) (0x01 << 4))          ///< SPI Baudrate control [1] (in _SPI_CR1)
  #define _SPI_BR2              ((uint8_t) (0x01 << 5))          ///< SPI Baudrate control [2] (in _SPI_CR1)
  #define _SPI_SPE              ((uint8_t) (0x01 << 6))          ///< SPI enable [0] (in _SPI_CR1)
  #define _SPI_LSBFIRST         ((uint8_t) (0x01 << 7))          ///< SPI Frame format [0] (in _SPI_CR1)

  /* SPI control register 2 (SPI_CR2) */
  #define _SPI_SSI              ((uint8_t) (0x01 << 0))          ///< SPI Internal slave select [0] (in _SPI_CR2)
  #define _SPI_SSM              ((uint8_t) (0x01 << 1))          ///< SPI Software slave management [0] (in _SPI_CR2)
  #define _SPI_RXONLY           ((uint8_t) (0x01 << 2))          ///< SPI Receive only [0] (in _SPI_CR2)
  // reserved [5:3]
  #define _SPI_BDOE             ((uint8_t) (0x01 << 6))          ///< SPI Input/Output enable in bidirectional mode [0] (in _SPI_CR2)
  #define _SPI_BDM              ((uint8_t) (0x01 << 7))          ///< SPI Bidirectional data mode enable [0] (in _SPI_CR2)

  /* SPI interrupt control register (SPI_ICR) */
  // reserved [3:0]
  #define _SPI_WKIE             ((uint8_t) (0x01 << 4))          ///< SPI Wakeup interrupt enable [0] (in _SPI_ICR)
  #define _SPI_ERRIE            ((uint8_t) (0x01 << 5))          ///< SPI Error interrupt enable [0] (in _SPI_ICR)
  #define _SPI_RXIE             ((uint8_t) (0x01 << 6))          ///< SPI Rx buffer not empty interrupt enable [0] (in _SPI_ICR)
  #define _SPI_TXIE             ((uint8_t) (0x01 << 7))          ///< SPI Tx buffer empty interrupt enable [0] (in _SPI_ICR)

  /* SPI status register (SPI_SR) */
  #define _SPI_RXNE             ((uint8_t) (0x01 << 0))          ///< SPI Receive buffer not empty [0] (in _SPI_SR)
  #define _SPI_TXE              ((uint8_t) (0x01 << 1))          ///< SPI Transmit buffer empty [0] (in _SPI_SR)
  // reserved [2]
  #define _SPI_WKUP             ((uint8_t) (0x01 << 3))          ///< SPI Wakeup flag [0] (in _SPI_SR)
  // reserved [4]
  #define _SPI_MODF             ((uint8_t) (0x01 << 5))          ///< SPI Mode fault [0] (in _SPI_SR)
  #define _SPI_OVR              ((uint8_t) (0x01 << 6))          ///< SPI Overrun flag [0] (in _SPI_SR)
  #define _SPI_BSY              ((uint8_t) (0x01 << 7))          ///< SPI Busy flag [0] (in _SPI_SR)

#endif // SPI_AddressBase



//------------------------
// I2C Bus Interface
//------------------------
#if defined(I2C_AddressBase)

  /** @brief struct for controlling I2C module (I2C) */
  typedef struct {

    /** @brief I2C Control register 1 (I2C_CR1) */
    struct {
      _BITS   PE        : 1;    ///< Peripheral enable
      _BITS             : 5;    //   Reserved
      _BITS   ENGC      : 1;    ///< General call enable
      _BITS   NOSTRETCH : 1;    ///< Clock stretching disable (Slave mode)
    } CR1;


    /** @brief I2C Control register 2 (I2C_CR2) */
    struct {
      _BITS   START     : 1;    ///< Start generation
      _BITS   STOP      : 1;    ///< Stop generation
      _BITS   ACK       : 1;    ///< Acknowledge enable
      _BITS   POS       : 1;    ///< Acknowledge position (for data reception)
      _BITS             : 3;    //   Reserved
      _BITS   SWRST     : 1;    ///< Software reset
    } CR2;


    /** @brief I2C Frequency register (I2C_FREQR) */
    struct {
      _BITS   FREQ      : 6;    ///< Peripheral clock frequency
      _BITS             : 2;    //   Reserved
    } FREQR;


    /** @brief I2C own address register 1 low byte (I2C_OAR1L) */
    struct {
      _BITS   ADD0      : 1;    ///< Interface address [0] (in 10-bit address mode)
      _BITS   ADD       : 7;    ///< Interface address [7:1]
    } OAR1L;


    /** @brief I2C own address register 1 high byte (I2C_OAR1H) */
    struct {
      _BITS             : 1;    //   Reserved
      _BITS   ADD       : 2;    ///< Interface address [9:8] (in 10-bit address mode)
      _BITS             : 3;    //   Reserved
      _BITS   ADDCONF   : 1;    ///< Address mode configuration (must always be written as ‘1’)
      _BITS   ADDMODE   : 1;    ///< 7-/10-bit addressing mode (Slave mode)
    } OAR1H;


    /** @brief I2C own address register 2 (I2C_OAR2) */
    struct {
      _BITS   ENDUAL    : 1;    ///< Dual addressing mode enable
      _BITS   ADD       : 7;    ///< Interface address in Dual addressing mode [7:1]
    } OAR2;


    /** @brief I2C data register (I2C_DR) */
    struct {
      _BITS   DATA    : 8;    ///< I2C data
    } DR;


    /** @brief I2C Status register 1 (I2C_SR1) */
    struct {
      _BITS   SB        : 1;    ///< Start bit (Master mode)
      _BITS   ADDR      : 1;    ///< Address sent (Master mode) / matched (Slave mode)
      _BITS   BTF       : 1;    ///< Byte transfer finished
      _BITS   ADD10     : 1;    ///< 10-bit header sent (Master mode)
      _BITS   STOPF     : 1;    ///< Stop detection (Slave mode)
      _BITS             : 1;    //   Reserved
      _BITS   RXNE      : 1;    ///< Data register not empty (receivers)
      _BITS   TXE       : 1;    ///< Data register empty (transmitters)
    } SR1;


    /** @brief I2C Status register 2 (I2C_SR2) */
    struct {
      _BITS   BERR      : 1;    ///< Bus error
      _BITS   ARLO      : 1;    ///< Arbitration lost (Master mode)
      _BITS   AF        : 1;    ///< Acknowledge failure
      _BITS   OVR       : 1;    ///< Overrun/underrun
      _BITS             : 1;    //   Reserved
      _BITS   WUFH      : 1;    ///< Wakeup from Halt
      _BITS             : 2;    //   Reserved
    } SR2;


