STM8-SPL-license/discussion/Header/STM8TL5x.h
    /** @brief I2C Status register 3 (I2C_SR3) */
    struct {
      _BITS   MSL       : 1;    ///< Master/Slave
      _BITS   BUSY      : 1;    ///< Bus busy
      _BITS   TRA       : 1;    ///< Transmitter/Receiver
      _BITS             : 1;    //   Reserved
      _BITS   GENCALL   : 1;    ///< General call header (Slave mode)
      _BITS             : 2;    //   Reserved
      _BITS   DUALF     : 1;    ///< Dual flag (Slave mode)
    } SR3;


    /** @brief I2C Interrupt register (I2C_ITR) */
    struct {
      _BITS   ITERREN   : 1;    ///< Error interrupt enable
      _BITS   ITEVTEN   : 1;    ///< Event interrupt enable
      _BITS   ITBUFEN   : 1;    ///< Buffer interrupt enable
      _BITS             : 5;    //   Reserved
    } ITR;


    /** @brief I2C Clock control register low byte (I2C_CCRL) */
    struct {
      _BITS   CCR       : 8;    ///< Clock control register (Master mode)
    } CCRL;


    /** @brief I2C Clock control register high byte (I2C_CCRH) */
    struct {
      _BITS   CCR       : 4;    ///< Clock control register in Fast/Standard mode (Master mode)
      _BITS             : 2;    //   Reserved
      _BITS   DUTY      : 1;    ///< Fast mode duty cycle
      _BITS   FS        : 1;    ///< I2C Master mode selection
    } CCRH;


    /** @brief I2C rise time register (I2C_TRISER) */
    struct {
      _BITS   TRISE     : 6;    ///< Maximum rise time in Fast/Standard mode (Master mode)
      _BITS             : 2;    //   Reserved
    } TRISER;

  } I2C_t;

  /// register for SPI control
  #define _I2C        _SFR(I2C_t,      I2C_AddressBase)          ///< I2C struct/bit access
  #define _I2C_CR1    _SFR(uint8_t,    I2C_AddressBase+0x00)     ///< I2C Control register 1
  #define _I2C_CR2    _SFR(uint8_t,    I2C_AddressBase+0x01)     ///< I2C Control register 2
  #define _I2C_FREQR  _SFR(uint8_t,    I2C_AddressBase+0x02)     ///< I2C Frequency register
  #define _I2C_OAR1L  _SFR(uint8_t,    I2C_AddressBase+0x03)     ///< I2C own address register 1 low byte
  #define _I2C_OAR1H  _SFR(uint8_t,    I2C_AddressBase+0x04)     ///< I2C own address register 1 high byte
  #define _I2C_OAR2   _SFR(uint8_t,    I2C_AddressBase+0x05)     ///< I2C own address register 2
  #define _I2C_DR     _SFR(uint8_t,    I2C_AddressBase+0x06)     ///< I2C data register
  #define _I2C_SR1    _SFR(uint8_t,    I2C_AddressBase+0x07)     ///< I2C Status register 1
  #define _I2C_SR2    _SFR(uint8_t,    I2C_AddressBase+0x08)     ///< I2C Status register 2
  #define _I2C_SR3    _SFR(uint8_t,    I2C_AddressBase+0x09)     ///< I2C Status register 3
  #define _I2C_ITR    _SFR(uint8_t,    I2C_AddressBase+0x0A)     ///< I2C Interrupt register
  #define _I2C_CCRL   _SFR(uint8_t,    I2C_AddressBase+0x0B)     ///< I2C Clock control register low byte
  #define _I2C_CCRH   _SFR(uint8_t,    I2C_AddressBase+0x0C)     ///< I2C Clock control register high byte
  #define _I2C_TRISER _SFR(uint8_t,    I2C_AddressBase+0x0D)     ///< I2C rise time register

  /* I2C Module Reset Values */
  #define _I2C_CR1_RESET_VALUE         ((uint8_t) 0x00)          ///< I2C Control register 1 reset value
  #define _I2C_CR2_RESET_VALUE         ((uint8_t) 0x00)          ///< I2C Control register 2 reset value
  #define _I2C_FREQR_RESET_VALUE       ((uint8_t) 0x00)          ///< I2C Frequency register reset value
  #define _I2C_OAR1L_RESET_VALUE       ((uint8_t) 0x00)          ///< I2C own address register 1 low byte reset value
  #define _I2C_OAR1H_RESET_VALUE       ((uint8_t) 0x00)          ///< I2C own address register 1 high byte reset value
  #define _I2C_OAR2_RESET_VALUE        ((uint8_t) 0x00)          ///< I2C own address register 2 reset value
  #define _I2C_DR_RESET_VALUE          ((uint8_t) 0x00)          ///< I2C data register reset value
  #define _I2C_SR1_RESET_VALUE         ((uint8_t) 0x00)          ///< I2C Status register 1 reset value
  #define _I2C_SR2_RESET_VALUE         ((uint8_t) 0x00)          ///< I2C Status register 2 reset value
  #define _I2C_SR3_RESET_VALUE         ((uint8_t) 0x00)          ///< I2C Status register 3 reset value
  #define _I2C_ITR_RESET_VALUE         ((uint8_t) 0x00)          ///< I2C Interrupt register reset value
  #define _I2C_CCRL_RESET_VALUE        ((uint8_t) 0x00)          ///< I2C Clock control register low byte reset value
  #define _I2C_CCRH_RESET_VALUE        ((uint8_t) 0x00)          ///< I2C Clock control register high byte reset value
  #define _I2C_TRISER_RESET_VALUE      ((uint8_t) 0x02)          ///< I2C rise time register reset value

  /* I2C Control register 1 (I2C_CR1) */
  #define _I2C_PE               ((uint8_t) (0x01 << 0))          ///< I2C Peripheral enable [0] (in _I2C_CR1)
  // reserved [5:1]
  #define _I2C_ENGC             ((uint8_t) (0x01 << 6))          ///< I2C General call enable [0] (in _I2C_CR1)
  #define _I2C_NOSTRETCH        ((uint8_t) (0x01 << 7))          ///< I2C Clock stretching disable (Slave mode) [0] (in _I2C_CR1)

  /* I2C Control register 2 (I2C_CR2) */
  #define _I2C_START            ((uint8_t) (0x01 << 0))          ///< I2C Start generation [0] (in _I2C_CR2)
  #define _I2C_STOP             ((uint8_t) (0x01 << 1))          ///< I2C Stop generation [0] (in _I2C_CR2)
  #define _I2C_ACK              ((uint8_t) (0x01 << 2))          ///< I2C Acknowledge enable [0] (in _I2C_CR2)
  #define _I2C_POS              ((uint8_t) (0x01 << 3))          ///< I2C Acknowledge position (for data reception) [0] (in _I2C_CR2)
  // reserved [6:4]
  #define _I2C_SWRST            ((uint8_t) (0x01 << 7))          ///< I2C Software reset [0] (in _I2C_CR2)

  /* I2C Frequency register (I2C_FREQR) */
  #define _I2C_FREQ             ((uint8_t) (0x3F << 0))          ///< I2C Peripheral clock frequency [5:0] (in _I2C_FREQR)
  #define _I2C_FREQ0            ((uint8_t) (0x01 << 0))          ///< I2C Peripheral clock frequency [0] (in _I2C_FREQR)
  #define _I2C_FREQ1            ((uint8_t) (0x01 << 1))          ///< I2C Peripheral clock frequency [1] (in _I2C_FREQR)
  #define _I2C_FREQ2            ((uint8_t) (0x01 << 2))          ///< I2C Peripheral clock frequency [2] (in _I2C_FREQR)
  #define _I2C_FREQ3            ((uint8_t) (0x01 << 3))          ///< I2C Peripheral clock frequency [3] (in _I2C_FREQR)
  #define _I2C_FREQ4            ((uint8_t) (0x01 << 4))          ///< I2C Peripheral clock frequency [4] (in _I2C_FREQR)
  #define _I2C_FREQ5            ((uint8_t) (0x01 << 5))          ///< I2C Peripheral clock frequency [5] (in _I2C_FREQR)
  // reserved [7:6]

