STM8-SPL-license/discussion/Header/STM8TL5x.h
  /* I2C own address register 1 low byte (I2C_OAR1L) */
  #define _I2C_ADD1_0          ((uint8_t) (0x01 << 0))           ///< I2C Interface address 1 [0] (in 10-bit address mode) (in _I2C_OAR1L)
  #define _I2C_ADD1_1          ((uint8_t) (0x01 << 1))           ///< I2C Interface address 1 [1] (in _I2C_OAR1L)
  #define _I2C_ADD1_2          ((uint8_t) (0x01 << 2))           ///< I2C Interface address 1 [2] (in _I2C_OAR1L)
  #define _I2C_ADD1_3          ((uint8_t) (0x01 << 3))           ///< I2C Interface address 1 [3] (in _I2C_OAR1L)
  #define _I2C_ADD1_4          ((uint8_t) (0x01 << 4))           ///< I2C Interface address 1 [4] (in _I2C_OAR1L)
  #define _I2C_ADD1_5          ((uint8_t) (0x01 << 5))           ///< I2C Interface address 1 [5] (in _I2C_OAR1L)
  #define _I2C_ADD1_6          ((uint8_t) (0x01 << 6))           ///< I2C Interface address 1 [6] (in _I2C_OAR1L)
  #define _I2C_ADD1_7          ((uint8_t) (0x01 << 7))           ///< I2C Interface address 1 [7] (in _I2C_OAR1L)

  /* I2C own address register 1 high byte (I2C_OAR1H) */
  // reserved [0]
  #define _I2C_ADD1_8_9        ((uint8_t) (0x03 << 1))           ///< I2C Interface address 1 [9:8] (in 10-bit address mode) (in _I2C_OAR1H)
  #define _I2C_ADD1_8          ((uint8_t) (0x01 << 1))           ///< I2C Interface address 1 [8] (in _I2C_OAR1H)
  #define _I2C_ADD1_9          ((uint8_t) (0x01 << 2))           ///< I2C Interface address 1 [9] (in _I2C_OAR1H)
  // reserved [5:3]
  #define _I2C_ADDCONF         ((uint8_t) (0x01 << 6))           ///< I2C Address mode configuration [0] (in _I2C_OAR1H)
  #define _I2C_ADDMODE         ((uint8_t) (0x01 << 7))           ///< I2C 7-/10-bit addressing mode (Slave mode) [0] (in _I2C_OAR1H)

  /* I2C own address register 2 (I2C_OAR2) */
  #define _I2C_ENDUAL          ((uint8_t) (0x01 << 0))           ///< I2C Dual addressing mode enable (in _I2C_OAR2)
  #define _I2C_ADD2_1          ((uint8_t) (0x01 << 1))           ///< I2C Interface address 2 [1] (in _I2C_OAR2)
  #define _I2C_ADD2_2          ((uint8_t) (0x01 << 2))           ///< I2C Interface address 2 [2] (in _I2C_OAR2)
  #define _I2C_ADD2_3          ((uint8_t) (0x01 << 3))           ///< I2C Interface address 2 [3] (in _I2C_OAR2)
  #define _I2C_ADD2_4          ((uint8_t) (0x01 << 4))           ///< I2C Interface address 2 [4] (in _I2C_OAR2)
  #define _I2C_ADD2_5          ((uint8_t) (0x01 << 5))           ///< I2C Interface address 2 [5] (in _I2C_OAR2)
  #define _I2C_ADD2_6          ((uint8_t) (0x01 << 6))           ///< I2C Interface address 2 [6] (in _I2C_OAR2)
  #define _I2C_ADD2_7          ((uint8_t) (0x01 << 7))           ///< I2C Interface address 2 [7] (in _I2C_OAR2)

  /* I2C Status register 1 (I2C_SR1) */
  #define _I2C_SB              ((uint8_t) (0x01 << 0))           ///< I2C Start bit (Master mode) [0] (in _I2C_SR1)
  #define _I2C_ADDR            ((uint8_t) (0x01 << 1))           ///< I2C Address sent (Master mode) / matched (Slave mode) [0] (in _I2C_SR1)
  #define _I2C_BTF             ((uint8_t) (0x01 << 2))           ///< I2C Byte transfer finished [0] (in _I2C_SR1)
  #define _I2C_ADD10           ((uint8_t) (0x01 << 3))           ///< I2C 10-bit header sent (Master mode) [0] (in _I2C_SR1)
  #define _I2C_STOPF           ((uint8_t) (0x01 << 4))           ///< I2C Stop detection (Slave mode) [0] (in _I2C_SR1)
  // reserved [5]
  #define _I2C_RXNE            ((uint8_t) (0x01 << 6))           ///< I2C Data register not empty (receivers) [0] (in _I2C_SR1)
  #define _I2C_TXE             ((uint8_t) (0x01 << 7))           ///< I2C Data register empty (transmitters) [0] (in _I2C_SR1)

  /* I2C Status register 2 (I2C_SR2) */
  #define _I2C_BERR            ((uint8_t) (0x01 << 0))           ///< I2C Bus error [0] (in _I2C_SR2)
  #define _I2C_ARLO            ((uint8_t) (0x01 << 1))           ///< I2C Arbitration lost (Master mode) [0] (in _I2C_SR2)
  #define _I2C_AF              ((uint8_t) (0x01 << 2))           ///< I2C Acknowledge failure [0] (in _I2C_SR2)
  #define _I2C_OVR             ((uint8_t) (0x01 << 3))           ///< I2C Overrun/underrun [0] (in _I2C_SR2)
  // reserved [4]
  #define _I2C_WUFH            ((uint8_t) (0x01 << 5))           ///< I2C Wakeup from Halt [0] (in _I2C_SR2)
  // reserved [7:6]

  /* I2C Status register 3 (I2C_SR3) */
  #define _I2C_MSL             ((uint8_t) (0x01 << 0))           ///< I2C Master/Slave [0] (in _I2C_SR3)
  #define _I2C_BUSY            ((uint8_t) (0x01 << 1))           ///< I2C Bus busy [0] (in _I2C_SR3)
  #define _I2C_TRA             ((uint8_t) (0x01 << 2))           ///< I2C Transmitter/Receiver [0] (in _I2C_SR3)
  // reserved [3]
  #define _I2C_GENCALL         ((uint8_t) (0x01 << 4))           ///< I2C General call header (Slave mode) [0] (in _I2C_SR3)
  // reserved [6:5]
  #define _I2C_DUALF           ((uint8_t) (0x01 << 7))           ///< Dual flag (Slave mode) [0] (in _I2C_SR3)

  /* I2C Interrupt register (I2C_ITR) */
  #define _I2C_ITERREN         ((uint8_t) (0x01 << 0))           ///< I2C Error interrupt enable [0] (in _I2C_ITR)
  #define _I2C_ITEVTEN         ((uint8_t) (0x01 << 1))           ///< I2C Event interrupt enable [0] (in _I2C_ITR)
  #define _I2C_ITBUFEN         ((uint8_t) (0x01 << 2))           ///< I2C Buffer interrupt enable [0] (in _I2C_ITR)
  // reserved [7:5]

  /* I2C Clock control register high byte (I2C_CCRH) */
  #define _I2C_CCR             ((uint8_t) (0x0F << 0))           ///< I2C Clock control register (Master mode) [3:0] (in _I2C_CCRH)
  #define _I2C_CCR0            ((uint8_t) (0x01 << 0))           ///< I2C Clock control register (Master mode) [0] (in _I2C_CCRH)
  #define _I2C_CCR1            ((uint8_t) (0x01 << 1))           ///< I2C Clock control register (Master mode) [1] (in _I2C_CCRH)
  #define _I2C_CCR2            ((uint8_t) (0x01 << 2))           ///< I2C Clock control register (Master mode) [2] (in _I2C_CCRH)
  #define _I2C_CCR3            ((uint8_t) (0x01 << 3))           ///< I2C Clock control register (Master mode) [3] (in _I2C_CCRH)
  // reserved [5:4]
  #define _I2C_DUTY            ((uint8_t) (0x01 << 6))           ///< I2C Fast mode duty cycle [0] (in _I2C_CCRH)
  #define _I2C_FS              ((uint8_t) (0x01 << 7))           ///< I2C Master mode selection [0] (in _I2C_CCRH)

  /* I2C rise time register (I2C_TRISER) */
  #define _I2C_TRISE           ((uint8_t) (0x3F << 0))           ///< I2C Maximum rise time (Master mode) [5:0] (in _I2C_TRISER)
  #define _I2C_TRISE0          ((uint8_t) (0x01 << 0))           ///< I2C Maximum rise time (Master mode) [0] (in _I2C_TRISER)
  #define _I2C_TRISE1          ((uint8_t) (0x01 << 1))           ///< I2C Maximum rise time (Master mode) [1] (in _I2C_TRISER)
  #define _I2C_TRISE2          ((uint8_t) (0x01 << 2))           ///< I2C Maximum rise time (Master mode) [2] (in _I2C_TRISER)
  #define _I2C_TRISE3          ((uint8_t) (0x01 << 3))           ///< I2C Maximum rise time (Master mode) [3] (in _I2C_TRISER)
  #define _I2C_TRISE4          ((uint8_t) (0x01 << 4))           ///< I2C Maximum rise time (Master mode) [4] (in _I2C_TRISER)
  #define _I2C_TRISE5          ((uint8_t) (0x01 << 5))           ///< I2C Maximum rise time (Master mode) [5] (in _I2C_TRISER)
  // reserved [7:6]

#endif // I2C_AddressBase



//------------------------
// Universal Asynchronous Receiver Transmitter (USART)
//------------------------
#if defined(USART_AddressBase)

  /** @brief struct for controlling Universal Asynchronous Receiver Transmitter (USART) */
  typedef struct {

