STM8-SPL-license/discussion/Header/STM8TL5x.h
    /** @brief USART Status register (USART_SR) */
    struct {
      _BITS   PE      : 1;    ///< Parity error
      _BITS   FE      : 1;    ///< Framing error
      _BITS   NF      : 1;    ///< Noise flag
      _BITS   OR      : 1;    ///< LIN Header Error (LIN Slave mode) / Overrun error
      _BITS   IDLE    : 1;    ///< IDLE line detected
      _BITS   RXNE    : 1;    ///< Read data register not empty
      _BITS   TC      : 1;    ///< Transmission complete
      _BITS   TXE     : 1;    ///< Transmit data register empty
    } SR;


    /** @brief USART data register (USART_DR) */
    struct {
      _BITS   DATA    : 8;    ///< USART data
    } DR;


    /** @brief USART Baud rate register 1 (USART_BRR1) */
    struct {
      _BITS   DIV_4_11 : 8;    ///< UART_DIV bits [11:4]
    } BRR1;


    /** @brief USART Baud rate register 2 (USART_BRR2) */
    struct {
      _BITS   DIV_0_3   : 4;    ///< UART_DIV bits [3:0]
      _BITS   DIV_12_15 : 4;    ///< UART_DIV bits [15:12]
    } BRR2;


    /** @brief USART Control register 1 (USART_CR1) */
    struct {
      _BITS   PIEN    : 1;    ///< Parity interrupt enable
      _BITS   PS      : 1;    ///< Parity selection
      _BITS   PCEN    : 1;    ///< Parity control enable
      _BITS   WAKE    : 1;    ///< Wakeup method
      _BITS   M       : 1;    ///< word length
      _BITS   UARTD   : 1;    ///< UART Disable (for low power consumption)
      _BITS   T8      : 1;    ///< Transmit Data bit 8 (in 9-bit mode)
      _BITS   R8      : 1;    ///< Receive Data bit 8 (in 9-bit mode)
    } CR1;


    /** @brief USART Control register 2 (USART_CR2) */
    struct {
      _BITS   SBK     : 1;    ///< Send break
      _BITS   RWU     : 1;    ///< Receiver wakeup
      _BITS   REN     : 1;    ///< Receiver enable
      _BITS   TEN     : 1;    ///< Transmitter enable
      _BITS   ILIEN   : 1;    ///< IDLE Line interrupt enable
      _BITS   RIEN    : 1;    ///< Receiver interrupt enable
      _BITS   TCIEN   : 1;    ///< Transmission complete interrupt enable
      _BITS   TIEN    : 1;    ///< Transmitter interrupt enable
    } CR2;


    /** @brief USART Control register 3 (USART_CR3) */
    struct {
      _BITS   LBCL    : 1;    ///< Last bit clock pulse
      _BITS   CPHA    : 1;    ///< Clock phase
      _BITS   CPOL    : 1;    ///< Clock polarity
      _BITS   CKEN    : 1;    ///< Clock enable
      _BITS   STOP    : 2;    ///< STOP bits
      _BITS           : 2;    //   Reserved
    } CR3;


    /** @brief USART Control register 4 (USART_CR4) */
    struct {
      _BITS   ADD     : 4;    ///< Address of the UART node
      _BITS           : 4;    //   Reserved
    } CR4;

  } USART_t;

  /* Pointer to USART registers */
  #define _USART      _SFR(USART_t,    USART_AddressBase)        ///< USART struct/bit access
  #define _USART_SR   _SFR(uint8_t,    USART_AddressBase+0x00)   ///< USART Status register
  #define _USART_DR   _SFR(uint8_t,    USART_AddressBase+0x01)   ///< USART data register
  #define _USART_BRR1 _SFR(uint8_t,    USART_AddressBase+0x02)   ///< USART Baud rate register 1
  #define _USART_BRR2 _SFR(uint8_t,    USART_AddressBase+0x03)   ///< USART Baud rate register 2
  #define _USART_CR1  _SFR(uint8_t,    USART_AddressBase+0x04)   ///< USART Control register 1
  #define _USART_CR2  _SFR(uint8_t,    USART_AddressBase+0x05)   ///< USART Control register 2
  #define _USART_CR3  _SFR(uint8_t,    USART_AddressBase+0x06)   ///< USART Control register 3
  #define _USART_CR4  _SFR(uint8_t,    USART_AddressBase+0x07)   ///< USART Control register 4

  /* USART Module Reset Values */
  #define _USART_SR_RESET_VALUE        ((uint8_t) 0xC0)          ///< USART Status register reset value
  #define _USART_BRR1_RESET_VALUE      ((uint8_t) 0x00)          ///< USART Baud rate register 1 reset value
  #define _USART_BRR2_RESET_VALUE      ((uint8_t) 0x00)          ///< USART Baud rate register 2 reset value
  #define _USART_CR1_RESET_VALUE       ((uint8_t) 0x00)          ///< USART Control register 1 reset value
  #define _USART_CR2_RESET_VALUE       ((uint8_t) 0x00)          ///< USART Control register 2 reset value
  #define _USART_CR3_RESET_VALUE       ((uint8_t) 0x00)          ///< USART Control register 3 reset value
  #define _USART_CR4_RESET_VALUE       ((uint8_t) 0x00)          ///< USART Control register 4 reset value

  /* USART Status register (USART_SR) bits */
  #define _USART_PE               ((uint8_t) (0x01 << 0))        ///< USART Parity error [0] (in _USART_SR)
  #define _USART_FE               ((uint8_t) (0x01 << 1))        ///< USART Framing error [0] (in _USART_SR)
  #define _USART_NF               ((uint8_t) (0x01 << 2))        ///< USART Noise flag [0] (in _USART_SR)
  #define _USART_OR_LHE           ((uint8_t) (0x01 << 3))        ///< USART LIN Header Error (LIN Slave mode) / Overrun error [0] (in _USART_SR)
  #define _USART_IDLE             ((uint8_t) (0x01 << 4))        ///< USART IDLE line detected [0] (in _USART_SR)
  #define _USART_RXNE             ((uint8_t) (0x01 << 5))        ///< USART Read data register not empty [0] (in _USART_SR)
  #define _USART_TC               ((uint8_t) (0x01 << 6))        ///< USART Transmission complete [0] (in _USART_SR)
  #define _USART_TXE              ((uint8_t) (0x01 << 7))        ///< USART Transmit data register empty [0] (in _USART_SR)

  /* USART Control register 1 (USART_CR1) bits */
  #define _USART_PIEN             ((uint8_t) (0x01 << 0))        ///< USART Parity interrupt enable [0] (in _USART_CR1)
  #define _USART_PS               ((uint8_t) (0x01 << 1))        ///< USART Parity selection [0] (in _USART_CR1)
  #define _USART_PCEN             ((uint8_t) (0x01 << 2))        ///< USART Parity control enable [0] (in _USART_CR1)
  #define _USART_WAKE             ((uint8_t) (0x01 << 3))        ///< USART Wakeup method [0] (in _USART_CR1)
  #define _USART_M                ((uint8_t) (0x01 << 4))        ///< USART word length [0] (in _USART_CR1)
  #define _USART_UARTD            ((uint8_t) (0x01 << 5))        ///< USART Disable (for low power consumption) [0] (in _USART_CR1)
  #define _USART_T8               ((uint8_t) (0x01 << 6))        ///< USART Transmit Data bit 8 (in 9-bit mode) [0] (in _USART_CR1)
  #define _USART_R8               ((uint8_t) (0x01 << 7))        ///< USART Receive Data bit 8 (in 9-bit mode) [0] (in _USART_CR1)

  /* USART Control register 2 (USART_CR2) bits */
  #define _USART_SBK              ((uint8_t) (0x01 << 0))        ///< USART Send break [0] (in _USART_CR2)
  #define _USART_RWU              ((uint8_t) (0x01 << 1))        ///< USART Receiver wakeup [0] (in _USART_CR2)
  #define _USART_REN              ((uint8_t) (0x01 << 2))        ///< USART Receiver enable [0] (in _USART_CR2)
  #define _USART_TEN              ((uint8_t) (0x01 << 3))        ///< USART Transmitter enable [0] (in _USART_CR2)
  #define _USART_ILIEN            ((uint8_t) (0x01 << 4))        ///< USART IDLE Line interrupt enable [0] (in _USART_CR2)
  #define _USART_RIEN             ((uint8_t) (0x01 << 5))        ///< USART Receiver interrupt enable [0] (in _USART_CR2)
  #define _USART_TCIEN            ((uint8_t) (0x01 << 6))        ///< USART Transmission complete interrupt enable [0] (in _USART_CR2)
  #define _USART_TIEN             ((uint8_t) (0x01 << 7))        ///< USART Transmitter interrupt enable [0] (in _USART_CR2)

  /* USART Control register 3 (USART_CR3) bits */
  #define _USART_LBCL             ((uint8_t) (0x01 << 0))        ///< USART Last bit clock pulse [0] (in _USART_CR3)
  #define _USART_CPHA             ((uint8_t) (0x01 << 1))        ///< USART Clock phase [0] (in _USART_CR3)
  #define _USART_CPOL             ((uint8_t) (0x01 << 2))        ///< USART Clock polarity [0] (in _USART_CR3)
  #define _USART_CKEN             ((uint8_t) (0x01 << 3))        ///< USART Clock enable [0] (in _USART_CR3)
  #define _USART_STOP             ((uint8_t) (0x03 << 4))        ///< USART STOP bits [1:0] (in _USART_CR3)
  #define _USART_STOP0            ((uint8_t) (0x01 << 4))        ///< USART STOP bits [0] (in _USART_CR3)
  #define _USART_STOP1            ((uint8_t) (0x01 << 5))        ///< USART STOP bits [1] (in _USART_CR3)
  // reserved [7:6]

