STM8-SPL-license/discussion/Header/STM8TL5x.h
  /* USART Control register 4 (USART_CR4) bits */
  #define _USART_ADD              ((uint8_t) (0x0F << 0))        ///< USART Address of the UART node [3:0] (in _USART_CR4)
  #define _USART_ADD0             ((uint8_t) (0x01 << 0))        ///< USART Address of the UART node [0] (in _USART_CR4)
  #define _USART_ADD1             ((uint8_t) (0x01 << 1))        ///< USART Address of the UART node [1] (in _USART_CR4)
  #define _USART_ADD2             ((uint8_t) (0x01 << 2))        ///< USART Address of the UART node [2] (in _USART_CR4)
  #define _USART_ADD3             ((uint8_t) (0x01 << 3))        ///< USART Address of the UART node [3] (in _USART_CR4)
  // reserved [7:4]

#endif // USART_AddressBase



//------------------------
// Wait for Event Configuration (WFE)
//------------------------
#if defined(WFE_AddressBase)

  /** @brief struct to configure interrupt sources as external interrupts or wake events (WFE) */
  typedef struct {

    /** @brief WFE control register 1 (WFE_CR1) */
    struct {
      _BITS   TIM2_EV0 : 1;    ///< TIM2 update, trigger or break event
      _BITS   TIM2_EV1 : 1;    ///< TIM2 capture or compare event
      _BITS            : 1;    //   Reserved
      _BITS   PXS_EV   : 1;    ///< Interrupt on proximity sense event
      _BITS   EXTI_EV0 : 1;    ///< Interrupt on pin 0 of all ports event
      _BITS   EXTI_EV1 : 1;    ///< Interrupt on pin 1 of all ports event
      _BITS   EXTI_EV2 : 1;    ///< Interrupt on pin 2 of all ports event
      _BITS   EXTI_EV3 : 1;    ///< Interrupt on pin 3 of all ports event
    } CR1;


    /** @brief WFE control register 2 (WFE_CR2) */
    struct {
      _BITS   EXTI_EV4 : 1;    ///< Interrupt on pin 4 of all ports event
      _BITS   EXTI_EV5 : 1;    ///< Interrupt on pin 5 of all ports event
      _BITS   EXTI_EV6 : 1;    ///< Interrupt on pin 6 of all ports event
      _BITS   EXTI_EV7 : 1;    ///< Interrupt on pin 7 of all ports event
      _BITS   EXTI_EVB : 1;    ///< Interrupt on port B event
      _BITS   EXTI_EVD : 1;    ///< Interrupt on port D event
      _BITS            : 2;    //   Reserved
    } CR2;

  } WFE_t;

  /* Pointer to WFE registers */
  #define _WFE        _SFR(WFE_t,      WFE_AddressBase)          ///< WFE struct/bit access
  #define _WFE_CR1    _SFR(uint8_t,    WFE_AddressBase+0x00)     ///< WFE Control register 1
  #define _WFE_CR2    _SFR(uint8_t,    WFE_AddressBase+0x01)     ///< WFE Control register 2

  /* WFE Module Reset Values */
  #define _WFE_CR1_RESET_VALUE         ((uint8_t) 0x03)          ///< WFE Control register 1 reset value
  #define _WFE_CR2_RESET_VALUE         ((uint8_t) 0x00)          ///< WFE Control register 2 reset value

  /* WFE Control register 1 (WFE_CR1) bits */
  #define _WFE_TIM2_EV0           ((uint8_t) (0x01 << 0))        ///< TIM2 update, trigger or break event [0] (in _WFE_CR1)
  #define _WFE_TIM2_EV1           ((uint8_t) (0x01 << 1))        ///< TIM2 capture or compare event [0] (in _WFE_CR1)
  // reserved [2]
  #define _WFE_PXS_EV             ((uint8_t) (0x01 << 3))        ///< Interrupt on proximity sense event [0] (in _WFE_CR1)
  #define _WFE_EXTI_EV0           ((uint8_t) (0x01 << 4))        ///< Interrupt on pin 0 of all ports event [0] (in _WFE_CR1)
  #define _WFE_EXTI_EV1           ((uint8_t) (0x01 << 5))        ///< Interrupt on pin 1 of all ports event [0] (in _WFE_CR1)
  #define _WFE_EXTI_EV2           ((uint8_t) (0x01 << 6))        ///< Interrupt on pin 2 of all ports event [0] (in _WFE_CR1)
  #define _WFE_EXTI_EV3           ((uint8_t) (0x01 << 7))        ///< Interrupt on pin 3 of all ports event [0] (in _WFE_CR1)

  /* WFE Control register 2 (WFE_CR2) bits */
  #define _WFE_EXTI_EV4           ((uint8_t) (0x01 << 0))        ///< Interrupt on pin 4 of all ports event [0] (in _WFE_CR1)
  #define _WFE_EXTI_EV5           ((uint8_t) (0x01 << 1))        ///< Interrupt on pin 5 of all ports event [0] (in _WFE_CR1)
  #define _WFE_EXTI_EV6           ((uint8_t) (0x01 << 2))        ///< Interrupt on pin 6 of all ports event [0] (in _WFE_CR1)
  #define _WFE_EXTI_EV7           ((uint8_t) (0x01 << 3))        ///< Interrupt on pin 7 of all ports event [0] (in _WFE_CR1)
  #define _WFE_EXTI_EVB           ((uint8_t) (0x01 << 4))        ///< Interrupt on port B event [0] (in _WFE_CR1)
  #define _WFE_EXTI_EVD           ((uint8_t) (0x01 << 5))        ///< Interrupt on port D event [0] (in _WFE_CR1)
  // reserved [7:6]

#endif // WFE_AddressBase



//------------------------
// 16-Bit Timer 2+3 (TIM2, TIM3)
//------------------------
#if defined(TIM2_AddressBase) || defined(TIM3_AddressBase)

  /** @brief struct for controlling 16-Bit Timer 2+3 (TIM2, TIM3) */
  typedef struct {

    /** @brief TIM2/3 Control register 1 (TIM2/3_CR1) */
    struct {
      _BITS   CEN     : 1;    ///< Counter enable
      _BITS   UDIS    : 1;    ///< Update disable
      _BITS   URS     : 1;    ///< Update request source
      _BITS   OPM     : 1;    ///< One-pulse mode
      _BITS   DIR     : 1;    ///< Direction
      _BITS   CMS     : 2;    ///< Center-aligned Mode Selection
      _BITS   ARPE    : 1;    ///< Auto-reload preload enable
    } CR1;


    /** @brief TIM2/3 Control register 2 (TIM2/3_CR2) */
    struct {
      _BITS           : 4;    //   Reserved
      _BITS   MMS     : 3;    ///< Master mode selection
      _BITS           : 1;    //   Reserved
    } CR2;


    /** @brief TIM2/3 Slave mode control register (TIM2/3_SMCR) */
    struct {
      _BITS   SMS     : 3;    ///< Clock/trigger/slave mode selection
      _BITS           : 1;    //   Reserved
      _BITS   TS      : 3;    ///< Trigger selection
      _BITS   MSM     : 1;    ///< Master/slave mode
    } SMCR;


    /** @brief TIM2/3 External trigger register (TIM2/3_ETR) */
    struct {
      _BITS   ETF     : 4;    ///< External trigger filter
      _BITS   ETPS    : 2;    ///< External trigger prescaler
      _BITS   ECE     : 1;    ///< External clock enable
      _BITS   ETP     : 1;    ///< External trigger polarity
    } ETR;


