STM8-SPL-license/discussion/Header/STM8TL5x.h
    /** @brief TIM2/3 Interrupt enable register (TIM2/3_IER) */
    struct {
      _BITS   UIE     : 1;    ///< Update interrupt enable
      _BITS   CC1IE   : 1;    ///< Capture/compare 1 interrupt enable
      _BITS   CC2IE   : 1;    ///< Capture/compare 2 interrupt enable
      _BITS           : 3;    //   Reserved
      _BITS   TIE     : 1;    ///< Trigger interrupt enable
      _BITS   BIE     : 1;    ///< Break interrupt enable
    } IER;


    /** @brief TIM2/3 Status register 1 (TIM2/3_SR1) */
    struct {
      _BITS   UIF     : 1;    ///< Update interrupt flag
      _BITS   CC1IF   : 1;    ///< Capture/compare 1 interrupt flag
      _BITS   CC2IF   : 1;    ///< Capture/compare 2 interrupt flag
      _BITS           : 3;    //   Reserved
      _BITS   TIF     : 1;    ///< Trigger interrupt flag
      _BITS   BIF     : 1;    ///< Break interrupt flag
    } SR1;


    /** @brief TIM2/3 Status register 2 (TIM2/3_SR2) */
    struct {
      _BITS           : 1;    //   Reserved, must be kept cleared
      _BITS   CC1OF   : 1;    ///< Capture/compare 1 overcapture flag
      _BITS   CC2OF   : 1;    ///< Capture/compare 2 overcapture flag
      _BITS           : 5;    //   Reserved
    } SR2;


    /** @brief TIM2/3 Event generation register (TIM2/3_EGR) */
    struct {
      _BITS   UG      : 1;    ///< Update generation
      _BITS   CC1G    : 1;    ///< Capture/compare 1 generation
      _BITS   CC2G    : 1;    ///< Capture/compare 2 generation
      _BITS           : 3;    //   Reserved
      _BITS   TG      : 1;    ///< Trigger generation
      _BITS   BG      : 1;    ///< Break generation
    } EGR;


    /** @brief TIM2/3 Capture/compare mode register 1 (TIM2/3_CCMR1) */
    union {

      /** @brief bitwise access to register (output mode) */
      struct {
        _BITS   CC1S    : 2;    ///< Compare 1 selection
        _BITS   OC1FE   : 1;    ///< Output compare 1 fast enable
        _BITS   OC1PE   : 1;    ///< Output compare 1 preload enable
        _BITS   OC1M    : 3;    ///< Output compare 1 mode
        _BITS           : 1;    //   Reserved
      } OUT;

      /** @brief bitwise access to register (input mode) */
      struct {
        _BITS   CC1S    : 2;    ///< Capture 1 selection
        _BITS   IC1PSC  : 2;    ///< Input capture 1 prescaler
        _BITS   IC1F    : 4;    ///< Input capture 1 filter
      } IN;

    } CCMR1;


    /** @brief TIM2/3 Capture/compare mode register 2 (TIM2/3_CCMR2) */
    union {

      /** @brief bitwise access to register (output mode) */
      struct {
        _BITS   CC2S    : 2;    ///< Compare 2 selection
        _BITS   OC2FE   : 1;    ///< Output compare 2 fast enable
        _BITS   OC2PE   : 1;    ///< Output compare 2 preload enable
        _BITS   OC2M    : 3;    ///< Output compare 2 mode
        _BITS           : 1;    //   Reserved
      } OUT;

      /** @brief bitwise access to register (input mode) */
      struct {
        _BITS   CC2S    : 2;    ///< Capture/compare 2 selection
        _BITS   IC2PSC  : 2;    ///< Input capture 2 prescaler
        _BITS   IC2F    : 4;    ///< Input capture 2 filter
      } IN;

    } CCMR2;


    /** @brief TIM2/3 Capture/compare enable register 1 (TIM2/3_CCER1) */
    struct {
      _BITS   CC1E    : 1;    ///< Capture/compare 1 output enable
      _BITS   CC1P    : 1;    ///< Capture/compare 1 output polarity
      _BITS           : 2;    //   Reserved
      _BITS   CC2E    : 1;    ///< Capture/compare 2 output enable
      _BITS   CC2P    : 1;    ///< Capture/compare 2 output polarity
      _BITS           : 2;    //   Reserved
    } CCER1;


    /** @brief TIM2/3 16-bit counter high byte (TIM2/3_CNTRH) */
    struct {
      _BITS   CNT     : 8;    ///< 16-bit counter [15:8]
    } CNTRH;


    /** @brief TIM2/3 16-bit counter low byte (TIM2/3_CNTRL) */
    struct {
      _BITS   CNT     : 8;    ///< 16-bit counter [7:0]
    } CNTRL;


    /** @brief TIM2/3 16-bit prescaler (TIM2/3_PSCR) */
    struct {
      _BITS   PSC     : 3;    ///< prescaler [2:0]
      _BITS           : 5;    //   Reserved
    } PSCR;


    /** @brief TIM2/3 16-bit auto-reload value high byte (TIM2/3_ARRH) */
    struct {
      _BITS   ARR     : 8;    ///< 16-bit auto-reload value [15:8]
    } ARRH;


    /** @brief TIM2/3 16-bit auto-reload value low byte (TIM2/3_ARRL) */
    struct {
      _BITS   ARR     : 8;    ///< 16-bit auto-reload value [7:0]
    } ARRL;


    /** @brief TIM2/3 16-bit capture/compare value 1 high byte (TIM2/3_CCR1H) */
    struct {
      _BITS   CCR1    : 8;    ///< 16-bit capture/compare value 1 [15:8]
    } CCR1H;


    /** @brief TIM2/3 16-bit capture/compare value 1 low byte (TIM2/3_CCR1L) */
    struct {
      _BITS   CCR1    : 8;    ///< 16-bit capture/compare value 1 [7:0]
    } CCR1L;


    /** @brief TIM2/3 16-bit capture/compare value 2 high byte (TIM2/3_CCR2H) */
    struct {
      _BITS   CCR2    : 8;  ///< 16-bit capture/compare value 2 [15:8]
    } CCR2H;


    /** @brief TIM2/3 16-bit capture/compare value 2 low byte (TIM2/3_CCR2L) */
    struct {
      _BITS   CCR2    : 8;    ///< 16-bit capture/compare value 2 [7:0]
    } CCR2L;


    /** @brief TIM2/3 Break register (TIM2/3_BKR) */
    struct {
      _BITS   LOCK    : 2;    ///< Lock configuration
      _BITS   OSSI    : 1;    ///< Off state selection for idle mode
      _BITS           : 1;    ///< Reserved
      _BITS   BKE     : 1;    ///< Break enable
      _BITS   BKP     : 1;    ///< Break polarity
      _BITS   AOE     : 1;    ///< Automatic output enable
      _BITS   MOE     : 1;    ///< Main output enable
    } BKR;


    /** @brief TIM2/3 Output idle state register (TIM2/3_OISR) */
    struct {
      _BITS   OIS1    : 1;    ///< Output idle state 1 (OC1 output)
      _BITS           : 1;    ///< Reserved
      _BITS   OIS2    : 1;    ///< Output idle state 2 (OC2 output)
      _BITS           : 5;    //   Reserved, forced by hardware to 0
    } OISR;

  } TIM2_3_t;

