STM8-SPL-license/discussion/Header/STM8TL5x.h
  /* Pointer to TIM2 registers */
  #if defined(TIM2_AddressBase)
    #define _TIM2        _SFR(TIM2_3_t,  TIM2_AddressBase)         ///< TIM2 struct/bit access
    #define _TIM2_CR1    _SFR(uint8_t,   TIM2_AddressBase+0x00)    ///< TIM2 control register 1
    #define _TIM2_CR2    _SFR(uint8_t,   TIM2_AddressBase+0x01)    ///< TIM2 control register 2
    #define _TIM2_SMCR   _SFR(uint8_t,   TIM2_AddressBase+0x02)    ///< TIM2 Slave mode control register
    #define _TIM2_ETR    _SFR(uint8_t,   TIM2_AddressBase+0x03)    ///< TIM2 External trigger register
    #define _TIM2_IER    _SFR(uint8_t,   TIM2_AddressBase+0x04)    ///< TIM2 interrupt enable register
    #define _TIM2_SR1    _SFR(uint8_t,   TIM2_AddressBase+0x05)    ///< TIM2 status register 1
    #define _TIM2_SR2    _SFR(uint8_t,   TIM2_AddressBase+0x06)    ///< TIM2 status register 2
    #define _TIM2_EGR    _SFR(uint8_t,   TIM2_AddressBase+0x07)    ///< TIM2 Event generation register
    #define _TIM2_CCMR1  _SFR(uint8_t,   TIM2_AddressBase+0x08)    ///< TIM2 Capture/compare mode register 1
    #define _TIM2_CCMR2  _SFR(uint8_t,   TIM2_AddressBase+0x09)    ///< TIM2 Capture/compare mode register 2
    #define _TIM2_CCER1  _SFR(uint8_t,   TIM2_AddressBase+0x0A)    ///< TIM2 Capture/compare enable register 1
    #define _TIM2_CNTRH  _SFR(uint8_t,   TIM2_AddressBase+0x0B)    ///< TIM2 counter register high byte
    #define _TIM2_CNTRL  _SFR(uint8_t,   TIM2_AddressBase+0x0C)    ///< TIM2 counter register low byte
    #define _TIM2_PSCR   _SFR(uint8_t,   TIM2_AddressBase+0x0D)    ///< TIM2 clock prescaler register
    #define _TIM2_ARRH   _SFR(uint8_t,   TIM2_AddressBase+0x0E)    ///< TIM2 auto-reload register high byte
    #define _TIM2_ARRL   _SFR(uint8_t,   TIM2_AddressBase+0x0F)    ///< TIM2 auto-reload register low byte
    #define _TIM2_CCR1H  _SFR(uint8_t,   TIM2_AddressBase+0x10)    ///< TIM2 16-bit capture/compare value 1 high byte
    #define _TIM2_CCR1L  _SFR(uint8_t,   TIM2_AddressBase+0x11)    ///< TIM2 16-bit capture/compare value 1 low byte
    #define _TIM2_CCR2H  _SFR(uint8_t,   TIM2_AddressBase+0x12)    ///< TIM2 16-bit capture/compare value 2 high byte
    #define _TIM2_CCR2L  _SFR(uint8_t,   TIM2_AddressBase+0x13)    ///< TIM2 16-bit capture/compare value 2 low byte
    #define _TIM2_BKR    _SFR(uint8_t,   TIM2_AddressBase+0x14)    ///< TIM2 Break register
    #define _TIM2_OISR   _SFR(uint8_t,   TIM2_AddressBase+0x15)    ///< TIM2 Output idle state register

    /* TIM2 Module Reset Values */
    #define _TIM2_CR1_RESET_VALUE        ((uint8_t) 0x00)          ///< TIM2 control register 1 reset value
    #define _TIM2_CR2_RESET_VALUE        ((uint8_t) 0x00)          ///< TIM2 control register 2 reset value
    #define _TIM2_SMCR_RESET_VALUE       ((uint8_t) 0x00)          ///< TIM2 Slave mode control register reset value
    #define _TIM2_ETR_RESET_VALUE        ((uint8_t) 0x00)          ///< TIM2 External trigger register reset value
    #define _TIM2_IER_RESET_VALUE        ((uint8_t) 0x00)          ///< TIM2 interrupt enable register reset value
    #define _TIM2_SR1_RESET_VALUE        ((uint8_t) 0x00)          ///< TIM2 status register 1 reset value
    #define _TIM2_SR2_RESET_VALUE        ((uint8_t) 0x00)          ///< TIM2 status register 2 reset value
    #define _TIM2_EGR_RESET_VALUE        ((uint8_t) 0x00)          ///< TIM2 Event generation register reset value
    #define _TIM2_CCMR1_RESET_VALUE      ((uint8_t) 0x00)          ///< TIM2 Capture/compare mode register 1 reset value
    #define _TIM2_CCMR2_RESET_VALUE      ((uint8_t) 0x00)          ///< TIM2 Capture/compare mode register 2 reset value
    #define _TIM2_CCER1_RESET_VALUE      ((uint8_t) 0x00)          ///< TIM2 Capture/compare enable register 1 reset value
    #define _TIM2_CNTRH_RESET_VALUE      ((uint8_t) 0x00)          ///< TIM2 counter register high byte reset value
    #define _TIM2_CNTRL_RESET_VALUE      ((uint8_t) 0x00)          ///< TIM2 counter register low byte reset value
    #define _TIM2_PSCR_RESET_VALUE       ((uint8_t) 0x00)          ///< TIM2 clock prescaler register reset value
    #define _TIM2_ARRH_RESET_VALUE       ((uint8_t) 0xFF)          ///< TIM2 auto-reload register high byte reset value
    #define _TIM2_ARRL_RESET_VALUE       ((uint8_t) 0xFF)          ///< TIM2 auto-reload register low byte reset value
    #define _TIM2_RCR_RESET_VALUE        ((uint8_t) 0x00)          ///< TIM2 Repetition counter reset value
    #define _TIM2_CCR1H_RESET_VALUE      ((uint8_t) 0x00)          ///< TIM2 16-bit capture/compare value 1 high byte reset value
    #define _TIM2_CCR1L_RESET_VALUE      ((uint8_t) 0x00)          ///< TIM2 16-bit capture/compare value 1 low byte reset value
    #define _TIM2_CCR2H_RESET_VALUE      ((uint8_t) 0x00)          ///< TIM2 16-bit capture/compare value 2 high byte reset value
    #define _TIM2_CCR2L_RESET_VALUE      ((uint8_t) 0x00)          ///< TIM2 16-bit capture/compare value 2 low byte reset value
    #define _TIM2_BKR_RESET_VALUE        ((uint8_t) 0x00)          ///< TIM2 Break register reset value
    #define _TIM2_OISR_RESET_VALUE       ((uint8_t) 0x00)          ///< TIM2 Output idle state register reset value

    /* TIM2 Control register (TIM2_CR1) */
    #define _TIM2_CEN               ((uint8_t) (0x01 << 0))        ///< TIM2 Counter enable [0] (in _TIM2_CR1)
    #define _TIM2_UDIS              ((uint8_t) (0x01 << 1))        ///< TIM2 Update disable [0] (in _TIM2_CR1)
    #define _TIM2_URS               ((uint8_t) (0x01 << 2))        ///< TIM2 Update request source [0] (in _TIM2_CR1)
    #define _TIM2_OPM               ((uint8_t) (0x01 << 3))        ///< TIM2 One-pulse mode [0] (in _TIM2_CR1)
    #define _TIM2_DIR               ((uint8_t) (0x01 << 4))        ///< TIM2 Direction [0] (in _TIM2_CR1)
    #define _TIM2_CMS               ((uint8_t) (0x03 << 5))        ///< TIM2 Center-aligned Mode Selection [0:1] (in _TIM2_CR1)
    #define _TIM2_CMS0              ((uint8_t) (0x01 << 5))        ///< TIM2 Center-aligned Mode Selection [0] (in _TIM2_CR1)
    #define _TIM2_CMS1              ((uint8_t) (0x01 << 6))        ///< TIM2 Center-aligned Mode Selection [1] (in _TIM2_CR1)
    #define _TIM2_ARPE              ((uint8_t) (0x01 << 7))        ///< TIM2 Auto-reload preload enable [0] (in _TIM2_CR1)

    /* TIM2 Control register (TIM2_CR2) */
    // reserved [3:0]
    #define _TIM2_MMS               ((uint8_t) (0x07 << 4))        ///< TIM2 Master mode selection [2:0] (in _TIM2_CR2)
    #define _TIM2_MMS0              ((uint8_t) (0x01 << 4))        ///< TIM2 Master mode selection [0] (in _TIM2_CR2)
    #define _TIM2_MMS1              ((uint8_t) (0x01 << 5))        ///< TIM2 Master mode selection [1] (in _TIM2_CR2)
    #define _TIM2_MMS2              ((uint8_t) (0x01 << 6))        ///< TIM2 Master mode selection [2] (in _TIM2_CR2)
    // reserved [7]

