STM8-SPL-license/discussion/Header/STM8TL5x.h
    /* TIM2 Slave mode control register (TIM2_SMCR) */
    #define _TIM2_SMS               ((uint8_t) (0x07 << 0))        ///< TIM2 Clock/trigger/slave mode selection [2:0] (in _TIM2_SMCR)
    #define _TIM2_SMS0              ((uint8_t) (0x01 << 0))        ///< TIM2 Clock/trigger/slave mode selection [0] (in _TIM2_SMCR)
    #define _TIM2_SMS1              ((uint8_t) (0x01 << 1))        ///< TIM2 Clock/trigger/slave mode selection [1] (in _TIM2_SMCR)
    #define _TIM2_SMS2              ((uint8_t) (0x01 << 2))        ///< TIM2 Clock/trigger/slave mode selection [2] (in _TIM2_SMCR)
    // reserved [3]
    #define _TIM2_TS                ((uint8_t) (0x07 << 4))        ///< TIM2 Trigger selection [2:0] (in _TIM2_SMCR)
    #define _TIM2_TS0               ((uint8_t) (0x01 << 4))        ///< TIM2 Trigger selection [0] (in _TIM2_SMCR)
    #define _TIM2_TS1               ((uint8_t) (0x01 << 5))        ///< TIM2 Trigger selection [1] (in _TIM2_SMCR)
    #define _TIM2_TS2               ((uint8_t) (0x01 << 6))        ///< TIM2 Trigger selection [2] (in _TIM2_SMCR)
    #define _TIM2_MSM               ((uint8_t) (0x01 << 7))        ///< TIM2 Master/slave mode [0] (in _TIM2_SMCR)

    /* TIM2 External trigger register (TIM2_ETR) */
    #define _TIM2_ETF               ((uint8_t) (0x0F << 0))        ///< TIM2 External trigger filter [3:0] (in _TIM2_ETR)
    #define _TIM2_ETF0              ((uint8_t) (0x01 << 0))        ///< TIM2 External trigger filter [0] (in _TIM2_ETR)
    #define _TIM2_ETF1              ((uint8_t) (0x01 << 1))        ///< TIM2 External trigger filter [1] (in _TIM2_ETR)
    #define _TIM2_ETF2              ((uint8_t) (0x01 << 2))        ///< TIM2 External trigger filter [2] (in _TIM2_ETR)
    #define _TIM2_ETF3              ((uint8_t) (0x01 << 3))        ///< TIM2 External trigger filter [3] (in _TIM2_ETR)
    #define _TIM2_ETPS              ((uint8_t) (0x03 << 4))        ///< TIM2 External trigger prescaler [1:0] (in _TIM2_ETR)
    #define _TIM2_ETPS0             ((uint8_t) (0x01 << 4))        ///< TIM2 External trigger prescaler [0] (in _TIM2_ETR)
    #define _TIM2_ETPS1             ((uint8_t) (0x01 << 5))        ///< TIM2 External trigger prescaler [1] (in _TIM2_ETR)
    #define _TIM2_ECE               ((uint8_t) (0x01 << 6))        ///< TIM2 External clock enable [0] (in _TIM2_ETR)
    #define _TIM2_ETP               ((uint8_t) (0x01 << 7))        ///< TIM2 External trigger polarity [0] (in _TIM2_ETR)

    /* TIM2 Interrupt enable (TIM2_IER) */
    #define _TIM2_UIE               ((uint8_t) (0x01 << 0))        ///< TIM2 Update interrupt enable [0] (in _TIM2_IER)
    #define _TIM2_CC1IE             ((uint8_t) (0x01 << 1))        ///< TIM2 Capture/compare 1 interrupt enable [0] (in _TIM2_IER)
    #define _TIM2_CC2IE             ((uint8_t) (0x01 << 2))        ///< TIM2 Capture/compare 2 interrupt enable [0] (in _TIM2_IER)
    // reserved [5:3]
    #define _TIM2_TIE               ((uint8_t) (0x01 << 6))        ///< TIM2 Trigger interrupt enable [0] (in _TIM2_IER)
    #define _TIM2_BIE               ((uint8_t) (0x01 << 7))        ///< TIM2 Break interrupt enable [0] (in _TIM2_IER)

    /*  TIM2 Status register 1 (TIM2_SR1) */
    #define _TIM2_UIF               ((uint8_t) (0x01 << 0))        ///< TIM2 Update interrupt flag [0] (in _TIM2_SR1)
    #define _TIM2_CC1IF             ((uint8_t) (0x01 << 1))        ///< TIM2 Capture/compare 1 interrupt flag [0] (in _TIM2_SR1)
    #define _TIM2_CC2IF             ((uint8_t) (0x01 << 2))        ///< TIM2 Capture/compare 2 interrupt flag [0] (in _TIM2_SR1)
    // reserved [5:3]
    #define _TIM2_TIF               ((uint8_t) (0x01 << 6))        ///< TIM2 Trigger interrupt flag [0] (in _TIM2_SR1)
    #define _TIM2_BIF               ((uint8_t) (0x01 << 7))        ///< TIM2 Break interrupt flag [0] (in _TIM2_SR1)

    /*  TIM2 Status register 2 (TIM2_SR2) */
    // reserved [0]
    #define _TIM2_CC1OF             ((uint8_t) (0x01 << 1))        ///< TIM2 Capture/compare 1 overcapture flag [0] (in _TIM2_SR2)
    #define _TIM2_CC2OF             ((uint8_t) (0x01 << 2))        ///< TIM2 Capture/compare 2 overcapture flag [0] (in _TIM2_SR2)
    // reserved [7:3]

    /*  TIM2 Event generation register (TIM2_EGR) */
    #define _TIM2_UG                ((uint8_t) (0x01 << 0))        ///< TIM2 Update generation [0] (in _TIM2_EGR)
    #define _TIM2_CC1G              ((uint8_t) (0x01 << 1))        ///< TIM2 Capture/compare 1 generation [0] (in _TIM2_EGR)
    #define _TIM2_CC2G              ((uint8_t) (0x01 << 2))        ///< TIM2 Capture/compare 2 generation [0] (in _TIM2_EGR)
    // reserved [5:3]
    #define _TIM2_TG                ((uint8_t) (0x01 << 6))        ///< TIM2 Trigger generation [0] (in _TIM2_EGR)
    #define _TIM2_BG                ((uint8_t) (0x01 << 7))        ///< TIM2 Break generation [0] (in _TIM2_EGR)

    /*  TIM2 Capture/compare mode register 1 (TIM2_CCMR1). Output mode */
    #define _TIM2_CC1S              ((uint8_t) (0x03 << 0))        ///< TIM2 Compare 1 selection [1:0] (in _TIM2_CCMR1)
    #define _TIM2_CC1S0             ((uint8_t) (0x01 << 0))        ///< TIM2 Compare 1 selection [0] (in _TIM2_CCMR1)
    #define _TIM2_CC1S1             ((uint8_t) (0x01 << 1))        ///< TIM2 Compare 1 selection [1] (in _TIM2_CCMR1)
    #define _TIM2_OC1FE             ((uint8_t) (0x01 << 2))        ///< TIM2 Output compare 1 fast enable [0] (in _TIM2_CCMR1)
    #define _TIM2_OC1PE             ((uint8_t) (0x01 << 3))        ///< TIM2 Output compare 1 preload enable [0] (in _TIM2_CCMR1)
    #define _TIM2_OC1M              ((uint8_t) (0x07 << 4))        ///< TIM2 Output compare 1 mode [2:0] (in _TIM2_CCMR1)
    #define _TIM2_OC1M0             ((uint8_t) (0x01 << 4))        ///< TIM2 Output compare 1 mode [0] (in _TIM2_CCMR1)
    #define _TIM2_OC1M1             ((uint8_t) (0x01 << 5))        ///< TIM2 Output compare 1 mode [1] (in _TIM2_CCMR1)
    #define _TIM2_OC1M2             ((uint8_t) (0x01 << 6))        ///< TIM2 Output compare 1 mode [2] (in _TIM2_CCMR1)
    // reserved [7]

    /*  TIM2 Capture/compare mode register 1 (TIM2_CCMR1). Input mode */
    // _TIM2_CC1S [1:0] defined above
    #define _TIM2_IC1PSC            ((uint8_t) (0x03 << 2))        ///< TIM2 Input capture 1 prescaler [1:0] (in _TIM2_CCMR1)
    #define _TIM2_IC1PSC0           ((uint8_t) (0x01 << 2))        ///< TIM2 Input capture 1 prescaler [0] (in _TIM2_CCMR1)
    #define _TIM2_IC1PSC1           ((uint8_t) (0x01 << 3))        ///< TIM2 Input capture 1 prescaler [1] (in _TIM2_CCMR1)
    #define _TIM2_IC1F              ((uint8_t) (0x0F << 4))        ///< TIM2 Output compare 1 mode [3:0] (in _TIM2_CCMR1)
    #define _TIM2_IC1F0             ((uint8_t) (0x01 << 4))        ///< TIM2 Input capture 1 filter [0] (in _TIM2_CCMR1)
    #define _TIM2_IC1F1             ((uint8_t) (0x01 << 5))        ///< TIM2 Input capture 1 filter [1] (in _TIM2_CCMR1)
    #define _TIM2_IC1F2             ((uint8_t) (0x01 << 6))        ///< TIM2 Input capture 1 filter [2] (in _TIM2_CCMR1)
    #define _TIM2_IC1F3             ((uint8_t) (0x01 << 7))        ///< TIM2 Input capture 1 filter [3] (in _TIM2_CCMR1)

    /*  TIM2 Capture/compare mode register 2 (TIM2_CCMR2). Output mode */
    #define _TIM2_CC2S              ((uint8_t) (0x03 << 0))        ///< TIM2 Compare 2 selection [1:0] (in _TIM2_CCMR2)
    #define _TIM2_CC2S0             ((uint8_t) (0x01 << 0))        ///< TIM2 Compare 2 selection [0] (in _TIM2_CCMR2)
    #define _TIM2_CC2S1             ((uint8_t) (0x01 << 1))        ///< TIM2 Compare 2 selection [1] (in _TIM2_CCMR2)
    #define _TIM2_OC2FE             ((uint8_t) (0x01 << 2))        ///< TIM2 Output compare 2 fast enable [0] (in _TIM2_CCMR2)
    #define _TIM2_OC2PE             ((uint8_t) (0x01 << 3))        ///< TIM2 Output compare 2 preload enable [0] (in _TIM2_CCMR2)
    #define _TIM2_OC2M              ((uint8_t) (0x07 << 4))        ///< TIM2 Output compare 2 mode [2:0] (in _TIM2_CCMR2)
    #define _TIM2_OC2M0             ((uint8_t) (0x01 << 4))        ///< TIM2 Output compare 2 mode [0] (in _TIM2_CCMR2)
    #define _TIM2_OC2M1             ((uint8_t) (0x01 << 5))        ///< TIM2 Output compare 2 mode [1] (in _TIM2_CCMR2)
    #define _TIM2_OC2M2             ((uint8_t) (0x01 << 6))        ///< TIM2 Output compare 2 mode [2] (in _TIM2_CCMR2)
    // reserved [7]

    /*  TIM2 Capture/compare mode register 2 (TIM2_CCMR2). Input mode */
    // _TIM2_CC2S [1:0] defined above
    #define _TIM2_IC2PSC            ((uint8_t) (0x03 << 2))        ///< TIM2 Input capture 2 prescaler [1:0] (in _TIM2_CCMR2)
    #define _TIM2_IC2PSC0           ((uint8_t) (0x01 << 2))        ///< TIM2 Input capture 2 prescaler [0] (in _TIM2_CCMR2)
    #define _TIM2_IC2PSC1           ((uint8_t) (0x01 << 3))        ///< TIM2 Input capture 2 prescaler [1] (in _TIM2_CCMR2)
    #define _TIM2_IC2F              ((uint8_t) (0x0F << 4))        ///< TIM2 Output compare 2 mode [3:0] (in _TIM2_CCMR2)
    #define _TIM2_IC2F0             ((uint8_t) (0x01 << 4))        ///< TIM2 Input capture 2 filter [0] (in _TIM2_CCMR2)
    #define _TIM2_IC2F1             ((uint8_t) (0x01 << 5))        ///< TIM2 Input capture 2 filter [1] (in _TIM2_CCMR2)
    #define _TIM2_IC2F2             ((uint8_t) (0x01 << 6))        ///< TIM2 Input capture 2 filter [2] (in _TIM2_CCMR2)
    #define _TIM2_IC2F3             ((uint8_t) (0x01 << 7))        ///< TIM2 Input capture 2 filter [3] (in _TIM2_CCMR2)

    /*  TIM2 Capture/compare enable register 1 (TIM2_CCER1) */
    #define _TIM2_CC1E              ((uint8_t) (0x01 << 0))        ///< TIM2 Capture/compare 1 output enable [0] (in _TIM2_CCER1)
    #define _TIM2_CC1P              ((uint8_t) (0x01 << 1))        ///< TIM2 Capture/compare 1 output polarity [0] (in _TIM2_CCER1)
    // reserved [3:4]
    #define _TIM2_CC2E              ((uint8_t) (0x01 << 4))        ///< TIM2 Capture/compare 2 output enable [0] (in _TIM2_CCER1)
    #define _TIM2_CC2P              ((uint8_t) (0x01 << 5))        ///< TIM2 Capture/compare 2 output polarity [0] (in _TIM2_CCER1)
    // reserved [7:6]

    /*  TIM2 prescaler (TIM2_PSCR) */
    #define _TIM2_PSC               ((uint8_t) (0x07 << 0))        ///< TIM2 prescaler [2:0] (in _TIM2_PSCR)
    #define _TIM2_PSC0              ((uint8_t) (0x01 << 0))        ///< TIM2 prescaler [0] (in _TIM2_PSCR)
    #define _TIM2_PSC1              ((uint8_t) (0x01 << 1))        ///< TIM2 prescaler [1] (in _TIM2_PSCR)
    #define _TIM2_PSC2              ((uint8_t) (0x01 << 2))        ///< TIM2 prescaler [2] (in _TIM2_PSCR)
    // reserved [7:3]

    /*  TIM2 Break register (TIM2_BKR) */
    #define _TIM2_LOCK              ((int8_t) (0x03 << 0))         ///< TIM2 Lock configuration [1:0] (in _TIM2_BKR)
    #define _TIM2_LOCK0             ((uint8_t) (0x01 << 0))        ///< TIM2 Lock configuration [0] (in _TIM2_BKR)
    #define _TIM2_LOCK1             ((uint8_t) (0x01 << 1))        ///< TIM2 Lock configuration [1] (in _TIM2_BKR)
    #define _TIM2_OSSI              ((uint8_t) (0x01 << 2))        ///< TIM2 Off state selection for idle mode [0] (in _TIM2_BKR)
    // reserved [3]
    #define _TIM2_BKE               ((uint8_t) (0x01 << 4))        ///< TIM2 Break enable [0] (in _TIM2_BKR)
    #define _TIM2_BKP               ((uint8_t) (0x01 << 5))        ///< TIM2 Break polarity [0] (in _TIM2_BKR)
    #define _TIM2_AOE               ((uint8_t) (0x01 << 6))        ///< TIM2 Automatic output enable [0] (in _TIM2_BKR)
    #define _TIM2_MOE               ((uint8_t) (0x01 << 7))        ///< TIM2 Main output enable [0] (in _TIM2_BKR)

    /*  TIM2 Output idle state register (TIM2_OISR) */
    #define _TIM2_OIS1              ((uint8_t) (0x01 << 0))        ///< TIM2 Output idle state 1 (OC1 output) [0] (in _TIM2_OISR)
    // reserved [1]
    #define _TIM2_OIS2              ((uint8_t) (0x01 << 2))        ///< TIM2 Output idle state 2 (OC2 output) [0] (in _TIM2_OISR)
    // reserved [7:3

  #endif // TIM2_AddressBase


  /* Pointer to TIM3 registers */
  #if defined(TIM3_AddressBase)
    #define _TIM3        _SFR(TIM2_3_t,  TIM3_AddressBase)         ///< TIM3 struct/bit access
    #define _TIM3_CR1    _SFR(uint8_t,   TIM3_AddressBase+0x00)    ///< TIM3 control register 1
    #define _TIM3_CR2    _SFR(uint8_t,   TIM3_AddressBase+0x01)    ///< TIM3 control register 2
    #define _TIM3_SMCR   _SFR(uint8_t,   TIM3_AddressBase+0x02)    ///< TIM3 Slave mode control register
    #define _TIM3_ETR    _SFR(uint8_t,   TIM3_AddressBase+0x03)    ///< TIM3 External trigger register
    #define _TIM3_IER    _SFR(uint8_t,   TIM3_AddressBase+0x04)    ///< TIM3 interrupt enable register
    #define _TIM3_SR1    _SFR(uint8_t,   TIM3_AddressBase+0x05)    ///< TIM3 status register 1
    #define _TIM3_SR2    _SFR(uint8_t,   TIM3_AddressBase+0x06)    ///< TIM3 status register 2
    #define _TIM3_EGR    _SFR(uint8_t,   TIM3_AddressBase+0x07)    ///< TIM3 Event generation register
    #define _TIM3_CCMR1  _SFR(uint8_t,   TIM3_AddressBase+0x08)    ///< TIM3 Capture/compare mode register 1
    #define _TIM3_CCMR2  _SFR(uint8_t,   TIM3_AddressBase+0x09)    ///< TIM3 Capture/compare mode register 2
    #define _TIM3_CCER1  _SFR(uint8_t,   TIM3_AddressBase+0x0A)    ///< TIM3 Capture/compare enable register 1
    #define _TIM3_CNTRH  _SFR(uint8_t,   TIM3_AddressBase+0x0B)    ///< TIM3 counter register high byte
    #define _TIM3_CNTRL  _SFR(uint8_t,   TIM3_AddressBase+0x0C)    ///< TIM3 counter register low byte
    #define _TIM3_PSCR   _SFR(uint8_t,   TIM3_AddressBase+0x0D)    ///< TIM3 clock prescaler register
    #define _TIM3_ARRH   _SFR(uint8_t,   TIM3_AddressBase+0x0E)    ///< TIM3 auto-reload register high byte
    #define _TIM3_ARRL   _SFR(uint8_t,   TIM3_AddressBase+0x0F)    ///< TIM3 auto-reload register low byte
    #define _TIM3_CCR1H  _SFR(uint8_t,   TIM3_AddressBase+0x10)    ///< TIM3 16-bit capture/compare value 1 high byte
    #define _TIM3_CCR1L  _SFR(uint8_t,   TIM3_AddressBase+0x11)    ///< TIM3 16-bit capture/compare value 1 low byte
    #define _TIM3_CCR2H  _SFR(uint8_t,   TIM3_AddressBase+0x12)    ///< TIM3 16-bit capture/compare value 2 high byte
    #define _TIM3_CCR2L  _SFR(uint8_t,   TIM3_AddressBase+0x13)    ///< TIM3 16-bit capture/compare value 2 low byte
    #define _TIM3_BKR    _SFR(uint8_t,   TIM3_AddressBase+0x14)    ///< TIM3 Break register
    #define _TIM3_OISR   _SFR(uint8_t,   TIM3_AddressBase+0x15)    ///< TIM3 Output idle state register

    /* TIM3 Module Reset Values */
    #define _TIM3_CR1_RESET_VALUE        ((uint8_t) 0x00)          ///< TIM3 control register 1 reset value
    #define _TIM3_CR2_RESET_VALUE        ((uint8_t) 0x00)          ///< TIM3 control register 2 reset value
    #define _TIM3_SMCR_RESET_VALUE       ((uint8_t) 0x00)          ///< TIM3 Slave mode control register reset value
    #define _TIM3_ETR_RESET_VALUE        ((uint8_t) 0x00)          ///< TIM3 External trigger register reset value
    #define _TIM3_IER_RESET_VALUE        ((uint8_t) 0x00)          ///< TIM3 interrupt enable register reset value
    #define _TIM3_SR1_RESET_VALUE        ((uint8_t) 0x00)          ///< TIM3 status register 1 reset value
    #define _TIM3_SR2_RESET_VALUE        ((uint8_t) 0x00)          ///< TIM3 status register 2 reset value
    #define _TIM3_EGR_RESET_VALUE        ((uint8_t) 0x00)          ///< TIM3 Event generation register reset value
    #define _TIM3_CCMR1_RESET_VALUE      ((uint8_t) 0x00)          ///< TIM3 Capture/compare mode register 1 reset value
    #define _TIM3_CCMR2_RESET_VALUE      ((uint8_t) 0x00)          ///< TIM3 Capture/compare mode register 2 reset value
    #define _TIM3_CCER1_RESET_VALUE      ((uint8_t) 0x00)          ///< TIM3 Capture/compare enable register 1 reset value
    #define _TIM3_CNTRH_RESET_VALUE      ((uint8_t) 0x00)          ///< TIM3 counter register high byte reset value
    #define _TIM3_CNTRL_RESET_VALUE      ((uint8_t) 0x00)          ///< TIM3 counter register low byte reset value
    #define _TIM3_PSCR_RESET_VALUE       ((uint8_t) 0x00)          ///< TIM3 clock prescaler register reset value
    #define _TIM3_ARRH_RESET_VALUE       ((uint8_t) 0xFF)          ///< TIM3 auto-reload register high byte reset value
    #define _TIM3_ARRL_RESET_VALUE       ((uint8_t) 0xFF)          ///< TIM3 auto-reload register low byte reset value
    #define _TIM3_RCR_RESET_VALUE        ((uint8_t) 0x00)          ///< TIM3 Repetition counter reset value
    #define _TIM3_CCR1H_RESET_VALUE      ((uint8_t) 0x00)          ///< TIM3 16-bit capture/compare value 1 high byte reset value
    #define _TIM3_CCR1L_RESET_VALUE      ((uint8_t) 0x00)          ///< TIM3 16-bit capture/compare value 1 low byte reset value
    #define _TIM3_CCR2H_RESET_VALUE      ((uint8_t) 0x00)          ///< TIM3 16-bit capture/compare value 2 high byte reset value
    #define _TIM3_CCR2L_RESET_VALUE      ((uint8_t) 0x00)          ///< TIM3 16-bit capture/compare value 2 low byte reset value
    #define _TIM3_BKR_RESET_VALUE        ((uint8_t) 0x00)          ///< TIM3 Break register reset value
    #define _TIM3_OISR_RESET_VALUE       ((uint8_t) 0x00)          ///< TIM3 Output idle state register reset value

    /* TIM3 Control register (TIM3_CR1) */
    #define _TIM3_CEN               ((uint8_t) (0x01 << 0))        ///< TIM3 Counter enable [0] (in _TIM3_CR1)
    #define _TIM3_UDIS              ((uint8_t) (0x01 << 1))        ///< TIM3 Update disable [0] (in _TIM3_CR1)
    #define _TIM3_URS               ((uint8_t) (0x01 << 2))        ///< TIM3 Update request source [0] (in _TIM3_CR1)
    #define _TIM3_OPM               ((uint8_t) (0x01 << 3))        ///< TIM3 One-pulse mode [0] (in _TIM3_CR1)
    #define _TIM3_DIR               ((uint8_t) (0x01 << 4))        ///< TIM3 Direction [0] (in _TIM3_CR1)
    #define _TIM3_CMS               ((uint8_t) (0x03 << 5))        ///< TIM3 Center-aligned Mode Selection [0:1] (in _TIM2_CR1)
    #define _TIM3_CMS0              ((uint8_t) (0x01 << 5))        ///< TIM3 Center-aligned Mode Selection [0] (in _TIM2_CR1)
    #define _TIM3_CMS1              ((uint8_t) (0x01 << 6))        ///< TIM3 Center-aligned Mode Selection [1] (in _TIM2_CR1)
    #define _TIM3_ARPE              ((uint8_t) (0x01 << 7))        ///< TIM3 Auto-reload preload enable [0] (in _TIM3_CR1)

    /* TIM3 Control register (TIM3_CR2) */
    // reserved [3:0]
    #define _TIM3_MMS               ((uint8_t) (0x07 << 4))        ///< TIM3 Master mode selection [2:0] (in _TIM3_CR2)
    #define _TIM3_MMS0              ((uint8_t) (0x01 << 4))        ///< TIM3 Master mode selection [0] (in _TIM3_CR2)
    #define _TIM3_MMS1              ((uint8_t) (0x01 << 5))        ///< TIM3 Master mode selection [1] (in _TIM3_CR2)
    #define _TIM3_MMS2              ((uint8_t) (0x01 << 6))        ///< TIM3 Master mode selection [2] (in _TIM3_CR2)
    // reserved [7]

