STM8-SPL-license/discussion/Header/STM8TL5x.h
    /* TIM3 Slave mode control register (TIM3_SMCR) */
    #define _TIM3_SMS               ((uint8_t) (0x07 << 0))        ///< TIM3 Clock/trigger/slave mode selection [2:0] (in _TIM3_SMCR)
    #define _TIM3_SMS0              ((uint8_t) (0x01 << 0))        ///< TIM3 Clock/trigger/slave mode selection [0] (in _TIM3_SMCR)
    #define _TIM3_SMS1              ((uint8_t) (0x01 << 1))        ///< TIM3 Clock/trigger/slave mode selection [1] (in _TIM3_SMCR)
    #define _TIM3_SMS2              ((uint8_t) (0x01 << 2))        ///< TIM3 Clock/trigger/slave mode selection [2] (in _TIM3_SMCR)
    // reserved [3]
    #define _TIM3_TS                ((uint8_t) (0x07 << 4))        ///< TIM3 Trigger selection [2:0] (in _TIM3_SMCR)
    #define _TIM3_TS0               ((uint8_t) (0x01 << 4))        ///< TIM3 Trigger selection [0] (in _TIM3_SMCR)
    #define _TIM3_TS1               ((uint8_t) (0x01 << 5))        ///< TIM3 Trigger selection [1] (in _TIM3_SMCR)
    #define _TIM3_TS2               ((uint8_t) (0x01 << 6))        ///< TIM3 Trigger selection [2] (in _TIM3_SMCR)
    #define _TIM3_MSM               ((uint8_t) (0x01 << 7))        ///< TIM3 Master/slave mode [0] (in _TIM3_SMCR)

    /* TIM3 External trigger register (TIM3_ETR) */
    #define _TIM3_ETF               ((uint8_t) (0x0F << 0))        ///< TIM3 External trigger filter [3:0] (in _TIM3_ETR)
    #define _TIM3_ETF0              ((uint8_t) (0x01 << 0))        ///< TIM3 External trigger filter [0] (in _TIM3_ETR)
    #define _TIM3_ETF1              ((uint8_t) (0x01 << 1))        ///< TIM3 External trigger filter [1] (in _TIM3_ETR)
    #define _TIM3_ETF2              ((uint8_t) (0x01 << 2))        ///< TIM3 External trigger filter [2] (in _TIM3_ETR)
    #define _TIM3_ETF3              ((uint8_t) (0x01 << 3))        ///< TIM3 External trigger filter [3] (in _TIM3_ETR)
    #define _TIM3_ETPS              ((uint8_t) (0x03 << 4))        ///< TIM3 External trigger prescaler [1:0] (in _TIM3_ETR)
    #define _TIM3_ETPS0             ((uint8_t) (0x01 << 4))        ///< TIM3 External trigger prescaler [0] (in _TIM3_ETR)
    #define _TIM3_ETPS1             ((uint8_t) (0x01 << 5))        ///< TIM3 External trigger prescaler [1] (in _TIM3_ETR)
    #define _TIM3_ECE               ((uint8_t) (0x01 << 6))        ///< TIM3 External clock enable [0] (in _TIM3_ETR)
    #define _TIM3_ETP               ((uint8_t) (0x01 << 7))        ///< TIM3 External trigger polarity [0] (in _TIM3_ETR)

    /* TIM3 Interrupt enable (TIM3_IER) */
    #define _TIM3_UIE               ((uint8_t) (0x01 << 0))        ///< TIM3 Update interrupt enable [0] (in _TIM3_IER)
    #define _TIM3_CC1IE             ((uint8_t) (0x01 << 1))        ///< TIM3 Capture/compare 1 interrupt enable [0] (in _TIM3_IER)
    #define _TIM3_CC2IE             ((uint8_t) (0x01 << 2))        ///< TIM3 Capture/compare 2 interrupt enable [0] (in _TIM3_IER)
    // reserved [5:3]
    #define _TIM3_TIE               ((uint8_t) (0x01 << 6))        ///< TIM3 Trigger interrupt enable [0] (in _TIM3_IER)
    #define _TIM3_BIE               ((uint8_t) (0x01 << 7))        ///< TIM3 Break interrupt enable [0] (in _TIM3_IER)

    /*  TIM3 Status register 1 (TIM3_SR1) */
    #define _TIM3_UIF               ((uint8_t) (0x01 << 0))        ///< TIM3 Update interrupt flag [0] (in _TIM3_SR1)
    #define _TIM3_CC1IF             ((uint8_t) (0x01 << 1))        ///< TIM3 Capture/compare 1 interrupt flag [0] (in _TIM3_SR1)
    #define _TIM3_CC2IF             ((uint8_t) (0x01 << 2))        ///< TIM3 Capture/compare 2 interrupt flag [0] (in _TIM3_SR1)
    // reserved [5:3]
    #define _TIM3_TIF               ((uint8_t) (0x01 << 6))        ///< TIM3 Trigger interrupt flag [0] (in _TIM3_SR1)
    #define _TIM3_BIF               ((uint8_t) (0x01 << 7))        ///< TIM3 Break interrupt flag [0] (in _TIM3_SR1)

    /*  TIM3 Status register 2 (TIM3_SR2) */
    // reserved [0]
    #define _TIM3_CC1OF             ((uint8_t) (0x01 << 1))        ///< TIM3 Capture/compare 1 overcapture flag [0] (in _TIM3_SR2)
    #define _TIM3_CC2OF             ((uint8_t) (0x01 << 2))        ///< TIM3 Capture/compare 2 overcapture flag [0] (in _TIM3_SR2)
    // reserved [7:3]

    /*  TIM3 Event generation register (TIM3_EGR) */
    #define _TIM3_UG                ((uint8_t) (0x01 << 0))        ///< TIM3 Update generation [0] (in _TIM3_EGR)
    #define _TIM3_CC1G              ((uint8_t) (0x01 << 1))        ///< TIM3 Capture/compare 1 generation [0] (in _TIM3_EGR)
    #define _TIM3_CC2G              ((uint8_t) (0x01 << 2))        ///< TIM3 Capture/compare 2 generation [0] (in _TIM3_EGR)
    // reserved [5:3]
    #define _TIM3_TG                ((uint8_t) (0x01 << 6))        ///< TIM3 Trigger generation [0] (in _TIM3_EGR)
    #define _TIM3_BG                ((uint8_t) (0x01 << 7))        ///< TIM3 Break generation [0] (in _TIM3_EGR)

    /*  TIM3 Capture/compare mode register 1 (TIM3_CCMR1). Output mode */
    #define _TIM3_CC1S              ((uint8_t) (0x03 << 0))        ///< TIM3 Compare 1 selection [1:0] (in _TIM3_CCMR1)
    #define _TIM3_CC1S0             ((uint8_t) (0x01 << 0))        ///< TIM3 Compare 1 selection [0] (in _TIM3_CCMR1)
    #define _TIM3_CC1S1             ((uint8_t) (0x01 << 1))        ///< TIM3 Compare 1 selection [1] (in _TIM3_CCMR1)
    #define _TIM3_OC1FE             ((uint8_t) (0x01 << 2))        ///< TIM3 Output compare 1 fast enable [0] (in _TIM3_CCMR1)
    #define _TIM3_OC1PE             ((uint8_t) (0x01 << 3))        ///< TIM3 Output compare 1 preload enable [0] (in _TIM3_CCMR1)
    #define _TIM3_OC1M              ((uint8_t) (0x07 << 4))        ///< TIM3 Output compare 1 mode [2:0] (in _TIM3_CCMR1)
    #define _TIM3_OC1M0             ((uint8_t) (0x01 << 4))        ///< TIM3 Output compare 1 mode [0] (in _TIM3_CCMR1)
    #define _TIM3_OC1M1             ((uint8_t) (0x01 << 5))        ///< TIM3 Output compare 1 mode [1] (in _TIM3_CCMR1)
    #define _TIM3_OC1M2             ((uint8_t) (0x01 << 6))        ///< TIM3 Output compare 1 mode [2] (in _TIM3_CCMR1)
    // reserved [7]

    /*  TIM3 Capture/compare mode register 1 (TIM3_CCMR1). Input mode */
    // _TIM3_CC1S [1:0] defined above
    #define _TIM3_IC1PSC            ((uint8_t) (0x03 << 2))        ///< TIM3 Input capture 1 prescaler [1:0] (in _TIM3_CCMR1)
    #define _TIM3_IC1PSC0           ((uint8_t) (0x01 << 2))        ///< TIM3 Input capture 1 prescaler [0] (in _TIM3_CCMR1)
    #define _TIM3_IC1PSC1           ((uint8_t) (0x01 << 3))        ///< TIM3 Input capture 1 prescaler [1] (in _TIM3_CCMR1)
    #define _TIM3_IC1F              ((uint8_t) (0x0F << 4))        ///< TIM3 Output compare 1 mode [3:0] (in _TIM3_CCMR1)
    #define _TIM3_IC1F0             ((uint8_t) (0x01 << 4))        ///< TIM3 Input capture 1 filter [0] (in _TIM3_CCMR1)
    #define _TIM3_IC1F1             ((uint8_t) (0x01 << 5))        ///< TIM3 Input capture 1 filter [1] (in _TIM3_CCMR1)
    #define _TIM3_IC1F2             ((uint8_t) (0x01 << 6))        ///< TIM3 Input capture 1 filter [2] (in _TIM3_CCMR1)
    #define _TIM3_IC1F3             ((uint8_t) (0x01 << 7))        ///< TIM3 Input capture 1 filter [3] (in _TIM3_CCMR1)

    /*  TIM3 Capture/compare mode register 2 (TIM3_CCMR2). Output mode */
    #define _TIM3_CC2S              ((uint8_t) (0x03 << 0))        ///< TIM3 Compare 2 selection [1:0] (in _TIM3_CCMR2)
    #define _TIM3_CC2S0             ((uint8_t) (0x01 << 0))        ///< TIM3 Compare 2 selection [0] (in _TIM3_CCMR2)
    #define _TIM3_CC2S1             ((uint8_t) (0x01 << 1))        ///< TIM3 Compare 2 selection [1] (in _TIM3_CCMR2)
    #define _TIM3_OC2FE             ((uint8_t) (0x01 << 2))        ///< TIM3 Output compare 2 fast enable [0] (in _TIM3_CCMR2)
    #define _TIM3_OC2PE             ((uint8_t) (0x01 << 3))        ///< TIM3 Output compare 2 preload enable [0] (in _TIM3_CCMR2)
    #define _TIM3_OC2M              ((uint8_t) (0x07 << 4))        ///< TIM3 Output compare 2 mode [2:0] (in _TIM3_CCMR2)
    #define _TIM3_OC2M0             ((uint8_t) (0x01 << 4))        ///< TIM3 Output compare 2 mode [0] (in _TIM3_CCMR2)
    #define _TIM3_OC2M1             ((uint8_t) (0x01 << 5))        ///< TIM3 Output compare 2 mode [1] (in _TIM3_CCMR2)
    #define _TIM3_OC2M2             ((uint8_t) (0x01 << 6))        ///< TIM3 Output compare 2 mode [2] (in _TIM3_CCMR2)
    // reserved [7]

    /*  TIM3 Capture/compare mode register 2 (TIM3_CCMR2). Input mode */
    // _TIM3_CC2S [1:0] defined above
    #define _TIM3_IC2PSC            ((uint8_t) (0x03 << 2))        ///< TIM3 Input capture 2 prescaler [1:0] (in _TIM3_CCMR2)
    #define _TIM3_IC2PSC0           ((uint8_t) (0x01 << 2))        ///< TIM3 Input capture 2 prescaler [0] (in _TIM3_CCMR2)
    #define _TIM3_IC2PSC1           ((uint8_t) (0x01 << 3))        ///< TIM3 Input capture 2 prescaler [1] (in _TIM3_CCMR2)
    #define _TIM3_IC2F              ((uint8_t) (0x0F << 4))        ///< TIM3 Output compare 2 mode [3:0] (in _TIM3_CCMR2)
    #define _TIM3_IC2F0             ((uint8_t) (0x01 << 4))        ///< TIM3 Input capture 2 filter [0] (in _TIM3_CCMR2)
    #define _TIM3_IC2F1             ((uint8_t) (0x01 << 5))        ///< TIM3 Input capture 2 filter [1] (in _TIM3_CCMR2)
    #define _TIM3_IC2F2             ((uint8_t) (0x01 << 6))        ///< TIM3 Input capture 2 filter [2] (in _TIM3_CCMR2)
    #define _TIM3_IC2F3             ((uint8_t) (0x01 << 7))        ///< TIM3 Input capture 2 filter [3] (in _TIM3_CCMR2)

    /*  TIM3 Capture/compare enable register 1 (TIM3_CCER1) */
    #define _TIM3_CC1E              ((uint8_t) (0x01 << 0))        ///< TIM3 Capture/compare 1 output enable [0] (in _TIM3_CCER1)
    #define _TIM3_CC1P              ((uint8_t) (0x01 << 1))        ///< TIM3 Capture/compare 1 output polarity [0] (in _TIM3_CCER1)
    // reserved [3:4]
    #define _TIM3_CC2E              ((uint8_t) (0x01 << 4))        ///< TIM3 Capture/compare 2 output enable [0] (in _TIM3_CCER1)
    #define _TIM3_CC2P              ((uint8_t) (0x01 << 5))        ///< TIM3 Capture/compare 2 output polarity [0] (in _TIM3_CCER1)
    // reserved [7:6]

