STM8-SPL-license/discussion/Header/STM8TL5x.h
    /*  TIM3 prescaler (TIM3_PSCR) */
    #define _TIM3_PSC               ((uint8_t) (0x07 << 0))        ///< TIM3 prescaler [2:0] (in _TIM3_PSCR)
    #define _TIM3_PSC0              ((uint8_t) (0x01 << 0))        ///< TIM3 prescaler [0] (in _TIM3_PSCR)
    #define _TIM3_PSC1              ((uint8_t) (0x01 << 1))        ///< TIM3 prescaler [1] (in _TIM3_PSCR)
    #define _TIM3_PSC2              ((uint8_t) (0x01 << 2))        ///< TIM3 prescaler [2] (in _TIM3_PSCR)
    // reserved [7:3]

    /*  TIM3 Break register (TIM3_BKR) */
    #define _TIM3_LOCK              ((int8_t) (0x03 << 0))         ///< TIM3 Lock configuration [1:0] (in _TIM3_BKR)
    #define _TIM3_LOCK0             ((uint8_t) (0x01 << 0))        ///< TIM3 Lock configuration [0] (in _TIM3_BKR)
    #define _TIM3_LOCK1             ((uint8_t) (0x01 << 1))        ///< TIM3 Lock configuration [1] (in _TIM3_BKR)
    #define _TIM3_OSSI              ((uint8_t) (0x01 << 2))        ///< TIM3 Off state selection for idle mode [0] (in _TIM3_BKR)
    // reserved [3]
    #define _TIM3_BKE               ((uint8_t) (0x01 << 4))        ///< TIM3 Break enable [0] (in _TIM3_BKR)
    #define _TIM3_BKP               ((uint8_t) (0x01 << 5))        ///< TIM3 Break polarity [0] (in _TIM3_BKR)
    #define _TIM3_AOE               ((uint8_t) (0x01 << 6))        ///< TIM3 Automatic output enable [0] (in _TIM3_BKR)
    #define _TIM3_MOE               ((uint8_t) (0x01 << 7))        ///< TIM3 Main output enable [0] (in _TIM3_BKR)

    /*  TIM3 Output idle state register (TIM3_OISR) */
    #define _TIM3_OIS1              ((uint8_t) (0x01 << 0))        ///< TIM3 Output idle state 1 (OC1 output) [0] (in _TIM3_OISR)
    // reserved [1]
    #define _TIM3_OIS2              ((uint8_t) (0x01 << 2))        ///< TIM3 Output idle state 2 (OC2 output) [0] (in _TIM3_OISR)
    // reserved [7:3

  #endif // TIM3_AddressBase

#endif // TIM2_AddressBase || TIM3_AddressBase



//------------------------
// 8-Bit Timer 4 (TIM4)
//------------------------
#if defined(TIM4_AddressBase)

  /** @brief struct for controlling 8-Bit Timer 4 (TIM4) */
  typedef struct {

    /** @brief TIM4 Control register 1 (TIM4_CR1) */
    struct {
      _BITS   CEN     : 1;    ///< Counter enable
      _BITS   UDIS    : 1;    ///< Update disable
      _BITS   URS     : 1;    ///< Update request source
      _BITS   OPM     : 1;    ///< One-pulse mode
      _BITS           : 3;    //   Reserved
      _BITS   ARPE    : 1;    ///< Auto-reload preload enable
    } CR1;


    /** @brief TIM4 Control register 2 (TIM4_CR2) */
    struct {
      _BITS           : 4;    //   Reserved
      _BITS   MMS     : 3;    ///< Master mode selection
      _BITS           : 1;    //   Reserved
    } CR2;


    /** @brief TIM4 Slave mode control register (TIM4_SMCR) */
    struct {
      _BITS   SMS     : 3;    ///< Clock/trigger/slave mode selection
      _BITS           : 1;    //   Reserved
      _BITS   TS      : 3;    ///< Trigger selection
      _BITS   MSM     : 1;    ///< Master/slave mode
    } SMCR;


    /** @brief TIM4 Interrupt enable (TIM4_IER) */
    struct {
      _BITS   UIE     : 1;    ///< Update interrupt enable
      _BITS           : 5;    //   Reserved
      _BITS   TIE     : 1;    ///< Trigger interrupt enable
      _BITS           : 1;    //   Reserved
    } IER;


    /** @brief TIM4 Status register (TIM4_SR1) */
    struct {
      _BITS   UIF     : 1;    ///< Update interrupt flag
      _BITS           : 5;    //   Reserved
      _BITS   TIF     : 1;    ///< Trigger interrupt flag
      _BITS           : 1;    //   Reserved
    } SR1;


    /** @brief TIM4 Event Generation (TIM4_EGR) */
    struct {
      _BITS   UG      : 1;    ///< Update generation
      _BITS           : 5;    //   Reserved
      _BITS   TG      : 1;    ///< Trigger generation
      _BITS           : 1;    //   Reserved
    } EGR;


    /** @brief TIM4 8-bit counter register (TIM4_CNTR) */
    struct {
      _BITS   CNT     : 8;    ///< 8-bit counter
    } CNTR;

    /** @brief TIM4 clock prescaler (TIM4_PSCR) */
    struct {
      _BITS   PSC     : 4;    ///< clock prescaler
      _BITS           : 4;    //   Reserved
    } PSCR;


    /** @brief TIM4 8-bit auto-reload register (TIM4_ARR) */
    struct {
      _BITS   ARR     : 8;    ///< auto-reload value
    } ARR;

  } TIM4_t;

  /* Pointer to TIM4 registers */
  #define _TIM4       _SFR(TIM4_t,   TIM4_AddressBase)         ///< TIM4 struct/bit access
  #define _TIM4_CR1   _SFR(uint8_t,  TIM4_AddressBase+0x00)    ///< TIM4 control register 1
  #define _TIM4_CR2   _SFR(uint8_t,  TIM4_AddressBase+0x01)    ///< TIM4 control register 2
  #define _TIM4_SMCR  _SFR(uint8_t,  TIM4_AddressBase+0x02)    ///< TIM4 Slave mode control register
  #define _TIM4_IER   _SFR(uint8_t,  TIM4_AddressBase+0x03)    ///< TIM4 interrupt enable register
  #define _TIM4_SR1   _SFR(uint8_t,  TIM4_AddressBase+0x04)    ///< TIM4 status register
  #define _TIM4_EGR   _SFR(uint8_t,  TIM4_AddressBase+0x05)    ///< TIM4 event generation register
  #define _TIM4_CNTR  _SFR(uint8_t,  TIM4_AddressBase+0x06)    ///< TIM4 counter register
  #define _TIM4_PSCR  _SFR(uint8_t,  TIM4_AddressBase+0x07)    ///< TIM4 clock prescaler register
  #define _TIM4_ARR   _SFR(uint8_t,  TIM4_AddressBase+0x08)    ///< TIM4 auto-reload register

  /* TIM4 Module Reset Values */
  #define _TIM4_CR1_RESET_VALUE        ((uint8_t) 0x00)          ///< TIM4 control register 1 reset value
  #define _TIM4_CR2_RESET_VALUE        ((uint8_t) 0x00)          ///< TIM4 control register 2 reset value
  #define _TIM4_SMCR_RESET_VALUE       ((uint8_t) 0x00)          ///< TIM4 Slave mode control register reset value
  #define _TIM4_IER_RESET_VALUE        ((uint8_t) 0x00)          ///< TIM4 interrupt enable register reset value
  #define _TIM4_SR1_RESET_VALUE        ((uint8_t) 0x00)          ///< TIM4 status register reset value
  #define _TIM4_EGR_RESET_VALUE        ((uint8_t) 0x00)          ///< TIM4 event generation register reset value
  #define _TIM4_CNTR_RESET_VALUE       ((uint8_t) 0x00)          ///< TIM4 counter register reset value
  #define _TIM4_PSCR_RESET_VALUE       ((uint8_t) 0x00)          ///< TIM4 clock prescaler register reset value
  #define _TIM4_ARR_RESET_VALUE        ((uint8_t) 0xFF)          ///< TIM4 auto-reload register reset value

