STM8-SPL-license/discussion/Header/STM8TL5x.h
  /* TIM4 Control register 1 (TIM4_CR1) */
  #define _TIM4_CEN               ((uint8_t) (0x01 << 0))        ///< TIM4 Counter enable [0] (in _TIM4_CR1)
  #define _TIM4_UDIS              ((uint8_t) (0x01 << 1))        ///< TIM4 Update disable [0] (in _TIM4_CR1)
  #define _TIM4_URS               ((uint8_t) (0x01 << 2))        ///< TIM4 Update request source [0] (in _TIM4_CR1)
  #define _TIM4_OPM               ((uint8_t) (0x01 << 3))        ///< TIM4 One-pulse mode [0] (in _TIM4_CR1)
  // reserved [6:4]
  #define _TIM4_ARPE              ((uint8_t) (0x01 << 7))        ///< TIM4 Auto-reload preload enable [0] (in _TIM4_CR)

  /* TIM4 Control register (TIM4_CR2) */
  // reserved [3:0]
  #define _TIM4_MMS               ((uint8_t) (0x07 << 4))        ///< TIM4 Master mode selection [2:0] (in _TIM4_CR2)
  #define _TIM4_MMS0              ((uint8_t) (0x01 << 4))        ///< TIM4 Master mode selection [0] (in _TIM4_CR2)
  #define _TIM4_MMS1              ((uint8_t) (0x01 << 5))        ///< TIM4 Master mode selection [1] (in _TIM4_CR2)
  #define _TIM4_MMS2              ((uint8_t) (0x01 << 6))        ///< TIM4 Master mode selection [2] (in _TIM4_CR2)
  // reserved [7]

  /* TIM4 Slave mode control register (TIM4_SMCR) */
  #define _TIM4_SMS               ((uint8_t) (0x07 << 0))        ///< TIM4 Clock/trigger/slave mode selection [2:0] (in _TIM4_SMCR)
  #define _TIM4_SMS0              ((uint8_t) (0x01 << 0))        ///< TIM4 Clock/trigger/slave mode selection [0] (in _TIM4_SMCR)
  #define _TIM4_SMS1              ((uint8_t) (0x01 << 1))        ///< TIM4 Clock/trigger/slave mode selection [1] (in _TIM4_SMCR)
  #define _TIM4_SMS2              ((uint8_t) (0x01 << 2))        ///< TIM4 Clock/trigger/slave mode selection [2] (in _TIM4_SMCR)
  // reserved [3]
  #define _TIM4_TS                ((uint8_t) (0x07 << 4))        ///< TIM4 Trigger selection [2:0] (in _TIM4_SMCR)
  #define _TIM4_TS0               ((uint8_t) (0x01 << 4))        ///< TIM4 Trigger selection [0] (in _TIM4_SMCR)
  #define _TIM4_TS1               ((uint8_t) (0x01 << 5))        ///< TIM4 Trigger selection [1] (in _TIM4_SMCR)
  #define _TIM4_TS2               ((uint8_t) (0x01 << 6))        ///< TIM4 Trigger selection [2] (in _TIM4_SMCR)
  #define _TIM4_MSM               ((uint8_t) (0x01 << 7))        ///< TIM4 Master/slave mode [0] (in _TIM4_SMCR)

  /*  TIM4 Interrupt enable (TIM4_IER) */
  #define _TIM4_UIE               ((uint8_t) (0x01 << 0))        ///< TIM4 Update interrupt enable [0] (in _TIM4_IER)
  // reserved [5:1]
  #define _TIM4_TIE               ((uint8_t) (0x01 << 6))        ///< TIM4 Trigger interrupt enable [0] (in _TIM4_IER)
  // reserved [7]

  /*  TIM4 Status register (TIM4_SR1) */
  #define _TIM4_UIF               ((uint8_t) (0x01 << 0))        ///< TIM4 Update interrupt flag [0] (in _TIM4_SR1)
  // reserved [5:1]
  #define _TIM4_TIF               ((uint8_t) (0x01 << 6))        ///< TIM4 Trigger interrupt flag [0] (in _TIM4_SR1)
  // reserved [7]

  /*  TIM4 Event generation register (TIM4_EGR) */
  #define _TIM4_UG                ((uint8_t) (0x01 << 0))        ///< TIM4 Update generation [0] (in _TIM4_EGR)
  // reserved [5:3]
  #define _TIM4_TG                ((uint8_t) (0x01 << 6))        ///< TIM4 Trigger generation [0] (in _TIM4_EGR)
  // reserved [7]

  /* TIM4 Prescaler register (TIM4_PSCR) */
  #define _TIM4_PSC               ((uint8_t) (0x0F << 0))        ///< TIM4 clock prescaler [3:0] (in _TIM4_PSCR)
  #define _TIM4_PSC0              ((uint8_t) (0x01 << 0))        ///< TIM4 clock prescaler [0] (in _TIM4_PSCR)
  #define _TIM4_PSC1              ((uint8_t) (0x01 << 1))        ///< TIM4 clock prescaler [1] (in _TIM4_PSCR)
  #define _TIM4_PSC2              ((uint8_t) (0x01 << 2))        ///< TIM4 clock prescaler [2] (in _TIM4_PSCR)
  #define _TIM4_PSC3              ((uint8_t) (0x01 << 3))        ///< TIM4 clock prescaler [3] (in _TIM4_PSCR)
  // reserved [7:4]

#endif // TIM4_AddressBase



//------------------------
// Proximity Sense registers (PXS)
//------------------------
#if defined(PXS_AddressBase)

  /** @brief struct for Proximity Sense registers (PXS) */
  typedef struct {

    /** @brief ProxSense Control Register 1 (PXS_CR1) */
    struct {
      _BITS             : 5;    //   Reserved
      _BITS   LOW_POWER : 1;    ///< Low power mode
      _BITS   START     : 1;    ///< Start conversion
      _BITS   PXSEN     : 1;    ///< ProxSense enable
    } CR1;

    /** @brief ProxSense Control Register 2 (PXS_CR2) */
    struct {
      _BITS   SYNCEDGE   : 1;    ///< Synchronization edge selection
      _BITS   SYNCEN     : 1;    ///< Enable synchronization (SYNC) feature
      _BITS   RXCOUPLING : 1;    ///< Reduce coupling between receiver lines
      _BITS   RXGROUP    : 1;    ///< Rx group selection
      _BITS              : 1;    //   Reserved
      _BITS   NOISEDETEN : 1;    ///< Noise detection enable
      _BITS   FCCITEN    : 1;    ///< First conversion completion interrupt enable
      _BITS   EOCITEN    : 1;    ///< End of conversion interrupt enable
    } CR2;

    /** @brief ProxSense Control Register 3 (PXS_CR3) */
    struct {
      _BITS   VTHR       : 4;    ///< Threshold voltage (Vthr) selection
      _BITS   BIAS       : 2;    ///< Sample and hold strength selection
      _BITS   STAB       : 2;    ///< Selection for stabilization time after ProxSense power-on
    } CR3;

    /** @brief Reserved register (1B) */
    uint8_t res     [1];

    /** @brief ProxSense Interrupt and Status Register (PXS_ISR) */
    struct {
      _BITS              : 2;    //   Reserved
      _BITS   SYNC_OVRF  : 1;    ///< Synchronization (SYNC) overflow flag
      _BITS   SYNCPF     : 1;    ///< Synchronization (SYNC) pending flag
      _BITS   CIPF       : 1;    ///< Conversion in progress flag
      _BITS   NOISEDETF  : 1;    ///< Noise detection flag
      _BITS   FCCF       : 1;    ///< First conversion completion flag
      _BITS   EOCF       : 1;    ///< End of conversion flag
    } ISR;

    /** @brief Reserved register (1B) */
    uint8_t res2    [1];

    /** @brief ProxSense Clock Control Register 1 (PXS_CKCR1) */
    struct {
      _BITS   INCPHASE   : 1;    ///< Increase length of UP and PASS by 1/2 clock cycle
      _BITS   ANADEAD    : 1;    ///< ensure UP-PASS deadtime using analog delay
      _BITS              : 2;    //   Reserved
      _BITS   PRESC      : 3;    ///< Frequency selection for ProxSense clock
      _BITS              : 1;    //   Reserved
    } CKCR1;

    /** @brief ProxSense Clock Control Register 2 (PXS_CKCR2) */
    struct {
      _BITS   PASSLEN    : 3;    ///< Length of PASS phase
      _BITS              : 1;    //   Reserved
      _BITS   UPLEN      : 3;    ///< Length of UP phase
      _BITS              : 1;    //   Reserved
    } CKCR2;

