STM8-SPL-license/discussion/Header/STM8TL5x.h
    /** @brief ProxSense Receiver Enable Register high byte (PXS_RXENRH) */
    struct {
      _BITS   RXEN8      : 1;    ///< Enable receiver channel 8
      _BITS   RXEN9      : 1;    ///< Enable receiver channel 9
      _BITS              : 6;    //   Reserved
    } RXENRH;

    /** @brief ProxSense Receiver Enable Register low byte (PXS_RXENRL) */
    struct {
      _BITS   RXEN0      : 1;    ///< Enable receiver channel 0
      _BITS   RXEN1      : 1;    ///< Enable receiver channel 1
      _BITS   RXEN2      : 1;    ///< Enable receiver channel 2
      _BITS   RXEN3      : 1;    ///< Enable receiver channel 3
      _BITS   RXEN4      : 1;    ///< Enable receiver channel 4
      _BITS   RXEN5      : 1;    ///< Enable receiver channel 5
      _BITS   RXEN6      : 1;    ///< Enable receiver channel 6
      _BITS   RXEN7      : 1;    ///< Enable receiver channel 7
    } RXENRL;

    /** @brief ProxSense Receiver Control Register 1 high byte (PXS_RXCR1H) */
    struct {
      _BITS   RXCR1_8    : 1;    ///< Receiver channel 1 Conversion mode 8
      _BITS   RXCR1_9    : 1;    ///< Receiver channel 1 Conversion mode 9
      _BITS              : 6;    //   Reserved
    } RXCR1H;

    /** @brief ProxSense Receiver Control Register 1 low byte (PXS_RXCR1L) */
    struct {
      _BITS   RXCR1_0    : 1;    ///< Receiver channel 1 Conversion mode 0
      _BITS   RXCR1_1    : 1;    ///< Receiver channel 1 Conversion mode 1
      _BITS   RXCR1_2    : 1;    ///< Receiver channel 1 Conversion mode 2
      _BITS   RXCR1_3    : 1;    ///< Receiver channel 1 Conversion mode 3
      _BITS   RXCR1_4    : 1;    ///< Receiver channel 1 Conversion mode 4
      _BITS   RXCR1_5    : 1;    ///< Receiver channel 1 Conversion mode 5
      _BITS   RXCR1_6    : 1;    ///< Receiver channel 1 Conversion mode 6
      _BITS   RXCR1_7    : 1;    ///< Receiver channel 1 Conversion mode 7
    } RXCR1L;

    /** @brief ProxSense Receiver Control Register 2 high byte (PXS_RXCR2H) */
    struct {
      _BITS   RXCR2_8    : 1;    ///< Receiver channel 2 Conversion mode 8
      _BITS   RXCR2_9    : 1;    ///< Receiver channel 2 Conversion mode 9
      _BITS              : 6;    //   Reserved
    } RXCR2H;

    /** @brief ProxSense Receiver Control Register 2 low byte (PXS_RXCR2L) */
    struct {
      _BITS   RXCR2_0    : 1;    ///< Receiver channel 2 Conversion mode 0
      _BITS   RXCR2_1    : 1;    ///< Receiver channel 2 Conversion mode 1
      _BITS   RXCR2_2    : 1;    ///< Receiver channel 2 Conversion mode 2
      _BITS   RXCR2_3    : 1;    ///< Receiver channel 2 Conversion mode 3
      _BITS   RXCR2_4    : 1;    ///< Receiver channel 2 Conversion mode 4
      _BITS   RXCR2_5    : 1;    ///< Receiver channel 2 Conversion mode 5
      _BITS   RXCR2_6    : 1;    ///< Receiver channel 2 Conversion mode 6
      _BITS   RXCR2_7    : 1;    ///< Receiver channel 2 Conversion mode 7
    } RXCR2L;

    /** @brief ProxSense Receiver Control Register 3 high byte (PXS_RXCR3H) */
    struct {
      _BITS   RXCR3_8    : 1;    ///< Receiver channel 3 Conversion mode 8
      _BITS   RXCR3_9    : 1;    ///< Receiver channel 3 Conversion mode 9
      _BITS              : 6;    //   Reserved
    } RXCR3H;

    /** @brief ProxSense Receiver Control Register 3 low byte (PXS_RXCR3L) */
    struct {
      _BITS   RXCR3_0    : 1;    ///< Receiver channel 3 Conversion mode 0
      _BITS   RXCR3_1    : 1;    ///< Receiver channel 3 Conversion mode 1
      _BITS   RXCR3_2    : 1;    ///< Receiver channel 3 Conversion mode 2
      _BITS   RXCR3_3    : 1;    ///< Receiver channel 3 Conversion mode 3
      _BITS   RXCR3_4    : 1;    ///< Receiver channel 3 Conversion mode 4
      _BITS   RXCR3_5    : 1;    ///< Receiver channel 3 Conversion mode 5
      _BITS   RXCR3_6    : 1;    ///< Receiver channel 3 Conversion mode 6
      _BITS   RXCR3_7    : 1;    ///< Receiver channel 3 Conversion mode 7
    } RXCR3L;

    /** @brief Reserved register (2B) */
    uint8_t res3    [2];

    /** @brief ProxSense Receiver Inactive State Register high byte (PXS_RXINSRH) */
    struct {
      _BITS   RXINS8     : 1;    ///< Receiver channel 8 inactive state selection
      _BITS   RXINS9     : 1;    ///< Receiver channel 9 inactive state selection
      _BITS              : 6;    //   Reserved
    } RXINSRH;

    /** @brief ProxSense Receiver Inactive State Register low byte (PXS_RXINSRL) */
    struct {
      _BITS   RXINS0     : 1;    ///< Receiver channel 0 inactive state selection
      _BITS   RXINS1     : 1;    ///< Receiver channel 1 inactive state selection
      _BITS   RXINS2     : 1;    ///< Receiver channel 2 inactive state selection
      _BITS   RXINS3     : 1;    ///< Receiver channel 3 inactive state selection
      _BITS   RXINS4     : 1;    ///< Receiver channel 4 inactive state selection
      _BITS   RXINS5     : 1;    ///< Receiver channel 5 inactive state selection
      _BITS   RXINS6     : 1;    ///< Receiver channel 6 inactive state selection
      _BITS   RXINS7     : 1;    ///< Receiver channel 7 inactive state selection
    } RXINSRL;

    /** @brief Reserved register (2B) */
    uint8_t res4    [2];

    /** @brief ProxSense Transmit Enable Register high byte (PXS_TXENRH) */
    struct {
      _BITS   TXEN8      : 1;    ///< Transmit output 8 function enable
      _BITS   TXEN9      : 1;    ///< Transmit output 9 function enable
      _BITS   TXEN10     : 1;    ///< Transmit output 10 function enable
      _BITS   TXEN11     : 1;    ///< Transmit output 11 function enable
      _BITS   TXEN12     : 1;    ///< Transmit output 12 function enable
      _BITS   TXEN13     : 1;    ///< Transmit output 13 function enable
      _BITS   TXEN14     : 1;    ///< Transmit output 14 function enable
      _BITS   TXEN15     : 1;    ///< Transmit output 15 function enable
    } TXENRH;

    /** @brief ProxSense Transmit Enable Register low byte (PXS_TXENRL) */
    struct {
      _BITS   TXEN0      : 1;    ///< Transmit output 0 function enable
      _BITS   TXEN1      : 1;    ///< Transmit output 1 function enable
      _BITS   TXEN2      : 1;    ///< Transmit output 2 function enable
      _BITS   TXEN3      : 1;    ///< Transmit output 3 function enable
      _BITS   TXEN4      : 1;    ///< Transmit output 4 function enable
      _BITS   TXEN5      : 1;    ///< Transmit output 5 function enable
      _BITS   TXEN6      : 1;    ///< Transmit output 6 function enable
      _BITS   TXEN7      : 1;    ///< Transmit output 7 function enable
    } TXENRL;

