STM8-SPL-license/discussion/Header/STM8TL5x.h
    /** @brief Reserved register (2B) */
    uint8_t res5    [2];

    /** @brief ProxSense Maximum Counter Value Register high byte (PXS_MAXRH) */
    struct {
      _BITS   MAX        : 8;    ///< maximum allowed value for conversion data [15:8]
    } MAXRH;

    /** @brief ProxSense Maximum Counter Value Register low byte (PXS_MAXRL) */
    struct {
      _BITS   MAX        : 8;    ///< maximum allowed value for conversion data [7:0]
    } MAXRL;

    /** @brief ProxSense Maximum Counter Enable Register high byte (PXS_MAXENRH) */
    struct {
      _BITS   MAXEN8     : 1;    ///< enabled counter limit for Receive channel 8
      _BITS   MAXEN9     : 1;    ///< enabled counter limit for Receive channel 9
      _BITS              : 6;    //   Reserved
    } MAXENRH;

    /** @brief ProxSense Maximum Counter Enable Register low byte (PXS_MAXENRL) */
    struct {
      _BITS   MAXEN0     : 1;    ///< enabled counter limit for Receive channel 0
      _BITS   MAXEN1     : 1;    ///< enabled counter limit for Receive channel 1
      _BITS   MAXEN2     : 1;    ///< enabled counter limit for Receive channel 2
      _BITS   MAXEN3     : 1;    ///< enabled counter limit for Receive channel 3
      _BITS   MAXEN4     : 1;    ///< enabled counter limit for Receive channel 4
      _BITS   MAXEN5     : 1;    ///< enabled counter limit for Receive channel 5
      _BITS   MAXEN6     : 1;    ///< enabled counter limit for Receive channel 6
      _BITS   MAXEN7     : 1;    ///< enabled counter limit for Receive channel 7
    } MAXENRL;

    /** @brief ProxSense Receiver Status Register high byte (PXS_RXSRH) */
    struct {
      _BITS   VALID8     : 1;    ///< Valid bit for conversion data for receiver channel 8 is valid
      _BITS   VALID9     : 1;    ///< Valid bit for conversion data for receiver channel 9 is valid
      _BITS              : 6;    //   Reserved
    } RXSRH;

    /** @brief ProxSense Receiver Status Register low byte (PXS_RXSRL) */
    struct {
      _BITS   VALID0     : 1;    ///< Valid bit for conversion data for receiver channel 0 is valid
      _BITS   VALID1     : 1;    ///< Valid bit for conversion data for receiver channel 1 is valid
      _BITS   VALID2     : 1;    ///< Valid bit for conversion data for receiver channel 2 is valid
      _BITS   VALID3     : 1;    ///< Valid bit for conversion data for receiver channel 3 is valid
      _BITS   VALID4     : 1;    ///< Valid bit for conversion data for receiver channel 4 is valid
      _BITS   VALID5     : 1;    ///< Valid bit for conversion data for receiver channel 5 is valid
      _BITS   VALID6     : 1;    ///< Valid bit for conversion data for receiver channel 6 is valid
      _BITS   VALID7     : 1;    ///< Valid bit for conversion data for receiver channel 7 is valid
    } RXSRL;

    /** @brief ProxSense Counter Register of Receiver Channel 0 high byte (PXS_RX0CNTRH) */
    struct {
      _BITS   RX0CNT     : 8;    ///< measurement value Receiver Channel 0 [15:8]
    } RX0CNTRH;

    /** @brief ProxSense Counter Register of Receiver Channel 0 low byte (PXS_RX0CNTRL) */
    struct {
      _BITS   RX0CNT     : 8;    ///< measurement value Receiver Channel 0 [7:0]
    } RX0CNTRL;

    /** @brief ProxSense Counter Register of Receiver Channel 1 high byte (PXS_RX1CNTRH) */
    struct {
      _BITS   RX1CNT     : 8;    ///< measurement value Receiver Channel 1 [15:8]
    } RX1CNTRH;

    /** @brief ProxSense Counter Register of Receiver Channel 1 low byte (PXS_RX1CNTRL) */
    struct {
      _BITS   RX1CNT     : 8;    ///< measurement value Receiver Channel 1 [7:0]
    } RX1CNTRL;

    /** @brief ProxSense Counter Register of Receiver Channel 2 high byte (PXS_RX2CNTRH) */
    struct {
      _BITS   RX2CNT     : 8;    ///< measurement value Receiver Channel 2 [15:8]
    } RX2CNTRH;

    /** @brief ProxSense Counter Register of Receiver Channel 2 low byte (PXS_RX2CNTRL) */
    struct {
      _BITS   RX2CNT     : 8;    ///< measurement value Receiver Channel 2 [7:0]
    } RX2CNTRL;

    /** @brief ProxSense Counter Register of Receiver Channel 3 high byte (PXS_RX3CNTRH) */
    struct {
      _BITS   RX3CNT     : 8;    ///< measurement value Receiver Channel 3 [15:8]
    } RX3CNTRH;

    /** @brief ProxSense Counter Register of Receiver Channel 3 low byte (PXS_RX3CNTRL) */
    struct {
      _BITS   RX3CNT     : 8;    ///< measurement value Receiver Channel 3 [7:0]
    } RX3CNTRL;

    /** @brief ProxSense Counter Register of Receiver Channel 4 high byte (PXS_RX4CNTRH) */
    struct {
      _BITS   RX4CNT     : 8;    ///< measurement value Receiver Channel 4 [15:8]
    } RX4CNTRH;

    /** @brief ProxSense Counter Register of Receiver Channel 4 low byte (PXS_RX4CNTRL) */
    struct {
      _BITS   RX4CNT     : 8;    ///< measurement value Receiver Channel 4 [7:0]
    } RX4CNTRL;

    /** @brief ProxSense Counter Register of Receiver Channel 5 high byte (PXS_RX5CNTRH) */
    struct {
      _BITS   RX5CNT     : 8;    ///< measurement value Receiver Channel 5 [15:8]
    } RX5CNTRH;

    /** @brief ProxSense Counter Register of Receiver Channel 5 low byte (PXS_RX5CNTRL) */
    struct {
      _BITS   RX5CNT     : 8;    ///< measurement value Receiver Channel 5 [7:0]
    } RX5CNTRL;

    /** @brief ProxSense Counter Register of Receiver Channel 6 high byte (PXS_RX6CNTRH) */
    struct {
      _BITS   RX6CNT     : 8;    ///< measurement value Receiver Channel 6 [15:8]
    } RX6CNTRH;

    /** @brief ProxSense Counter Register of Receiver Channel 6 low byte (PXS_RX6CNTRL) */
    struct {
      _BITS   RX6CNT     : 8;    ///< measurement value Receiver Channel 6 [7:0]
    } RX6CNTRL;

    /** @brief ProxSense Counter Register of Receiver Channel 7 high byte (PXS_RX7CNTRH) */
    struct {
      _BITS   RX7CNT     : 8;    ///< measurement value Receiver Channel 7 [15:8]
    } RX7CNTRH;

    /** @brief ProxSense Counter Register of Receiver Channel 7 low byte (PXS_RX7CNTRL) */
    struct {
      _BITS   RX7CNT     : 8;    ///< measurement value Receiver Channel 7 [7:0]
    } RX7CNTRL;

