STM8-SPL-license/discussion/Header/STM8TL5x.h
    /** @brief ProxSense Counter Register of Receiver Channel 8 high byte (PXS_RX8CNTRH) */
    struct {
      _BITS   RX8CNT     : 8;    ///< measurement value Receiver Channel 8 [15:8]
    } RX8CNTRH;

    /** @brief ProxSense Counter Register of Receiver Channel 8 low byte (PXS_RX8CNTRL) */
    struct {
      _BITS   RX8CNT     : 8;    ///< measurement value Receiver Channel 8 [7:0]
    } RX8CNTRL;

    /** @brief ProxSense Counter Register of Receiver Channel 9 high byte (PXS_RX9CNTRH) */
    struct {
      _BITS   RX9CNT     : 8;    ///< measurement value Receiver Channel 9 [15:8]
    } RX9CNTRH;

    /** @brief ProxSense Counter Register of Receiver Channel 9 low byte (PXS_RX9CNTRL) */
    struct {
      _BITS   RX9CNT     : 8;    ///< measurement value Receiver Channel 9 [7:0]
    } RX9CNTRL;

    /** @brief Reserved register (12B) */
    uint8_t res6    [12];

    /** @brief ProxSense Receiver Sampling Capacitor Selection for Channel 0 (PXS_RX0CSSELR) */
    struct {
      _BITS   RX0CSSEL   : 5;    ///< Sampling capacitor size of Receiver Channel 0 [4:0]
      _BITS              : 3;    //   Reserved
    } RX0CSSELR;

    /** @brief ProxSense Receiver Sampling Capacitor Selection for Channel 1 (PXS_RX1CSSELR) */
    struct {
      _BITS   RX1CSSEL   : 5;    ///< Sampling capacitor size of Receiver Channel 1 [4:0]
      _BITS              : 3;    //   Reserved
    } RX1CSSELR;

    /** @brief ProxSense Receiver Sampling Capacitor Selection for Channel 2 (PXS_RX2CSSELR) */
    struct {
      _BITS   RX2CSSEL   : 5;    ///< Sampling capacitor size of Receiver Channel 2 [4:0]
      _BITS              : 3;    //   Reserved
    } RX2CSSELR;

    /** @brief ProxSense Receiver Sampling Capacitor Selection for Channel 3 (PXS_RX3CSSELR) */
    struct {
      _BITS   RX3CSSEL   : 5;    ///< Sampling capacitor size of Receiver Channel 3 [4:0]
      _BITS              : 3;    //   Reserved
    } RX3CSSELR;

    /** @brief ProxSense Receiver Sampling Capacitor Selection for Channel 4 (PXS_RX4CSSELR) */
    struct {
      _BITS   RX4CSSEL   : 5;    ///< Sampling capacitor size of Receiver Channel 4 [4:0]
      _BITS              : 3;    //   Reserved
    } RX4CSSELR;

    /** @brief ProxSense Receiver Sampling Capacitor Selection for Channel 5 (PXS_RX5CSSELR) */
    struct {
      _BITS   RX5CSSEL   : 5;    ///< Sampling capacitor size of Receiver Channel 5 [4:0]
      _BITS              : 3;    //   Reserved
    } RX5CSSELR;

    /** @brief ProxSense Receiver Sampling Capacitor Selection for Channel 6 (PXS_RX6CSSELR) */
    struct {
      _BITS   RX6CSSEL   : 5;    ///< Sampling capacitor size of Receiver Channel 6 [4:0]
      _BITS              : 3;    //   Reserved
    } RX6CSSELR;

    /** @brief ProxSense Receiver Sampling Capacitor Selection for Channel 7 (PXS_RX7CSSELR) */
    struct {
      _BITS   RX7CSSEL   : 5;    ///< Sampling capacitor size of Receiver Channel 7 [4:0]
      _BITS              : 3;    //   Reserved
    } RX7CSSELR;

    /** @brief ProxSense Receiver Sampling Capacitor Selection for Channel 8 (PXS_RX8CSSELR) */
    struct {
      _BITS   RX8CSSEL   : 5;    ///< Sampling capacitor size of Receiver Channel 8 [4:0]
      _BITS              : 3;    //   Reserved
    } RX8CSSELR;

    /** @brief ProxSense Receiver Sampling Capacitor Selection for Channel 9 (PXS_RX9CSSELR) */
    struct {
      _BITS   RX9CSSEL   : 5;    ///< Sampling capacitor size of Receiver Channel 9 [4:0]
      _BITS              : 3;    //   Reserved
    } RX9CSSELR;

    /** @brief Reserved register (6B) */
    uint8_t res7    [6];

    /** @brief ProxSense Compensation Capacitor Selection for Channel 0 (PXS_RX0EPCCSELR) */
    struct {
      _BITS   RX0EPCC    : 8;    ///< Parasitic compensation capacitor of Receiver Channel 0
    } RX0EPCCSELR;

    /** @brief ProxSense Compensation Capacitor Selection for Channel 1 (PXS_RX1EPCCSELR) */
    struct {
      _BITS   RX1EPCC    : 8;    ///< Parasitic compensation capacitor of Receiver Channel 1
    } RX1EPCCSELR;

    /** @brief ProxSense Compensation Capacitor Selection for Channel 2 (PXS_RX2EPCCSELR) */
    struct {
      _BITS   RX2EPCC    : 8;    ///< Parasitic compensation capacitor of Receiver Channel 2
    } RX2EPCCSELR;

    /** @brief ProxSense Compensation Capacitor Selection for Channel 3 (PXS_RX3EPCCSELR) */
    struct {
      _BITS   RX3EPCC    : 8;    ///< Parasitic compensation capacitor of Receiver Channel 3
    } RX3EPCCSELR;

    /** @brief ProxSense Compensation Capacitor Selection for Channel 4 (PXS_RX4EPCCSELR) */
    struct {
      _BITS   RX4EPCC    : 8;    ///< Parasitic compensation capacitor of Receiver Channel 4
    } RX4EPCCSELR;

    /** @brief ProxSense Compensation Capacitor Selection for Channel 5 (PXS_RX5EPCCSELR) */
    struct {
      _BITS   RX5EPCC    : 8;    ///< Parasitic compensation capacitor of Receiver Channel 5
    } RX5EPCCSELR;

    /** @brief ProxSense Compensation Capacitor Selection for Channel 6 (PXS_RX6EPCCSELR) */
    struct {
      _BITS   RX6EPCC    : 8;    ///< Parasitic compensation capacitor of Receiver Channel 6
    } RX6EPCCSELR;

    /** @brief ProxSense Compensation Capacitor Selection for Channel 7 (PXS_RX7EPCCSELR) */
    struct {
      _BITS   RX7EPCC    : 8;    ///< Parasitic compensation capacitor of Receiver Channel 7
    } RX7EPCCSELR;

    /** @brief ProxSense Compensation Capacitor Selection for Channel 8 (PXS_RX8EPCCSELR) */
    struct {
      _BITS   RX8EPCC    : 8;    ///< Parasitic compensation capacitor of Receiver Channel 8
    } RX8EPCCSELR;

    /** @brief ProxSense Compensation Capacitor Selection for Channel 9 (PXS_RX9EPCCSELR) */
    struct {
      _BITS   RX9EPCC    : 8;    ///< Parasitic compensation capacitor of Receiver Channel 9
    } RX9EPCCSELR;

  } PXS_t;

  /* Pointer to PXS registers */
  #define _PXS          _SFR(PXS_t,    PXS_AddressBase)          ///< ProxSense struct/bit access
  #define _PXS_CR1      _SFR(uint8_t,  PXS_AddressBase+0x00)     ///< ProxSense Control Register 1
  #define _PXS_CR2      _SFR(uint8_t,  PXS_AddressBase+0x01)     ///< ProxSense Control Register 2
  #define _PXS_CR3      _SFR(uint8_t,  PXS_AddressBase+0x02)     ///< ProxSense Control Register 3
  // reserved (1B)
  #define _PXS_ISR      _SFR(uint8_t,  PXS_AddressBase+0x04)     ///< ProxSense Interrupt and Status Register
  // reserved (1B)
  #define _PXS_CKCR1    _SFR(uint8_t,  PXS_AddressBase+0x06)     ///< ProxSense Clock Control Register 1
  #define _PXS_CKCR2    _SFR(uint8_t,  PXS_AddressBase+0x07)     ///< ProxSense Clock Control Register 2
  #define _PXS_RXENRH   _SFR(uint8_t,  PXS_AddressBase+0x08)     ///< ProxSense Receiver Enable Register high byte
  #define _PXS_RXENRL   _SFR(uint8_t,  PXS_AddressBase+0x09)     ///< ProxSense Receiver Enable Register low byte
  #define _PXS_RXCR1H   _SFR(uint8_t,  PXS_AddressBase+0x0A)     ///< ProxSense Receiver Control Register 1 high byte
  #define _PXS_RXCR1L   _SFR(uint8_t,  PXS_AddressBase+0x0B)     ///< ProxSense Receiver Control Register 1 low byte
  #define _PXS_RXCR2H   _SFR(uint8_t,  PXS_AddressBase+0x0C)     ///< ProxSense Receiver Control Register 2 high byte
  #define _PXS_RXCR2L   _SFR(uint8_t,  PXS_AddressBase+0x0D)     ///< ProxSense Receiver Control Register 2 low byte
  #define _PXS_RXCR3H   _SFR(uint8_t,  PXS_AddressBase+0x0E)     ///< ProxSense Receiver Control Register 3 high byte
  #define _PXS_RXCR3L   _SFR(uint8_t,  PXS_AddressBase+0x0F)     ///< ProxSense Receiver Control Register 3 low byte
  // reserved (2B)
  #define _PXS_RXINSRH  _SFR(uint8_t,  PXS_AddressBase+0x12)     ///< ProxSense Receiver Inactive State Register high byte
  #define _PXS_RXINSRL  _SFR(uint8_t,  PXS_AddressBase+0x13)     ///< ProxSense Receiver Inactive State Register low byte
  // reserved (2B)
  #define _PXS_TXENRH   _SFR(uint8_t,  PXS_AddressBase+0x16)     ///< ProxSense Transmit Enable Register high byte
  #define _PXS_TXENRL   _SFR(uint8_t,  PXS_AddressBase+0x17)     ///< ProxSense Transmit Enable Register low byte
  // reserved (2B)
  #define _PXS_MAXRH    _SFR(uint8_t,  PXS_AddressBase+0x1A)     ///< ProxSense Maximum Counter Value Register high byte
  #define _PXS_MAXRL    _SFR(uint8_t,  PXS_AddressBase+0x1B)     ///< ProxSense Maximum Counter Value Register low byte
  #define _PXS_MAXENRH  _SFR(uint8_t,  PXS_AddressBase+0x1C)     ///< ProxSense Maximum Counter Enable Register high byte
  #define _PXS_MAXENRL  _SFR(uint8_t,  PXS_AddressBase+0x1D)     ///< ProxSense Maximum Counter Enable Register low byte
  #define _PXS_RXSRH    _SFR(uint8_t,  PXS_AddressBase+0x1E)     ///< ProxSense Receiver Status Register high byte
  #define _PXS_RXSRL    _SFR(uint8_t,  PXS_AddressBase+0x1F)     ///< ProxSense Receiver Status Register low byte
  #define _PXS_RX0CNTRH _SFR(uint8_t,  PXS_AddressBase+0x20)     ///< Counter Register of Receiver Channel 0 high byte
  #define _PXS_RX0CNTRL _SFR(uint8_t,  PXS_AddressBase+0x21)     ///< Counter Register of Receiver Channel 0 low byte
  #define _PXS_RX1CNTRH _SFR(uint8_t,  PXS_AddressBase+0x22)     ///< Counter Register of Receiver Channel 1 high byte
  #define _PXS_RX1CNTRL _SFR(uint8_t,  PXS_AddressBase+0x23)     ///< Counter Register of Receiver Channel 1 low byte
  #define _PXS_RX2CNTRH _SFR(uint8_t,  PXS_AddressBase+0x24)     ///< Counter Register of Receiver Channel 2 high byte
  #define _PXS_RX2CNTRL _SFR(uint8_t,  PXS_AddressBase+0x25)     ///< Counter Register of Receiver Channel 2 low byte
  #define _PXS_RX3CNTRH _SFR(uint8_t,  PXS_AddressBase+0x26)     ///< Counter Register of Receiver Channel 3 high byte
  #define _PXS_RX3CNTRL _SFR(uint8_t,  PXS_AddressBase+0x27)     ///< Counter Register of Receiver Channel 3 low byte
  #define _PXS_RX4CNTRH _SFR(uint8_t,  PXS_AddressBase+0x28)     ///< Counter Register of Receiver Channel 4 high byte
  #define _PXS_RX4CNTRL _SFR(uint8_t,  PXS_AddressBase+0x29)     ///< Counter Register of Receiver Channel 4 low byte
  #define _PXS_RX5CNTRH _SFR(uint8_t,  PXS_AddressBase+0x2A)     ///< Counter Register of Receiver Channel 5 high byte
  #define _PXS_RX5CNTRL _SFR(uint8_t,  PXS_AddressBase+0x2B)     ///< Counter Register of Receiver Channel 5 low byte
  #define _PXS_RX6CNTRH _SFR(uint8_t,  PXS_AddressBase+0x2C)     ///< Counter Register of Receiver Channel 6 high byte
  #define _PXS_RX6CNTRL _SFR(uint8_t,  PXS_AddressBase+0x2D)     ///< Counter Register of Receiver Channel 6 low byte
  #define _PXS_RX7CNTRH _SFR(uint8_t,  PXS_AddressBase+0x2E)     ///< Counter Register of Receiver Channel 7 high byte
  #define _PXS_RX7CNTRL _SFR(uint8_t,  PXS_AddressBase+0x2F)     ///< Counter Register of Receiver Channel 7 low byte
  #define _PXS_RX8CNTRH _SFR(uint8_t,  PXS_AddressBase+0x30)     ///< Counter Register of Receiver Channel 8 high byte
  #define _PXS_RX8CNTRL _SFR(uint8_t,  PXS_AddressBase+0x31)     ///< Counter Register of Receiver Channel 8 low byte
  #define _PXS_RX9CNTRH _SFR(uint8_t,  PXS_AddressBase+0x32)     ///< Counter Register of Receiver Channel 9 high byte
  #define _PXS_RX9CNTRL _SFR(uint8_t,  PXS_AddressBase+0x33)     ///< Counter Register of Receiver Channel 9 low byte
  // reserved (12B)
  #define _PXS_RX0CSSELR _SFR(uint8_t,  PXS_AddressBase+0x40)     ///< ProxSense Receiver Sampling Capacitor Selection for Channel 0
  #define _PXS_RX1CSSELR _SFR(uint8_t,  PXS_AddressBase+0x41)     ///< ProxSense Receiver Sampling Capacitor Selection for Channel 1
  #define _PXS_RX2CSSELR _SFR(uint8_t,  PXS_AddressBase+0x42)     ///< ProxSense Receiver Sampling Capacitor Selection for Channel 2
  #define _PXS_RX3CSSELR _SFR(uint8_t,  PXS_AddressBase+0x43)     ///< ProxSense Receiver Sampling Capacitor Selection for Channel 3
  #define _PXS_RX4CSSELR _SFR(uint8_t,  PXS_AddressBase+0x44)     ///< ProxSense Receiver Sampling Capacitor Selection for Channel 4
  #define _PXS_RX5CSSELR _SFR(uint8_t,  PXS_AddressBase+0x45)     ///< ProxSense Receiver Sampling Capacitor Selection for Channel 5
  #define _PXS_RX6CSSELR _SFR(uint8_t,  PXS_AddressBase+0x46)     ///< ProxSense Receiver Sampling Capacitor Selection for Channel 6
  #define _PXS_RX7CSSELR _SFR(uint8_t,  PXS_AddressBase+0x47)     ///< ProxSense Receiver Sampling Capacitor Selection for Channel 7
  #define _PXS_RX8CSSELR _SFR(uint8_t,  PXS_AddressBase+0x48)     ///< ProxSense Receiver Sampling Capacitor Selection for Channel 8
  #define _PXS_RX9CSSELR _SFR(uint8_t,  PXS_AddressBase+0x49)     ///< ProxSense Receiver Sampling Capacitor Selection for Channel 9
  // reserved (6B)
  #define _PXS_RX0EPCCSELR _SFR(uint8_t,  PXS_AddressBase+0x50)     ///< ProxSense Compensation Capacitor Selection for Channel 0
  #define _PXS_RX1EPCCSELR _SFR(uint8_t,  PXS_AddressBase+0x51)     ///< ProxSense Compensation Capacitor Selection for Channel 1
  #define _PXS_RX2EPCCSELR _SFR(uint8_t,  PXS_AddressBase+0x52)     ///< ProxSense Compensation Capacitor Selection for Channel 2
  #define _PXS_RX3EPCCSELR _SFR(uint8_t,  PXS_AddressBase+0x53)     ///< ProxSense Compensation Capacitor Selection for Channel 3
  #define _PXS_RX4EPCCSELR _SFR(uint8_t,  PXS_AddressBase+0x54)     ///< ProxSense Compensation Capacitor Selection for Channel 4
  #define _PXS_RX5EPCCSELR _SFR(uint8_t,  PXS_AddressBase+0x55)     ///< ProxSense Compensation Capacitor Selection for Channel 5
  #define _PXS_RX6EPCCSELR _SFR(uint8_t,  PXS_AddressBase+0x56)     ///< ProxSense Compensation Capacitor Selection for Channel 6
  #define _PXS_RX7EPCCSELR _SFR(uint8_t,  PXS_AddressBase+0x57)     ///< ProxSense Compensation Capacitor Selection for Channel 7
  #define _PXS_RX8EPCCSELR _SFR(uint8_t,  PXS_AddressBase+0x58)     ///< ProxSense Compensation Capacitor Selection for Channel 8
  #define _PXS_RX9EPCCSELR _SFR(uint8_t,  PXS_AddressBase+0x59)     ///< ProxSense Compensation Capacitor Selection for Channel 9

