STM8-SPL-license/discussion/Header/STM8TL5x.h
  /* PXS Module Reset Values */
  #define _PXS_CR1_RESET_VALUE         ((uint8_t)0x00)           ///< ProxSense Control Register 1 reset value
  #define _PXS_CR2_RESET_VALUE         ((uint8_t)0x00)           ///< ProxSense Control Register 2 reset value
  #define _PXS_CR3_RESET_VALUE         ((uint8_t)0x00)           ///< ProxSense Control Register 3 reset value
  #define _PXS_ISR_RESET_VALUE         ((uint8_t)0x00)           ///< ProxSense Interrupt and Status Register reset value
  #define _PXS_CKCR1_RESET_VALUE       ((uint8_t)0x30)           ///< ProxSense Clock Control Register 1 reset value
  #define _PXS_CKCR2_RESET_VALUE       ((uint8_t)0x11)           ///< ProxSense Clock Control Register 2 reset value
  #define _PXS_RXENRH_RESET_VALUE      ((uint8_t)0x00)           ///< ProxSense Receiver Enable Register high byte reset value
  #define _PXS_RXENRL_RESET_VALUE      ((uint8_t)0x00)           ///< ProxSense Receiver Enable Register low byte reset value
  #define _PXS_RXCR1H_RESET_VALUE      ((uint8_t)0x00)           ///< ProxSense Receiver Control Register 1 high byte reset value
  #define _PXS_RXCR1L_RESET_VALUE      ((uint8_t)0x00)           ///< ProxSense Receiver Control Register 1 low byte reset value
  #define _PXS_RXCR2H_RESET_VALUE      ((uint8_t)0x00)           ///< ProxSense Receiver Control Register 2 high byte reset value
  #define _PXS_RXCR2L_RESET_VALUE      ((uint8_t)0x00)           ///< ProxSense Receiver Control Register 2 low byte reset value
  #define _PXS_RXCR3H_RESET_VALUE      ((uint8_t)0x00)           ///< ProxSense Receiver Control Register 3 high byte reset value
  #define _PXS_RXCR3L_RESET_VALUE      ((uint8_t)0x00)           ///< ProxSense Receiver Control Register 3 low byte reset value
  #define _PXS_RXINSRH_RESET_VALUE     ((uint8_t)0x00)           ///< ProxSense Receiver Inactive State Register high byte reset value
  #define _PXS_RXINSRL_RESET_VALUE     ((uint8_t)0x00)           ///< ProxSense Receiver Inactive State Register low byte reset value
  #define _PXS_TXENRH_RESET_VALUE      ((uint8_t)0x00)           ///< ProxSense Transmit Enable Register high byte reset value
  #define _PXS_TXENRL_RESET_VALUE      ((uint8_t)0x00)           ///< ProxSense Transmit Enable Register low byte reset value
  #define _PXS_MAXRH_RESET_VALUE       ((uint8_t)0xFF)           ///< ProxSense Maximum Counter Value Register high byte reset value
  #define _PXS_MAXRL_RESET_VALUE       ((uint8_t)0xFF)           ///< ProxSense Maximum Counter Value Register low byte reset value
  #define _PXS_MAXENRH_RESET_VALUE     ((uint8_t)0x00)           ///< ProxSense Maximum Counter Enable Register high byte reset value
  #define _PXS_MAXENRL_RESET_VALUE     ((uint8_t)0x00)           ///< ProxSense Maximum Counter Enable Register low byte reset value
  #define _PXS_RXSRH_RESET_VALUE       ((uint8_t)0x00)           ///< ProxSense Receiver Status Register high byte reset value
  #define _PXS_RXSRL_RESET_VALUE       ((uint8_t)0x00)           ///< ProxSense Receiver Status Register low byte reset value
  #define _PXS_RXNCNTRH_RESET_VALUE    ((uint8_t)0x00)           ///< Counter Register of Receiver Channel n (0..9) high byte reset value
  #define _PXS_RXNCNTRL_RESET_VALUE    ((uint8_t)0x00)           ///< Counter Register of Receiver Channel n (0..9) low byte reset value
  #define _PXS_RXNCSSELR_RESET_VALUE   ((uint8_t)0x00)           ///< ProxSense Receiver Sampling Capacitor Selection for Channel n (0..9) reset value
  #define _PXS_RXNEPCCSELR_RESET_VALUE ((uint8_t)0x00)           ///< ProxSense Compensation Capacitor Selection for Channel n (0..9) reset value

  /* ProxSense Control Register 1 (PXS_CR1) */
  // reserved [4:0]
  #define _PXS_LOW_POWER        ((uint8_t) (0x01 << 5))        ///< ProxSense Low power mode [0] (in _PXS_CR1)
  #define _PXS_START            ((uint8_t) (0x01 << 6))        ///< ProxSense Start conversion [0] (in _PXS_CR1)
  #define _PXS_PXSEN            ((uint8_t) (0x01 << 7))        ///< ProxSense enable [0] (in _PXS_CR1)

  /* ProxSense Control Register 2 (PXS_CR2) */
  #define _PXS_SYNCEDGE         ((uint8_t) (0x01 << 0))        ///< ProxSense Synchronization edge selection [0] (in_PXS_CR2)
  #define _PXS_SYNCEN           ((uint8_t) (0x01 << 1))        ///< ProxSense Enable synchronization (SYNC) feature [0] (in_PXS_CR2)
  #define _PXS_RXCOUPLING       ((uint8_t) (0x01 << 2))        ///< ProxSense Reduce coupling between receiver lines [0] (in_PXS_CR2)
  #define _PXS_RXGROUP          ((uint8_t) (0x01 << 3))        ///< ProxSense Rx group selection [0] (in_PXS_CR2)
  // reserved [4]
  #define _PXS_NOISEDETEN       ((uint8_t) (0x01 << 5))        ///< ProxSense Noise detection enable [0] (in_PXS_CR2)
  #define _PXS_FCCITEN          ((uint8_t) (0x01 << 6))        ///< ProxSense First conversion completion interrupt enable [0] (in_PXS_CR2)
  #define _PXS_EOCITEN          ((uint8_t) (0x01 << 7))        ///< ProxSense End of conversion interrupt enable [0] (in_PXS_CR2)

  /* ProxSense Control Register 3 (PXS_CR3) */
  #define _PXS_VTHR             ((uint8_t) (0x0F << 0))        ///< ProxSense Threshold voltage (Vthr) selection [3:0] (in_PXS_CR3)
  #define _PXS_VTHR0            ((uint8_t) (0x01 << 0))        ///< ProxSense Threshold voltage (Vthr) selection [0] (in_PXS_CR3)
  #define _PXS_VTHR1            ((uint8_t) (0x01 << 0))        ///< ProxSense Threshold voltage (Vthr) selection [1] (in_PXS_CR3)
  #define _PXS_VTHR2            ((uint8_t) (0x01 << 0))        ///< ProxSense Threshold voltage (Vthr) selection [2] (in_PXS_CR3)
  #define _PXS_VTHR3            ((uint8_t) (0x01 << 0))        ///< ProxSense Threshold voltage (Vthr) selection [3] (in_PXS_CR3)
  #define _PXS_BIAS             ((uint8_t) (0x03 << 4))        ///< ProxSense Sample and hold strength selection [1:0] (in_PXS_CR3)
  #define _PXS_BIAS0            ((uint8_t) (0x01 << 4))        ///< ProxSense Sample and hold strength selection [0] (in_PXS_CR3)
  #define _PXS_BIAS1            ((uint8_t) (0x01 << 5))        ///< ProxSense Sample and hold strength selection [1] (in_PXS_CR3)
  #define _PXS_STAB             ((uint8_t) (0x03 << 6))        ///< ProxSense Selection for stabilization time after ProxSense power-on [1:0] (in_PXS_CR3)
  #define _PXS_STAB0            ((uint8_t) (0x01 << 6))        ///< ProxSense Selection for stabilization time after ProxSense power-on [0] (in_PXS_CR3)
  #define _PXS_STAB1            ((uint8_t) (0x01 << 7))        ///< ProxSense Selection for stabilization time after ProxSense power-on [1] (in_PXS_CR3)

  /* ProxSense Interrupt and Status Register (PXS_ISR) */
  // reserved [1:0]
  #define _PXS_SYNC_OVRF        ((uint8_t) (0x01 << 2))        ///< ProxSense Synchronization (SYNC) overflow flag [0] (in _PXS_ISR)
  #define _PXS_SYNCPF           ((uint8_t) (0x01 << 3))        ///< ProxSense Synchronization (SYNC) pending flag [0] (in _PXS_ISR)
  #define _PXS_CIPF             ((uint8_t) (0x01 << 4))        ///< ProxSense Conversion in progress flag [0] (in _PXS_ISR)
  #define _PXS_NOISEDETF        ((uint8_t) (0x01 << 5))        ///< ProxSense Noise detection flag [0] (in _PXS_ISR)
  #define _PXS_FCCF             ((uint8_t) (0x01 << 6))        ///< ProxSense First conversion completion flag [0] (in _PXS_ISR)
  #define _PXS_EOCF             ((uint8_t) (0x01 << 7))        ///< ProxSense End of conversion flag [0] (in _PXS_ISR)

  /* ProxSense Clock Control Register 1 (PXS_CKCR1) */
  #define _PXS_INCPHASE         ((uint8_t) (0x01 << 0))        ///< ProxSense Increase length of UP and PASS by 1/2 clock cycle [0] (in _PXS_CKCR1)
  #define _PXS_ANADEAD          ((uint8_t) (0x01 << 1))        ///< ProxSense ensure UP-PASS deadtime using analog delay [0] (in _PXS_CKCR1)
  // reserved [3:2]
  #define _PXS_PRESC            ((uint8_t) (0x07 << 4))        ///< ProxSense Conversion in progress flag [2:0] (in _PXS_CKCR1)
  #define _PXS_PRESC0           ((uint8_t) (0x01 << 4))        ///< ProxSense Conversion in progress flag [0] (in _PXS_CKCR1)
  #define _PXS_PRESC1           ((uint8_t) (0x01 << 5))        ///< ProxSense Conversion in progress flag [1] (in _PXS_CKCR1)
  #define _PXS_PRESC2           ((uint8_t) (0x01 << 6))        ///< ProxSense Conversion in progress flag [2] (in _PXS_CKCR1)
  // reserved [7]

