STM8-SPL-license/discussion/Header/STM8TL5x.h
  /* ProxSense Clock Control Register 2 (PXS_CKCR2) */
  #define _PXS_PASSLEN          ((uint8_t) (0x07 << 0))        ///< ProxSense Length of PASS phase [2:0] (in _PXS_CKCR2)
  #define _PXS_PASSLEN0         ((uint8_t) (0x01 << 0))        ///< ProxSense Length of PASS phase [0] (in _PXS_CKCR2)
  #define _PXS_PASSLEN1         ((uint8_t) (0x01 << 1))        ///< ProxSense Length of PASS phase [1] (in _PXS_CKCR2)
  #define _PXS_PASSLEN2         ((uint8_t) (0x01 << 2))        ///< ProxSense Length of PASS phase [2] (in _PXS_CKCR2)
  // reserved [3]
  #define _PXS_UPLEN            ((uint8_t) (0x07 << 4))        ///< ProxSense Length of UP phase [2:0] (in _PXS_CKCR2)
  #define _PXS_UPLEN0           ((uint8_t) (0x01 << 4))        ///< ProxSense Length of UP phase [0] (in _PXS_CKCR2)
  #define _PXS_UPLEN1           ((uint8_t) (0x01 << 5))        ///< ProxSense Length of UP phase [1] (in _PXS_CKCR2)
  #define _PXS_UPLEN2           ((uint8_t) (0x01 << 6))        ///< ProxSense Length of UP phase [2] (in _PXS_CKCR2)
  // reserved [7)

  /* ProxSense Receiver Enable Register high byte (PXS_RXENRH) */
  #define _PXS_RXEN8            ((uint8_t) (0x01 << 0))        ///< ProxSense Enable receiver channel 8 [0] (in _PXS_RXENRH)
  #define _PXS_RXEN9            ((uint8_t) (0x01 << 1))        ///< ProxSense Enable receiver channel 9 [0] (in _PXS_RXENRH)
  // reserved [7:2]

  /* ProxSense Receiver Enable Register low byte (PXS_RXENRL) */
  #define _PXS_RXEN0            ((uint8_t) (0x01 << 0))        ///< ProxSense Enable receiver channel 0 [0] (in _PXS_RXENRL)
  #define _PXS_RXEN1            ((uint8_t) (0x01 << 1))        ///< ProxSense Enable receiver channel 1 [0] (in _PXS_RXENRL)
  #define _PXS_RXEN2            ((uint8_t) (0x01 << 2))        ///< ProxSense Enable receiver channel 2 [0] (in _PXS_RXENRL)
  #define _PXS_RXEN3            ((uint8_t) (0x01 << 3))        ///< ProxSense Enable receiver channel 3 [0] (in _PXS_RXENRL)
  #define _PXS_RXEN4            ((uint8_t) (0x01 << 4))        ///< ProxSense Enable receiver channel 4 [0] (in _PXS_RXENRL)
  #define _PXS_RXEN5            ((uint8_t) (0x01 << 5))        ///< ProxSense Enable receiver channel 5 [0] (in _PXS_RXENRL)
  #define _PXS_RXEN6            ((uint8_t) (0x01 << 6))        ///< ProxSense Enable receiver channel 6 [0] (in _PXS_RXENRL)
  #define _PXS_RXEN7            ((uint8_t) (0x01 << 7))        ///< ProxSense Enable receiver channel 7 [0] (in _PXS_RXENRL)

  /* ProxSense Receiver Control Register 1 high byte (PXS_RXCR1H) */
  #define _PXS_RXCR1_8          ((uint8_t) (0x01 << 0))        ///< ProxSense Receiver channel 1 Conversion mode 8 [0] (in _PXS_RXCR1H)
  #define _PXS_RXCR1_9          ((uint8_t) (0x01 << 1))        ///< ProxSense Receiver channel 1 Conversion mode 9 [0] (in _PXS_RXCR1H)
  // reserved [7:2]

  /* ProxSense Receiver Control Register 1 low byte (PXS_RXCR1L) */
  #define _PXS_RXCR1_0          ((uint8_t) (0x01 << 0))        ///< ProxSense Receiver channel 1 Conversion mode 0 [0] (in _PXS_RXCR1L)
  #define _PXS_RXCR1_1          ((uint8_t) (0x01 << 1))        ///< ProxSense Receiver channel 1 Conversion mode 1 [0] (in _PXS_RXCR1L)
  #define _PXS_RXCR1_2          ((uint8_t) (0x01 << 2))        ///< ProxSense Receiver channel 1 Conversion mode 2 [0] (in _PXS_RXCR1L)
  #define _PXS_RXCR1_3          ((uint8_t) (0x01 << 3))        ///< ProxSense Receiver channel 1 Conversion mode 3 [0] (in _PXS_RXCR1L)
  #define _PXS_RXCR1_4          ((uint8_t) (0x01 << 4))        ///< ProxSense Receiver channel 1 Conversion mode 4 [0] (in _PXS_RXCR1L)
  #define _PXS_RXCR1_5          ((uint8_t) (0x01 << 5))        ///< ProxSense Receiver channel 1 Conversion mode 5 [0] (in _PXS_RXCR1L)
  #define _PXS_RXCR1_6          ((uint8_t) (0x01 << 6))        ///< ProxSense Receiver channel 1 Conversion mode 6 [0] (in _PXS_RXCR1L)
  #define _PXS_RXCR1_7          ((uint8_t) (0x01 << 7))        ///< ProxSense Receiver channel 1 Conversion mode 7 [0] (in _PXS_RXCR1L)

  /* ProxSense Receiver Control Register 2 high byte (PXS_RXCR2H) */
  #define _PXS_RXCR2_8          ((uint8_t) (0x01 << 0))        ///< ProxSense Receiver channel 2 Conversion mode 8 [0] (in _PXS_RXCR2H)
  #define _PXS_RXCR2_9          ((uint8_t) (0x01 << 1))        ///< ProxSense Receiver channel 2 Conversion mode 9 [0] (in _PXS_RXCR2H)
  // reserved [7:2]

  /* ProxSense Receiver Control Register 2 low byte (PXS_RXCR2L) */
  #define _PXS_RXCR2_0          ((uint8_t) (0x01 << 0))        ///< ProxSense Receiver channel 2 Conversion mode 0 [0] (in _PXS_RXCR2L)
  #define _PXS_RXCR2_1          ((uint8_t) (0x01 << 1))        ///< ProxSense Receiver channel 2 Conversion mode 1 [0] (in _PXS_RXCR2L)
  #define _PXS_RXCR2_2          ((uint8_t) (0x01 << 2))        ///< ProxSense Receiver channel 2 Conversion mode 2 [0] (in _PXS_RXCR2L)
  #define _PXS_RXCR2_3          ((uint8_t) (0x01 << 3))        ///< ProxSense Receiver channel 2 Conversion mode 3 [0] (in _PXS_RXCR2L)
  #define _PXS_RXCR2_4          ((uint8_t) (0x01 << 4))        ///< ProxSense Receiver channel 2 Conversion mode 4 [0] (in _PXS_RXCR2L)
  #define _PXS_RXCR2_5          ((uint8_t) (0x01 << 5))        ///< ProxSense Receiver channel 2 Conversion mode 5 [0] (in _PXS_RXCR2L)
  #define _PXS_RXCR2_6          ((uint8_t) (0x01 << 6))        ///< ProxSense Receiver channel 2 Conversion mode 6 [0] (in _PXS_RXCR2L)
  #define _PXS_RXCR2_7          ((uint8_t) (0x01 << 7))        ///< ProxSense Receiver channel 2 Conversion mode 7 [0] (in _PXS_RXCR2L)

  /* ProxSense Receiver Control Register 3 high byte (PXS_RXCR3H) */
  #define _PXS_RXCR3_8          ((uint8_t) (0x01 << 0))        ///< ProxSense Receiver channel 3 Conversion mode 8 [0] (in _PXS_RXCR3H)
  #define _PXS_RXCR3_9          ((uint8_t) (0x01 << 1))        ///< ProxSense Receiver channel 3 Conversion mode 9 [0] (in _PXS_RXCR3H)
  // reserved [7:2]

  /* ProxSense Receiver Control Register 3 low byte (PXS_RXCR3L) */
  #define _PXS_RXCR3_0          ((uint8_t) (0x01 << 0))        ///< ProxSense Receiver channel 3 Conversion mode 0 [0] (in _PXS_RXCR3L)
  #define _PXS_RXCR3_1          ((uint8_t) (0x01 << 1))        ///< ProxSense Receiver channel 3 Conversion mode 1 [0] (in _PXS_RXCR3L)
  #define _PXS_RXCR3_2          ((uint8_t) (0x01 << 2))        ///< ProxSense Receiver channel 3 Conversion mode 2 [0] (in _PXS_RXCR3L)
  #define _PXS_RXCR3_3          ((uint8_t) (0x01 << 3))        ///< ProxSense Receiver channel 3 Conversion mode 3 [0] (in _PXS_RXCR3L)
  #define _PXS_RXCR3_4          ((uint8_t) (0x01 << 4))        ///< ProxSense Receiver channel 3 Conversion mode 4 [0] (in _PXS_RXCR3L)
  #define _PXS_RXCR3_5          ((uint8_t) (0x01 << 5))        ///< ProxSense Receiver channel 3 Conversion mode 5 [0] (in _PXS_RXCR3L)
  #define _PXS_RXCR3_6          ((uint8_t) (0x01 << 6))        ///< ProxSense Receiver channel 3 Conversion mode 6 [0] (in _PXS_RXCR3L)
  #define _PXS_RXCR3_7          ((uint8_t) (0x01 << 7))        ///< ProxSense Receiver channel 3 Conversion mode 7 [0] (in _PXS_RXCR3L)

