STM8-SPL-license/discussion/Header/STM8TL5x.h
  /* ProxSense Receiver Inactive State Register high byte (PXS_RXINSRH) */
  #define _PXS_RXINS_8          ((uint8_t) (0x01 << 0))        ///< ProxSense Receiver channel 8 inactive state selection [0] (in _PXS_RXINSRH)
  #define _PXS_RXINS_9          ((uint8_t) (0x01 << 1))        ///< ProxSense Receiver channel 9 inactive state selection [0] (in _PXS_RXINSRH)
  // reserved [7:2]

  /* ProxSense Receiver Inactive State Register low byte (PXS_RXINSRL) */
  #define _PXS_RXINS_0          ((uint8_t) (0x01 << 0))        ///< ProxSense Receiver channel 0 inactive state selection [0] (in _PXS_RXINSRL)
  #define _PXS_RXINS_1          ((uint8_t) (0x01 << 1))        ///< ProxSense Receiver channel 1 inactive state selection [0] (in _PXS_RXINSRL)
  #define _PXS_RXINS_2          ((uint8_t) (0x01 << 2))        ///< ProxSense Receiver channel 2 inactive state selection [0] (in _PXS_RXINSRL)
  #define _PXS_RXINS_3          ((uint8_t) (0x01 << 3))        ///< ProxSense Receiver channel 3 inactive state selection [0] (in _PXS_RXINSRL)
  #define _PXS_RXINS_4          ((uint8_t) (0x01 << 4))        ///< ProxSense Receiver channel 4 inactive state selection [0] (in _PXS_RXINSRL)
  #define _PXS_RXINS_5          ((uint8_t) (0x01 << 5))        ///< ProxSense Receiver channel 5 inactive state selection [0] (in _PXS_RXINSRL)
  #define _PXS_RXINS_6          ((uint8_t) (0x01 << 6))        ///< ProxSense Receiver channel 6 inactive state selection [0] (in _PXS_RXINSRL)
  #define _PXS_RXINS_7          ((uint8_t) (0x01 << 7))        ///< ProxSense Receiver channel 7 inactive state selection [0] (in _PXS_RXINSRL)

  /* ProxSense Transmit Enable Register high byte (PXS_TXENRH) */
  #define _PXS_TXEN8            ((uint8_t) (0x01 << 0))        ///< ProxSense Transmit output 8 function enable [0] (in _PXS_PXS_TXENRH)
  #define _PXS_TXEN9            ((uint8_t) (0x01 << 1))        ///< ProxSense Transmit output 9 function enable [0] (in _PXS_PXS_TXENRH)
  #define _PXS_TXEN10           ((uint8_t) (0x01 << 2))        ///< ProxSense Transmit output 10 function enable [0] (in _PXS_PXS_TXENRH)
  #define _PXS_TXEN11           ((uint8_t) (0x01 << 3))        ///< ProxSense Transmit output 11 function enable [0] (in _PXS_PXS_TXENRH)
  #define _PXS_TXEN12           ((uint8_t) (0x01 << 4))        ///< ProxSense Transmit output 12 function enable [0] (in _PXS_PXS_TXENRH)
  #define _PXS_TXEN13           ((uint8_t) (0x01 << 5))        ///< ProxSense Transmit output 13 function enable [0] (in _PXS_PXS_TXENRH)
  #define _PXS_TXEN14           ((uint8_t) (0x01 << 6))        ///< ProxSense Transmit output 14 function enable [0] (in _PXS_PXS_TXENRH)
  #define _PXS_TXEN15           ((uint8_t) (0x01 << 7))        ///< ProxSense Transmit output 15 function enable [0] (in _PXS_PXS_TXENRH)

  /* ProxSense Transmit Enable Register low byte (PXS_TXENRL) */
  #define _PXS_TXEN0            ((uint8_t) (0x01 << 0))        ///< ProxSense Transmit output 0 function enable [0] (in _PXS_TXENRL)
  #define _PXS_TXEN1            ((uint8_t) (0x01 << 1))        ///< ProxSense Transmit output 1 function enable [0] (in _PXS_TXENRL)
  #define _PXS_TXEN2            ((uint8_t) (0x01 << 2))        ///< ProxSense Transmit output 2 function enable [0] (in _PXS_TXENRL)
  #define _PXS_TXEN3            ((uint8_t) (0x01 << 3))        ///< ProxSense Transmit output 3 function enable [0] (in _PXS_TXENRL)
  #define _PXS_TXEN4            ((uint8_t) (0x01 << 4))        ///< ProxSense Transmit output 4 function enable [0] (in _PXS_TXENRL)
  #define _PXS_TXEN5            ((uint8_t) (0x01 << 5))        ///< ProxSense Transmit output 5 function enable [0] (in _PXS_TXENRL)
  #define _PXS_TXEN6            ((uint8_t) (0x01 << 6))        ///< ProxSense Transmit output 6 function enable [0] (in _PXS_TXENRL)
  #define _PXS_TXEN7            ((uint8_t) (0x01 << 7))        ///< ProxSense Transmit output 7 function enable [0] (in _PXS_TXENRL)

  /* ProxSense Maximum Counter Enable Register high byte (PXS_MAXENRH) */
  #define _PXS_MAXEN8           ((uint8_t) (0x01 << 0))        ///< ProxSense enabled counter limit for Receive channel 8 [0] (in _PXS_MAXENRH)
  #define _PXS_MAXEN9           ((uint8_t) (0x01 << 1))        ///< ProxSense enabled counter limit for Receive channel 9 [0] (in _PXS_MAXENRH)
  // reserved [7:2]

  /* ProxSense Maximum Counter Enable Register low byte (PXS_MAXENRL) */
  #define _PXS_MAXEN0           ((uint8_t) (0x01 << 0))        ///< ProxSense enabled counter limit for Receive channel 0 [0] (in _PXS_MAXENRL)
  #define _PXS_MAXEN1           ((uint8_t) (0x01 << 1))        ///< ProxSense enabled counter limit for Receive channel 1 [0] (in _PXS_MAXENRL)
  #define _PXS_MAXEN2           ((uint8_t) (0x01 << 2))        ///< ProxSense enabled counter limit for Receive channel 2 [0] (in _PXS_MAXENRL)
  #define _PXS_MAXEN3           ((uint8_t) (0x01 << 3))        ///< ProxSense enabled counter limit for Receive channel 3 [0] (in _PXS_MAXENRL)
  #define _PXS_MAXEN4           ((uint8_t) (0x01 << 4))        ///< ProxSense enabled counter limit for Receive channel 4 [0] (in _PXS_MAXENRL)
  #define _PXS_MAXEN5           ((uint8_t) (0x01 << 5))        ///< ProxSense enabled counter limit for Receive channel 5 [0] (in _PXS_MAXENRL)
  #define _PXS_MAXEN6           ((uint8_t) (0x01 << 6))        ///< ProxSense enabled counter limit for Receive channel 6 [0] (in _PXS_MAXENRL)
  #define _PXS_MAXEN7           ((uint8_t) (0x01 << 7))        ///< ProxSense enabled counter limit for Receive channel 7 [0] (in _PXS_MAXENRL)

  /* ProxSense Receiver Status Register high byte (PXS_RXSRH) */
  #define _PXS_VALID8           ((uint8_t) (0x01 << 0))        ///< ProxSense Valid bit for conversion data for receiver channel 8 is valid [0] (in _PXS_RXSRH)
  #define _PXS_VALID9           ((uint8_t) (0x01 << 1))        ///< ProxSense Valid bit for conversion data for receiver channel 9 is valid [0] (in _PXS_RXSRH)
  // reserved [7:2]

  /* ProxSense Receiver Status Register low byte (PXS_RXSRL) */
  #define _PXS_VALID0           ((uint8_t) (0x01 << 0))        ///< ProxSense Valid bit for conversion data for receiver channel 0 is valid [0] (in _PXS_RXSRL)
  #define _PXS_VALID1           ((uint8_t) (0x01 << 1))        ///< ProxSense Valid bit for conversion data for receiver channel 1 is valid [0] (in _PXS_RXSRL)
  #define _PXS_VALID2           ((uint8_t) (0x01 << 2))        ///< ProxSense Valid bit for conversion data for receiver channel 2 is valid [0] (in _PXS_RXSRL)
  #define _PXS_VALID3           ((uint8_t) (0x01 << 3))        ///< ProxSense Valid bit for conversion data for receiver channel 3 is valid [0] (in _PXS_RXSRL)
  #define _PXS_VALID4           ((uint8_t) (0x01 << 4))        ///< ProxSense Valid bit for conversion data for receiver channel 4 is valid [0] (in _PXS_RXSRL)
  #define _PXS_VALID5           ((uint8_t) (0x01 << 5))        ///< ProxSense Valid bit for conversion data for receiver channel 5 is valid [0] (in _PXS_RXSRL)
  #define _PXS_VALID6           ((uint8_t) (0x01 << 6))        ///< ProxSense Valid bit for conversion data for receiver channel 6 is valid [0] (in _PXS_RXSRL)
  #define _PXS_VALID7           ((uint8_t) (0x01 << 7))        ///< ProxSense Valid bit for conversion data for receiver channel 7 is valid [0] (in _PXS_RXSRL)

  /* ProxSense Receiver Sampling Capacitor Selection for Channel N (0..9) (PXS_RXnCSSELR) */
  #define _PXS_RXnCSSEL         ((uint8_t) (0x1F << 0))        ///< ProxSense Sampling capacitor size of Receiver Channel 0 [4:0] (in _PXS_RXnCSSELR)
  #define _PXS_RXnCSSEL0        ((uint8_t) (0x01 << 0))        ///< ProxSense Sampling capacitor size of Receiver Channel 0 [0] (in _PXS_RXnCSSELR)
  #define _PXS_RXnCSSEL1        ((uint8_t) (0x01 << 1))        ///< ProxSense Sampling capacitor size of Receiver Channel 0 [1] (in _PXS_RXnCSSELR)
  #define _PXS_RXnCSSEL2        ((uint8_t) (0x01 << 2))        ///< ProxSense Sampling capacitor size of Receiver Channel 0 [2] (in _PXS_RXnCSSELR)
  #define _PXS_RXnCSSEL3        ((uint8_t) (0x01 << 3))        ///< ProxSense Sampling capacitor size of Receiver Channel 0 [3] (in _PXS_RXnCSSELR)
  #define _PXS_RXnCSSEL4        ((uint8_t) (0x01 << 4))        ///< ProxSense Sampling capacitor size of Receiver Channel 0 [4] (in _PXS_RXnCSSELR)
  // reserved [7:5]

#endif // PXS_AddressBase



//------------------------
// Global Configuration (CFG)
//------------------------
#if defined(CFG_AddressBase)

