STM8-SPL-license/discussion/Header/STM8TL5x.h
  /** @brief struct for Global Configuration registers (CFG) */
  typedef struct {

    /** @brief Global configuration register (CFG_GCR) */
    struct {
      _BITS   SWD     : 1;    ///< SWIM disable
      _BITS   AL      : 1;    ///< Activation level
      _BITS           : 6;    //   Reserved
    } GCR;

  } CFG_t;

  /* Pointer to CFG registers */
  #define _CFG          _SFR(CFG_t,    CFG_AddressBase)          ///< CFG struct/bit access
  #define _CFG_GCR      _SFR(uint8_t,  CFG_AddressBase+0x00)     ///< Global configuration register (CFG_GCR)

  /* CFG Module Reset Values */
  #define _CFG_GCR_RESET_VALUE         ((uint8_t)0x00)

  /* Global configuration register (CFG_GCR) */
  #define _CFG_SWD              ((uint8_t) (0x01 << 0))        ///< SWIM disable [0]
  #define _CFG_AL               ((uint8_t) (0x01 << 1))        ///< Activation level [0]
  // reserved [7:2]

#endif // CFG_AddressBase



//------------------------
// Interrupt Priority Module (ITC)
//------------------------
#if defined(ITC_AddressBase)

  /** @brief struct for setting interrupt Priority (ITC) */
  typedef struct {

    /** @brief interrupt priority register 1 (ITC_SPR1) */
    struct {
      _BITS             : 2;    //   Reserved (TLI always highest prio)
      _BITS   VECT1SPR  : 2;    ///< interrupt priority vector 1
      _BITS   VECT2SPR  : 2;    ///< interrupt priority vector 2
      _BITS             : 2;    //   Reserved
    } SPR1;


    /** @brief interrupt priority register 2 (ITC_SPR2) */
    struct {
      _BITS   VECT4SPR  : 2;    ///< interrupt priority vector 4
      _BITS             : 2;    //   Reserved
      _BITS   VECT6SPR  : 2;    ///< interrupt priority vector 6
      _BITS   VECT7SPR  : 2;    ///< interrupt priority vector 7
    } SPR2;


    /** @brief interrupt priority register 3 (ITC_SPR3) */
    struct {
      _BITS   VECT8SPR  : 2;    ///< interrupt priority vector 8
      _BITS   VECT9SPR  : 2;    ///< interrupt priority vector 9
      _BITS   VECT10SPR : 2;    ///< interrupt priority vector 10
      _BITS   VECT11SPR : 2;    ///< interrupt priority vector 11
    } SPR3;


    /** @brief interrupt priority register 4 (ITC_SPR4) */
    struct {
      _BITS   VECT12SPR : 2;    ///< interrupt priority vector 12
      _BITS   VECT13SPR : 2;    ///< interrupt priority vector 13
      _BITS   VECT14SPR : 2;    ///< interrupt priority vector 14
      _BITS   VECT15SPR : 2;    ///< interrupt priority vector 15
    } SPR4;


    /** @brief interrupt priority register 5 (ITC_SPR5) */
    struct {
      _BITS             : 6;    //   Reserved
      _BITS   VECT19SPR : 2;    ///< interrupt priority vector 19
    } SPR5;


    /** @brief interrupt priority register 6 (ITC_SPR6) */
    struct {
      _BITS   VECT20SPR : 2;    ///< interrupt priority vector 20
      _BITS   VECT21SPR : 2;    ///< interrupt priority vector 21
      _BITS   VECT22SPR : 2;    ///< interrupt priority vector 22
      _BITS             : 2;    //   Reserved
    } SPR6;


    /** @brief interrupt priority register 7 (ITC_SPR7) */
    struct {
      _BITS             : 2;    //   Reserved
      _BITS   VECT25SPR : 2;    ///< interrupt priority vector 25
      _BITS   VECT26SPR : 2;    ///< interrupt priority vector 26
      _BITS   VECT27SPR : 2;    ///< interrupt priority vector 27
    } SPR7;


    /** @brief interrupt priority register 8 (ITC_SPR8) */
    struct {
      _BITS   VECT28SPR : 2;    ///< interrupt priority vector 28
      _BITS   VECT29SPR : 2;    ///< interrupt priority vector 29
      _BITS             : 4;    //   Reserved
    } SPR8;

  } ITC_t;

  /* Pointer to ITC registers */
  #define _ITC          _SFR(ITC_t,    ITC_AddressBase)          ///< ITC struct/bit access
  #define _ITC_SPR1     _SFR(uint8_t,  ITC_AddressBase+0x00)     ///< Interrupt priority register 1/8
  #define _ITC_SPR2     _SFR(uint8_t,  ITC_AddressBase+0x01)     ///< Interrupt priority register 2/8
  #define _ITC_SPR3     _SFR(uint8_t,  ITC_AddressBase+0x02)     ///< Interrupt priority register 3/8
  #define _ITC_SPR4     _SFR(uint8_t,  ITC_AddressBase+0x03)     ///< Interrupt priority register 4/8
  #define _ITC_SPR5     _SFR(uint8_t,  ITC_AddressBase+0x04)     ///< Interrupt priority register 5/8
  #define _ITC_SPR6     _SFR(uint8_t,  ITC_AddressBase+0x05)     ///< Interrupt priority register 6/8
  #define _ITC_SPR7     _SFR(uint8_t,  ITC_AddressBase+0x06)     ///< Interrupt priority register 7/8
  #define _ITC_SPR8     _SFR(uint8_t,  ITC_AddressBase+0x07)     ///< Interrupt priority register 8/8

  /* ITC Module Reset Values */
  #define  _ITC_SPR1_RESET_VALUE       ((uint8_t) 0xFF)          ///< Interrupt priority register 1/8 reset value
  #define  _ITC_SPR2_RESET_VALUE       ((uint8_t) 0xFF)          ///< Interrupt priority register 2/8 reset value
  #define  _ITC_SPR3_RESET_VALUE       ((uint8_t) 0xFF)          ///< Interrupt priority register 3/8 reset value
  #define  _ITC_SPR4_RESET_VALUE       ((uint8_t) 0xFF)          ///< Interrupt priority register 4/8 reset value
  #define  _ITC_SPR5_RESET_VALUE       ((uint8_t) 0xFF)          ///< Interrupt priority register 5/8 reset value
  #define  _ITC_SPR6_RESET_VALUE       ((uint8_t) 0xFF)          ///< Interrupt priority register 6/8 reset value
  #define  _ITC_SPR7_RESET_VALUE       ((uint8_t) 0xFF)          ///< Interrupt priority register 7/8 reset value
  #define  _ITC_SPR8_RESET_VALUE       ((uint8_t) 0x0F)          ///< Interrupt priority register 8/8 reset value

  /* Software priority register 1 (ITC_SPR1) */
  // reserved [1:0]
  #define _ITC_VECT1SPR         ((uint8_t) (0x03 << 2))          ///< ITC interrupt priority vector 1 [1:0] (in _ITC_SPR1)
  #define _ITC_VECT1SPR0        ((uint8_t) (0x01 << 2))          ///< ITC interrupt priority vector 1 [0] (in _ITC_SPR1)
  #define _ITC_VECT1SPR1        ((uint8_t) (0x01 << 3))          ///< ITC interrupt priority vector 1 [1] (in _ITC_SPR1)
  #define _ITC_VECT2SPR         ((uint8_t) (0x03 << 4))          ///< ITC interrupt priority vector 2 [1:0] (in _ITC_SPR1)
  #define _ITC_VECT2SPR0        ((uint8_t) (0x01 << 4))          ///< ITC interrupt priority vector 2 [0] (in _ITC_SPR1)
  #define _ITC_VECT2SPR1        ((uint8_t) (0x01 << 5))          ///< ITC interrupt priority vector 2 [1] (in _ITC_SPR1)
  // reserved [7:6]

  /* Software priority register 2 (ITC_SPR2) */
  #define _ITC_VECT4SPR         ((uint8_t) (0x03 << 0))          ///< ITC interrupt priority vector 4 [1:0] (in _ITC_SPR2)
  #define _ITC_VECT4SPR0        ((uint8_t) (0x01 << 0))          ///< ITC interrupt priority vector 4 [0] (in _ITC_SPR2)
  #define _ITC_VECT4SPR1        ((uint8_t) (0x01 << 1))          ///< ITC interrupt priority vector 4 [1] (in _ITC_SPR2)
  // reserved [3:2]
  #define _ITC_VECT6SPR         ((uint8_t) (0x03 << 4))          ///< ITC interrupt priority vector 6 [1:0] (in _ITC_SPR2)
  #define _ITC_VECT6SPR0        ((uint8_t) (0x01 << 4))          ///< ITC interrupt priority vector 6 [0] (in _ITC_SPR2)
  #define _ITC_VECT6SPR1        ((uint8_t) (0x01 << 5))          ///< ITC interrupt priority vector 6 [1] (in _ITC_SPR2)
  #define _ITC_VECT7SPR         ((uint8_t) (0x03 << 6))          ///< ITC interrupt priority vector 7 [1:0] (in _ITC_SPR2)
  #define _ITC_VECT7SPR0        ((uint8_t) (0x01 << 6))          ///< ITC interrupt priority vector 7 [0] (in _ITC_SPR2)
  #define _ITC_VECT7SPR1        ((uint8_t) (0x01 << 7))          ///< ITC interrupt priority vector 7 [1] (in _ITC_SPR2)

  /* Software priority register 3 (ITC_SPR3) */
  #define _ITC_VECT8SPR         ((uint8_t) (0x03 << 0))          ///< ITC interrupt priority vector 8 [1:0] (in _ITC_SPR3)
  #define _ITC_VECT8SPR0        ((uint8_t) (0x01 << 0))          ///< ITC interrupt priority vector 8 [0] (in _ITC_SPR3)
  #define _ITC_VECT8SPR1        ((uint8_t) (0x01 << 1))          ///< ITC interrupt priority vector 8 [1] (in _ITC_SPR3)
  #define _ITC_VECT9SPR         ((uint8_t) (0x03 << 2))          ///< ITC interrupt priority vector 9 [1:0] (in _ITC_SPR3)
  #define _ITC_VECT9SPR0        ((uint8_t) (0x01 << 2))          ///< ITC interrupt priority vector 9 [0] (in _ITC_SPR3)
  #define _ITC_VECT9SPR1        ((uint8_t) (0x01 << 3))          ///< ITC interrupt priority vector 9 [1] (in _ITC_SPR3)
  #define _ITC_VECT10SPR        ((uint8_t) (0x03 << 4))          ///< ITC interrupt priority vector 10 [1:0] (in _ITC_SPR3)
  #define _ITC_VECT10SPR0       ((uint8_t) (0x01 << 4))          ///< ITC interrupt priority vector 10 [0] (in _ITC_SPR3)
  #define _ITC_VECT10SPR1       ((uint8_t) (0x01 << 5))          ///< ITC interrupt priority vector 10 [1] (in _ITC_SPR3)
  #define _ITC_VECT11SPR        ((uint8_t) (0x03 << 6))          ///< ITC interrupt priority vector 11 [1:0] (in _ITC_SPR3)
  #define _ITC_VECT11SPR0       ((uint8_t) (0x01 << 6))          ///< ITC interrupt priority vector 11 [0] (in _ITC_SPR3)
  #define _ITC_VECT11SPR1       ((uint8_t) (0x01 << 7))          ///< ITC interrupt priority vector 11 [1] (in _ITC_SPR3)

