STM8-SPL-license/discussion/Header/STM8TL5x.h
  /* Software priority register 4 (ITC_SPR4) */
  #define _ITC_VECT12SPR        ((uint8_t) (0x03 << 0))          ///< ITC interrupt priority vector 12 [1:0] (in _ITC_SPR4)
  #define _ITC_VECT12SPR0       ((uint8_t) (0x01 << 0))          ///< ITC interrupt priority vector 12 [0] (in _ITC_SPR4)
  #define _ITC_VECT12SPR1       ((uint8_t) (0x01 << 1))          ///< ITC interrupt priority vector 12 [1] (in _ITC_SPR4)
  #define _ITC_VECT13SPR        ((uint8_t) (0x03 << 2))          ///< ITC interrupt priority vector 13 [1:0] (in _ITC_SPR4)
  #define _ITC_VECT13SPR0       ((uint8_t) (0x01 << 2))          ///< ITC interrupt priority vector 13 [0] (in _ITC_SPR4)
  #define _ITC_VECT13SPR1       ((uint8_t) (0x01 << 3))          ///< ITC interrupt priority vector 13 [1] (in _ITC_SPR4)
  #define _ITC_VECT14SPR        ((uint8_t) (0x03 << 4))          ///< ITC interrupt priority vector 14 [1:0] (in _ITC_SPR4)
  #define _ITC_VECT14SPR0       ((uint8_t) (0x01 << 4))          ///< ITC interrupt priority vector 14 [0] (in _ITC_SPR4)
  #define _ITC_VECT14SPR1       ((uint8_t) (0x01 << 5))          ///< ITC interrupt priority vector 14 [1] (in _ITC_SPR4)
  #define _ITC_VECT15SPR        ((uint8_t) (0x03 << 6))          ///< ITC interrupt priority vector 15 [1:0] (in _ITC_SPR4)
  #define _ITC_VECT15SPR0       ((uint8_t) (0x01 << 6))          ///< ITC interrupt priority vector 15 [0] (in _ITC_SPR4)
  #define _ITC_VECT15SPR1       ((uint8_t) (0x01 << 7))          ///< ITC interrupt priority vector 15 [1] (in _ITC_SPR4)

  /* Software priority register 5 (ITC_SPR5) */
  // reserved [5:0]
  #define _ITC_VECT19SPR        ((uint8_t) (0x03 << 6))          ///< ITC interrupt priority vector 19 [1:0] (in _ITC_SPR5)
  #define _ITC_VECT19SPR0       ((uint8_t) (0x01 << 6))          ///< ITC interrupt priority vector 19 [0] (in _ITC_SPR5)
  #define _ITC_VECT19SPR1       ((uint8_t) (0x01 << 7))          ///< ITC interrupt priority vector 19 [1] (in _ITC_SPR5)

  /* Software priority register 6 (ITC_SPR6) */
  #define _ITC_VECT20SPR        ((uint8_t) (0x03 << 0))          ///< ITC interrupt priority vector 20 [1:0] (in _ITC_SPR6)
  #define _ITC_VECT20SPR0       ((uint8_t) (0x01 << 0))          ///< ITC interrupt priority vector 20 [0] (in _ITC_SPR6)
  #define _ITC_VECT20SPR1       ((uint8_t) (0x01 << 1))          ///< ITC interrupt priority vector 20 [1] (in _ITC_SPR6)
  #define _ITC_VECT21SPR        ((uint8_t) (0x03 << 2))          ///< ITC interrupt priority vector 21 [1:0] (in _ITC_SPR6)
  #define _ITC_VECT21SPR0       ((uint8_t) (0x01 << 2))          ///< ITC interrupt priority vector 21 [0] (in _ITC_SPR6)
  #define _ITC_VECT21SPR1       ((uint8_t) (0x01 << 3))          ///< ITC interrupt priority vector 21 [1] (in _ITC_SPR6)
  #define _ITC_VECT22SPR        ((uint8_t) (0x03 << 4))          ///< ITC interrupt priority vector 22 [1:0] (in _ITC_SPR6)
  #define _ITC_VECT22SPR0       ((uint8_t) (0x01 << 4))          ///< ITC interrupt priority vector 22 [0] (in _ITC_SPR6)
  #define _ITC_VECT22SPR1       ((uint8_t) (0x01 << 5))          ///< ITC interrupt priority vector 22 [1] (in _ITC_SPR6)
  // reserved [7:6]

  /* Software priority register 7 (ITC_SPR7) */
  // reserved [1:0]
  #define _ITC_VECT25SPR        ((uint8_t) (0x03 << 2))          ///< ITC interrupt priority vector 25 [1:0] (in _ITC_SPR7)
  #define _ITC_VECT25SPR0       ((uint8_t) (0x01 << 2))          ///< ITC interrupt priority vector 25 [0] (in _ITC_SPR7)
  #define _ITC_VECT25SPR1       ((uint8_t) (0x01 << 3))          ///< ITC interrupt priority vector 25 [1] (in _ITC_SPR7)
  #define _ITC_VECT26SPR        ((uint8_t) (0x03 << 4))          ///< ITC interrupt priority vector 26 [1:0] (in _ITC_SPR7)
  #define _ITC_VECT26SPR0       ((uint8_t) (0x01 << 4))          ///< ITC interrupt priority vector 26 [0] (in _ITC_SPR7)
  #define _ITC_VECT26SPR1       ((uint8_t) (0x01 << 5))          ///< ITC interrupt priority vector 26 [1] (in _ITC_SPR7)
  #define _ITC_VECT27SPR        ((uint8_t) (0x03 << 6))          ///< ITC interrupt priority vector 27 [1:0] (in _ITC_SPR7)
  #define _ITC_VECT27SPR0       ((uint8_t) (0x01 << 6))          ///< ITC interrupt priority vector 27 [0] (in _ITC_SPR7)
  #define _ITC_VECT27SPR1       ((uint8_t) (0x01 << 7))          ///< ITC interrupt priority vector 27 [1] (in _ITC_SPR7)

  /* Software priority register 8 (ITC_SPR8) */
  #define _ITC_VECT28SPR        ((uint8_t) (0x03 << 0))          ///< ITC interrupt priority vector 28 [1:0] (in _ITC_SPR8)
  #define _ITC_VECT28SPR0       ((uint8_t) (0x01 << 0))          ///< ITC interrupt priority vector 28 [0] (in _ITC_SPR8)
  #define _ITC_VECT28SPR1       ((uint8_t) (0x01 << 1))          ///< ITC interrupt priority vector 28 [1] (in _ITC_SPR8)
  #define _ITC_VECT29SPR        ((uint8_t) (0x03 << 2))          ///< ITC interrupt priority vector 29 [1:0] (in _ITC_SPR8)
  #define _ITC_VECT29SPR0       ((uint8_t) (0x01 << 2))          ///< ITC interrupt priority vector 29 [0] (in _ITC_SPR8)
  #define _ITC_VECT29SPR1       ((uint8_t) (0x01 << 3))          ///< ITC interrupt priority vector 29 [1] (in _ITC_SPR8)
  // reserved [7:4]

#endif // ITC_AddressBase


// undefine local macros
#undef _BITS

/*-----------------------------------------------------------------------------
    END OF MODULE DEFINITION FOR MULTIPLE INLUSION
-----------------------------------------------------------------------------*/
#endif // STM8TL5X_H

/** @}*/
